[
  {
    "author": "David Blake",
    "rating": 5,
    "date": "2025-10-03T01:29:27.000Z",
    "title": null,
    "text": "My classic '74 MGB roadster was kept dry and in fine shape for nearly two years during my house remodel.  When I drove it home, it started right up and Shalbindra filled the tires to the proper pressu..."
  },
  {
    "author": "Charles Christiansen",
    "rating": 5,
    "date": "2025-09-23T21:16:57.000Z",
    "title": null,
    "text": "Ease of use of the app, money saving over traditional storage facilities. Have used this app for two different reservations over the last couple years and have found everything to be above board would..."
  },
  {
    "author": "CHARLES H",
    "rating": 4,
    "date": "2025-09-17T07:45:13.000Z",
    "title": null,
    "text": "Finding a parking spot for our RV was easy with Neighbor. Martin helped locate the location and helped me with the process. Jason, the host, was easy to work with and easy to communicate with as well...."
  },
  {
    "author": "Fabio",
    "rating": 5,
    "date": "2025-08-11T18:52:33.000Z",
    "title": null,
    "text": "I needed a long term parking spot and aside from having multiple options right off the bat all within 2 miles of my house, I got put in contact with the host within hours and I had secure the spot by..."
  },
  {
    "author": "Janet Desmarais",
    "rating": 5,
    "date": "2025-10-03T21:57:36.000Z",
    "title": null,
    "text": "Best safe space ever. Extended stay. Lighted gated area. Great communication. Would highly recommend."
  },
  {
    "author": "Paul",
    "rating": 5,
    "date": "2025-08-24T00:03:38.000Z",
    "title": null,
    "text": "Great experience, highly secure note on site security with multiple gated locks.  Location is in the mangroves so buggy at times bed price around. I will use this facility again next year."
  },
  {
    "author": "Elise",
    "rating": 5,
    "date": "2025-10-02T20:30:12.000Z",
    "title": null,
    "text": "The space is very private behind a fence. It is easy to access, and the host is quick to respond when coordinating drop off and pick up."
  },
  {
    "author": "William Wallace",
    "rating": 3,
    "date": "2025-09-18T01:19:02.000Z",
    "title": null,
    "text": "For the most part its been good, once its up and running it takes very little maintenance.  However some new options have led to issues, for example rhe automatic approval feature. Renter had a 40 foo..."
  },
  {
    "author": "Tommy Shields",
    "rating": 5,
    "date": "2025-07-17T21:56:54.000Z",
    "title": null,
    "text": "The place is setup rather well. Easy to pull in and maneuver your camper into its assigned parking spot. Location is very convenient from 275. The owner was on top of setting me up with access and liv..."
  },
  {
    "author": "DD",
    "rating": 4,
    "date": "2024-11-04T21:08:00.000Z",
    "title": null,
    "text": "Neighbor was GREAT income, I'm going to begin using it again soon! THE customer services really protected me when a fraudulent client wanted to get $ out of me to pay for towing fees for a vehicle t..."
  },
  {
    "author": "Irene Glazer",
    "rating": 3,
    "date": "2025-09-15T06:40:09.000Z",
    "title": null,
    "text": "Would be much better if you prorated the service as I ended up spending more than I needed to because I didn’t need the whole rest of the month."
  },
  {
    "author": "Diane B",
    "rating": 5,
    "date": "2025-06-02T04:10:18.000Z",
    "title": null,
    "text": "Neighbor was an excellent company to deal with. They were very professional, honest, and trustworthy! There were no hidden fees, the host I eventually chose is amazing. Both the company, and the host,..."
  },
  {
    "author": "Mari",
    "rating": 5,
    "date": "2024-11-04T23:17:15.000Z",
    "title": null,
    "text": "The renter I have now is GREAT. Very nice guy. Very respectful. I would definitely recommend the app. Just make sure you do not give out your number. Better to keep any convo in the app because honest..."
  },
  {
    "author": "Deana A.",
    "rating": 5,
    "date": "2025-07-17T22:39:24.000Z",
    "title": null,
    "text": "Neighbor was such a great help to our family when we needed emergency storage fast!  We rented from Mr. Raghav who replied quickly and allowed us to rent his space.  No problems and he even allowed us..."
  },
  {
    "author": "Parke Blair",
    "rating": 5,
    "date": "2025-07-04T06:24:46.000Z",
    "title": null,
    "text": "I have several Cars, including an incredibly rare BMW Convertible that I needed a place to park in between moves/Homes while staying at AIRBNB's in between.\nIncredibly reasonable price, close proximi..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-05T23:23:08.000Z",
    "title": null,
    "text": "Neighbor offered options outside the standard mass storage facilities, and though hesitant at first, everything has gone smoothly and I was able to find a fantastic host in a good, safe and close-by l..."
  },
  {
    "author": "Red Dog",
    "rating": 5,
    "date": "2025-08-11T19:48:57.000Z",
    "title": null,
    "text": "We needed 2 53’ trailer spots immediately. Neighbor had the ideal location and at a very good price.  We were booked within minutes and the spaces were immediately available.  It’s hard to find places..."
  },
  {
    "author": "jen faux",
    "rating": 5,
    "date": "2025-06-13T21:26:22.000Z",
    "title": null,
    "text": "I had reached out to Bryce, last minute, and he was very accommodating. He also provided any and all pertinent information necessary to store our trailer. The lot itself is quite sizable with plenty o..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-10T19:47:40.000Z",
    "title": null,
    "text": "Jenna's spot was perfect for my temporary needs; easy access, decent price, and she kept an eye on things. I would recommend her for your outdoor vehicle storage needs. Thanks!"
  },
  {
    "author": "Matt Passios",
    "rating": 5,
    "date": "2025-09-21T23:37:31.000Z",
    "title": null,
    "text": "Good communication and great service. Just overall a really nice guy and will make sure whatever you keep parked there is safe."
  },
  {
    "author": "Allison Stokes",
    "rating": 5,
    "date": "2025-07-30T17:53:04.000Z",
    "title": null,
    "text": "Standard storage space for car while I was dealing with insurance post-accident. However, Jimmy was responsive and helpful when I needed to access the space and when I needed to have the car brought i..."
  },
  {
    "author": "Sofia",
    "rating": 5,
    "date": "2025-09-22T21:45:41.000Z",
    "title": null,
    "text": "This app worked well for me! I personally didn’t need to pay for the apps insurance is my only response, but other spots it may be a good call."
  },
  {
    "author": "Tiffany N",
    "rating": 5,
    "date": "2025-09-25T01:58:49.000Z",
    "title": null,
    "text": "Easy, quick communication from host, perfect spot to store my vehicle, well priced."
  },
  {
    "author": "DJ",
    "rating": 5,
    "date": "2025-08-15T22:49:07.000Z",
    "title": null,
    "text": "Easy transaction, good variety of places in the area that met all our needs. Seemless, stress-free long-term parking for our family vehicle."
  },
  {
    "author": "Holly",
    "rating": 5,
    "date": "2025-07-29T18:59:26.000Z",
    "title": null,
    "text": "Tisha has great rental spaces, we have had to move in and out a few times over the years and she is so nice and understanding when plans change. Always an easy move in, and move out experience"
  },
  {
    "author": "Matthew Plude",
    "rating": 5,
    "date": "2025-09-16T16:57:27.000Z",
    "title": null,
    "text": "Amazing host and beautiful property. Could not ask for a better place to store our RV. Highly recommend."
  },
  {
    "author": "Cyndi Gant",
    "rating": 4,
    "date": "2025-08-10T15:43:43.000Z",
    "title": null,
    "text": "Pretty easy to use. Messaging with potential renters is good. Only challenge I had was listing my garage. It seemed nothing met their criteria"
  },
  {
    "author": "Fatima Jones",
    "rating": 5,
    "date": "2025-08-18T13:51:29.000Z",
    "title": null,
    "text": "The space worked out for a while but then the town of where I rented from told host we would have to move our vehicle witch was fustrating"
  },
  {
    "author": "Scott Odenbrett",
    "rating": 5,
    "date": "2025-08-31T19:07:36.000Z",
    "title": null,
    "text": "I've used neighbor twice and have had great experiences both times.  It's easy to get started and when it's time to move on, it's easy to cancel."
  },
  {
    "author": "Mark Watson",
    "rating": 5,
    "date": "2025-09-04T01:27:26.000Z",
    "title": null,
    "text": "This is a great place to store a boat. It was easy access and I felt my boat was safe and secure while stored here. I stored my boat here for about 8 months and never had any issues and happily give a..."
  },
  {
    "author": "Clayton Lerch",
    "rating": 5,
    "date": "2025-09-17T19:06:55.000Z",
    "title": null,
    "text": "Great affordable rental space but i found a space a block from my house. I would recommend to anyone."
  },
  {
    "author": "Keith Stone",
    "rating": 5,
    "date": "2025-09-22T06:19:17.000Z",
    "title": null,
    "text": "Great host! Very flexible ! Awesome space, super easy  in and out! Security gate"
  },
  {
    "author": "Alex h",
    "rating": 5,
    "date": "2025-09-13T15:54:43.000Z",
    "title": null,
    "text": "Fantastic experience with Neighbor and my host. I would highly recommend and would use again in the future."
  },
  {
    "author": "Curt Wood",
    "rating": 5,
    "date": "2025-08-30T03:43:40.000Z",
    "title": null,
    "text": "Easy to access, plenty of room, clean space.  Worked out perfectly so I could store a vehicle while I needed the space in my personal garage."
  },
  {
    "author": "Michael C",
    "rating": 5,
    "date": "2025-09-26T02:41:58.000Z",
    "title": null,
    "text": "Great communication, and a nice out-of-view location with easy access.  I highly recommend Mark!"
  },
  {
    "author": "Matthew Spadoni",
    "rating": 5,
    "date": "2025-10-02T19:31:06.000Z",
    "title": null,
    "text": "Fernando was a great host. I will be back next spring when boat season resumes!"
  },
  {
    "author": "Ez",
    "rating": 5,
    "date": "2025-09-28T15:27:50.000Z",
    "title": null,
    "text": "This was much more affordable and convenient than traditional storage spaces. The host was extra communicative also."
  },
  {
    "author": "IllWill",
    "rating": 5,
    "date": "2025-10-01T14:59:44.000Z",
    "title": null,
    "text": "This helped me tremendously with my car that broke down"
  },
  {
    "author": "Tony Roberts",
    "rating": 5,
    "date": "2025-10-01T17:56:35.000Z",
    "title": null,
    "text": "Lots of space. Always accessible."
  },
  {
    "author": "Janeth Hernandez",
    "rating": 5,
    "date": "2025-09-23T14:29:47.000Z",
    "title": null,
    "text": "Jeff was great! Accommodated my needs at the last minute. Thank you Jeff!"
  },
  {
    "author": "Richard R.",
    "rating": 5,
    "date": "2025-10-01T00:53:21.000Z",
    "title": null,
    "text": "Good overall experience.  No issues. Huge and safe location."
  },
  {
    "author": "anthony",
    "rating": 5,
    "date": "2025-09-30T17:02:16.000Z",
    "title": null,
    "text": "Very responsive. Easy drop off"
  },
  {
    "author": "M Walker",
    "rating": 5,
    "date": "2025-09-26T19:01:43.000Z",
    "title": null,
    "text": "Trobi is a Great Host! Her property can host most Anything with Wheels."
  },
  {
    "author": "Jason & Stephanie Patterson",
    "rating": 5,
    "date": "2025-03-20T01:11:48.000Z",
    "title": null,
    "text": "Going on my third full year of being a host.  Had a couple of issues with renters and neighbor did as promised and rectified my issues each time.  April in the trust and safety department and Marcos t..."
  },
  {
    "author": "Becca Matta",
    "rating": 5,
    "date": "2025-05-05T22:48:25.000Z",
    "title": null,
    "text": "**Highly recommend renting this spot!** I used J's parking spot as long-term storage for my car while I traveled abroad for a few months and it was a really great experience! J was super responsive an..."
  },
  {
    "author": "Tiffany Phillips",
    "rating": 5,
    "date": "2025-04-13T12:15:24.000Z",
    "title": null,
    "text": "Kevin and Lee are phenomenal hosts. Their prompt responses helped make my mind up of which facility I chose. They are kind and professional and their facility has cameras and a swamp cooler which mad..."
  },
  {
    "author": "Ely Souza",
    "rating": 5,
    "date": "2025-08-08T10:23:10.000Z",
    "title": null,
    "text": "Great experience was able to find a place to park our trailer within just a few minutes saved us hundreds of dollars love this app"
  },
  {
    "author": "Subbu boy",
    "rating": 5,
    "date": "2025-07-26T18:42:08.000Z",
    "title": null,
    "text": "Great experience! The host was very responsive and made communication easy throughout the booking. The pickup and drop-off location was convenient and easy to find. Everything went smoothly—highly rec..."
  },
  {
    "author": "Will Mak",
    "rating": 5,
    "date": "2025-05-28T02:51:10.000Z",
    "title": null,
    "text": "⭐️⭐️⭐️⭐️⭐️ Outstanding Service – Highly Recommend!\n\nKimberly made the entire vehicle storage process incredibly smooth from start to finish. What could’ve been confusing and time-consuming turned ou..."
  },
  {
    "author": "A B",
    "rating": 1,
    "date": "2025-09-28T19:47:24.000Z",
    "title": "The landlord of the space was terrible…",
    "text": "The landlord of the space was terrible with communication, and even though we signed up for a rental for an indefinite period of time she canceled it with little or no notice, and never actually completed the cancellation, which charged our card for an additional month"
  },
  {
    "author": "Gh Ost",
    "rating": 1,
    "date": "2025-09-19T16:24:21.000Z",
    "title": "Used the website please don’t",
    "text": "Used the website, for quotes. I Was immediately swarmed with pushy sales calls 10+ per day quoting rates significantly higher than what’s posted on the site! I tried to contact a property owner to discuss their actual rate, to find out he didn’t own the property!! The calls have not stopped! The rates keep going up lol. My spam folder is up to 216 with this company, it’s been 2 weeks. No unsubscribe button! Beware and check the BBB and other sites as this one seems a little fake."
  },
  {
    "author": "Chris A",
    "rating": 1,
    "date": "2025-09-15T03:34:54.000Z",
    "title": "Car gone and protection plan not honored",
    "text": "I rented a space to store my vehicle using Neighbor. I purchased the protection plan. During this time my vehicle was towed because the person I leased from was evicted and my vehicle was sold. They do not honor their protection plan and refuse to speak with you on the phone. Do not use this service"
  },
  {
    "author": "Jasmine Timon",
    "rating": 1,
    "date": "2025-08-03T10:06:10.000Z",
    "title": "This owner isn’t a resident at this location and they aren’t authorized to rent this space .",
    "text": "I want to share my experience renting a parking spot from Troy, as it raises serious concerns. Initially, I believed this space would be secure; however, it has become clear that he does not actually reside in the unit. He would often instruct me to enter the gates behind other vehicles due to his frequent absences, which made me question the legitimacy of this arrangement. Adding to my concerns, I received two parking tickets while using this space, indicating that he does not have the authority to rent it out. This individual is knowingly leasing a space without the right to do so, misrepresenting their residency while collecting payments for a service they are not authorized to provide. This is clearly fraudulent behavior. Therefore, I strongly urge Neighbor to review this situation carefully and consider removing this host from their platform to protect potential renters from experiencing similar issues in the future."
  },
  {
    "author": "Name Unknown",
    "rating": 1,
    "date": "2025-07-20T20:33:29.000Z",
    "title": "No reply from the one I contacted",
    "text": "No reply from the one I contacted, instead i get many messages from neighbor marketing offering more expensive units. terrible company.  I just use public storage."
  },
  {
    "author": "K Z (KZ)",
    "rating": 1,
    "date": "2025-07-10T21:46:43.000Z",
    "title": "25% lost in fees.",
    "text": "I have no problem with the $50 a month fee. However they charge a whole bunch of other fees, including 5% just to get paid. Payment is 1 month later. When all is done the fees abount to about 25%. Their model sucks and is designed to fleece the renter."
  },
  {
    "author": "Slava Viktorenkov",
    "rating": 1,
    "date": "2025-07-08T18:58:57.000Z",
    "title": "Bunch of liars and scammers!",
    "text": "Bunch of liars and scammers! They will get you with the subscription, that you never intended to have."
  },
  {
    "author": "David",
    "rating": 1,
    "date": "2025-06-03T23:51:23.000Z",
    "title": "My host was an out of control idiot who…",
    "text": "My host was an out of control idiot who didn’t read his own contract.  Per my contract there were no reserved spots but my host claimed I was parked where I wasn’t supposed to be.  When I pointed out to him that he was incorrect he decided I needed to move boat ASAP.  Within 12 hours or he would have it towed so I was forced to take off work.  The people at Neighbor were of NO HELP and only interested in collecting their fee.  Certainly not interested in dealing with a rogue host!"
  },
  {
    "author": "Lu SIfer",
    "rating": 1,
    "date": "2025-05-15T20:42:42.000Z",
    "title": "What a pathetic app where you can't use…",
    "text": "What a pathetic app where you can't use a name you prefer so they kick you out of the app indefinitely! But they know my address so what is so incriminating about giving a name that I go by but you know exactly where I live because I put my location on! What a pathetic app! A guy trying to better himself by looking for jobs on the app! What a way to take food out of my mouth! If I could you would get -1 stars PATHETIC!!!"
  },
  {
    "author": "Scott",
    "rating": 1,
    "date": "2025-05-15T01:15:03.000Z",
    "title": "Be ware of scammers",
    "text": "They host a company posing as a legitimate garage parking host. I was able to cancel before the 24 hours once I realized this wasn't legit. But now neighbor won't stop calling me to \"fix\" the issue. Here is one way...post the review I submitted about the company so others don't get caught up in the scam...and I don't know....maybe kick them off your page."
  },
  {
    "author": "Michael LaVecchia",
    "rating": 1,
    "date": "2025-05-13T00:15:59.000Z",
    "title": "Someone called back to back to back 3…",
    "text": "Someone called back to back to back 3 times right in a row while I was at an appointment…for this reason alone I wish to be removed from any and all lists and placed on your do not contact list.  Super unprofessional and just downright rude."
  },
  {
    "author": "Michelle McKeever",
    "rating": 1,
    "date": "2025-05-03T11:35:16.000Z",
    "title": "Transitional and unsafe!",
    "text": "Watch out! Neighbor.com can SCAM. Auto renew does not cancel. Online form mishandles coordinating information to vendors! This online, fly-by-night company cannot yet address serious situations. Transitional and unsafe!  My Lexus was TOWED due to a \"bug\" where online form supports the input of VIN number.  Company unresponsive and continued on with months of auto renewal payments.  AVOID Neighbor.com!"
  },
  {
    "author": "Jeremy DeeEm",
    "rating": 1,
    "date": "2025-04-25T19:06:19.000Z",
    "title": "The Neighbor-hood Sucks",
    "text": "Where to begin.  I could right volumes about the dysfunction and ineptitude of Neighbor.com. My most recent issue hosting with Neighbor.com:  they failed to vet a scammer named Felix Odhiambo that reserved a spot on my land for a month.  On the very first day, Felix used his truck to destroy most of my driveway and also leave 2' deep ruts in the grassy areas.  Then he left without reporting the severe damage. Did Neighbor help address the issue.  Hell no.  Rather than answer my messages promptly, they refunded the scammer, docked my payout by 70% (without notification to me) and waited a full week to finally respond, telling me they won't help one bit. I have so many horror stories with Neighbor.com.  If you're dumb enough to list with them, prepare for the onslaught of calls from their staff trying to force fit potential renters onto your space despite your very clear listing about what can and cannot be stored. Oh, and leave a constructive review and the owners will respond with a passive aggressive and snarky response rather than acknowledging their errors. Just remember that all of their policies-- from very delayed payouts to only unilaterally allowing guests to leave reviews of hosts, but not the other way around. Steer clear of these yahoos. I'm another host that will have to seek legal remedies to get them to do the right thing. The really crazy part is that I've instructed them to close my account several times and they won't!"
  },
  {
    "author": "blue sky",
    "rating": 1,
    "date": "2025-04-19T19:03:12.000Z",
    "title": "I would’ve given zero if possible",
    "text": "I would’ve given zero if possible. The worst Customer Service ever. I have a storage space and I wanted to list it with them they used to call me Or text me or email me multiple times a day, the listing was put as draft and not published. And when I had questions, they will not answer the questions And they completely ignored and never responded To my questions, But the reply used to talk about how to publish And they keep on insisting to rent my storage for way cheaper. I asked the same question four times and four times they ignore the question and keep talking about something else. I can definitely tell you that whatever makes them money. That’s The only thing they talk about. They don’t address your concerns. They don’t address any issues. I am out of words if they will not even answer your questions what is the point in event paying them for your own space and making them money? Obviously, needless to say, I posted on other sites and I already found people renting within 48 hours. I had to even research to see if this is a legitimate site or not as this almost sounds like a site with bots. Only one sided talking."
  },
  {
    "author": "RD",
    "rating": 1,
    "date": "2025-04-03T19:51:29.000Z",
    "title": "They stole my van",
    "text": "Avoid this company at all costs. I paid for a parking spot through Neighbor, but my van got wrongfully towed for no reason with no notice. I only realized 6 weeks into my subscription when I went to move my van and it was gone. I found out it had been towed and the towing company demanded $5,000 to return it! Neighbor admitted it was their fault and said they could get the money from the parking garage, but instead of just paying the towing company, they told me I had to pay $5,000 upfront in cash. I told them I don’t have $5,000 and that they could have easily paid the tow yard directly or sent me the money first. They refused. While they kept delaying, the tow company put a lien on my van and sold it. Thanks to Neighbor, I lost my van, and now they won’t take responsibility. Absolute scam."
  },
  {
    "author": "Russle",
    "rating": 1,
    "date": "2025-03-13T05:45:37.000Z",
    "title": "100% Risk: This App Put My Truck in Danger\"**",
    "text": "This app does not provide clear information, pictures, or exact addresses. The worst part about this app is that it is not safe for your truck, car, or belongings. I would not recommend this app to anyone. There is a 100% chance that your vehicle or item could end up in the hands of criminals. Do not use the Neighbors app if you want to keep your vehicle safe. Instead, consider booking with a more reliable app. Neighbors is not a trustworthy or reliable app. My truck was booked through this app and parked in an unauthorized space, which resulted in a ticket and my vehicle being tow warned"
  },
  {
    "author": "Ocean",
    "rating": 1,
    "date": "2025-03-09T06:11:23.000Z",
    "title": "Horrific company",
    "text": "Horrific company. I have been a host for about 18 months and their customer service is beyond horrific. Despite multiple requests to speak to a live person over many months, I have never received any response. There is zero support for hosts and that's essential because some renters will lie just to secure your space. I have also had several of their rental employees give false info to potential renters in order to secure a new client."
  },
  {
    "author": "Amanda",
    "rating": 1,
    "date": "2025-02-20T16:58:57.000Z",
    "title": "Terrible billing system",
    "text": "Terrible billing system. I ended my Paid account. I then continued to receive delinquent account notifications, for 4 weeks after my account was over. Terrible, terrible billing services and customer service. * I will never use Neighbor again. The most unorganized app I’ve ever used."
  },
  {
    "author": "Tesla",
    "rating": 1,
    "date": "2025-02-20T06:40:12.000Z",
    "title": "Stay away from Neighbor",
    "text": "Stay away from Neighbor. They run a terrible business."
  },
  {
    "author": "oilwellfixer",
    "rating": 1,
    "date": "2025-02-16T19:53:17.000Z",
    "title": "We went through them because we had to",
    "text": "We went through them because we had to. Thet are basically a billing company. Non of the communication regarding our Rec Nation storage unit came from them. We canceled our storage unit through Rec Nation. We gave early notice, and were out over 10 days before we were supposed to be. But guess who kept taking payments? Neighbor did. Even after receiving an email from them directly, that charges will be reversed. And funds taken would be returned. Its just another greedy little corporate pig feeding at rhe trough of hard working, and un suspecting folks. I will avoid any company using them in the future.And still fighting 6 weeks later for money they didn't earn."
  },
  {
    "author": "David Blake",
    "rating": 5,
    "date": "2025-10-03T01:29:27.000Z",
    "title": null,
    "text": "My classic '74 MGB roadster was kept dry and in fine shape for nearly two years during my house remodel.  When I drove it home, it started right up and Shalbindra filled the tires to the proper pressu..."
  },
  {
    "author": "Charles Christiansen",
    "rating": 5,
    "date": "2025-09-23T21:16:57.000Z",
    "title": null,
    "text": "Ease of use of the app, money saving over traditional storage facilities. Have used this app for two different reservations over the last couple years and have found everything to be above board would..."
  },
  {
    "author": "CHARLES H",
    "rating": 4,
    "date": "2025-09-17T07:45:13.000Z",
    "title": null,
    "text": "Finding a parking spot for our RV was easy with Neighbor. Martin helped locate the location and helped me with the process. Jason, the host, was easy to work with and easy to communicate with as well...."
  },
  {
    "author": "Fabio",
    "rating": 5,
    "date": "2025-08-11T18:52:33.000Z",
    "title": null,
    "text": "I needed a long term parking spot and aside from having multiple options right off the bat all within 2 miles of my house, I got put in contact with the host within hours and I had secure the spot by..."
  },
  {
    "author": "Janet Desmarais",
    "rating": 5,
    "date": "2025-10-03T21:57:36.000Z",
    "title": null,
    "text": "Best safe space ever. Extended stay. Lighted gated area. Great communication. Would highly recommend."
  },
  {
    "author": "Paul",
    "rating": 5,
    "date": "2025-08-24T00:03:38.000Z",
    "title": null,
    "text": "Great experience, highly secure note on site security with multiple gated locks.  Location is in the mangroves so buggy at times bed price around. I will use this facility again next year."
  },
  {
    "author": "Elise",
    "rating": 5,
    "date": "2025-10-02T20:30:12.000Z",
    "title": null,
    "text": "The space is very private behind a fence. It is easy to access, and the host is quick to respond when coordinating drop off and pick up."
  },
  {
    "author": "William Wallace",
    "rating": 3,
    "date": "2025-09-18T01:19:02.000Z",
    "title": null,
    "text": "For the most part its been good, once its up and running it takes very little maintenance.  However some new options have led to issues, for example rhe automatic approval feature. Renter had a 40 foo..."
  },
  {
    "author": "Tommy Shields",
    "rating": 5,
    "date": "2025-07-17T21:56:54.000Z",
    "title": null,
    "text": "The place is setup rather well. Easy to pull in and maneuver your camper into its assigned parking spot. Location is very convenient from 275. The owner was on top of setting me up with access and liv..."
  },
  {
    "author": "DD",
    "rating": 4,
    "date": "2024-11-04T21:08:00.000Z",
    "title": null,
    "text": "Neighbor was GREAT income, I'm going to begin using it again soon! THE customer services really protected me when a fraudulent client wanted to get $ out of me to pay for towing fees for a vehicle t..."
  },
  {
    "author": "Irene Glazer",
    "rating": 3,
    "date": "2025-09-15T06:40:09.000Z",
    "title": null,
    "text": "Would be much better if you prorated the service as I ended up spending more than I needed to because I didn’t need the whole rest of the month."
  },
  {
    "author": "Diane B",
    "rating": 5,
    "date": "2025-06-02T04:10:18.000Z",
    "title": null,
    "text": "Neighbor was an excellent company to deal with. They were very professional, honest, and trustworthy! There were no hidden fees, the host I eventually chose is amazing. Both the company, and the host,..."
  },
  {
    "author": "Mari",
    "rating": 5,
    "date": "2024-11-04T23:17:15.000Z",
    "title": null,
    "text": "The renter I have now is GREAT. Very nice guy. Very respectful. I would definitely recommend the app. Just make sure you do not give out your number. Better to keep any convo in the app because honest..."
  },
  {
    "author": "Deana A.",
    "rating": 5,
    "date": "2025-07-17T22:39:24.000Z",
    "title": null,
    "text": "Neighbor was such a great help to our family when we needed emergency storage fast!  We rented from Mr. Raghav who replied quickly and allowed us to rent his space.  No problems and he even allowed us..."
  },
  {
    "author": "Parke Blair",
    "rating": 5,
    "date": "2025-07-04T06:24:46.000Z",
    "title": null,
    "text": "I have several Cars, including an incredibly rare BMW Convertible that I needed a place to park in between moves/Homes while staying at AIRBNB's in between.\nIncredibly reasonable price, close proximi..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-05T23:23:08.000Z",
    "title": null,
    "text": "Neighbor offered options outside the standard mass storage facilities, and though hesitant at first, everything has gone smoothly and I was able to find a fantastic host in a good, safe and close-by l..."
  },
  {
    "author": "Red Dog",
    "rating": 5,
    "date": "2025-08-11T19:48:57.000Z",
    "title": null,
    "text": "We needed 2 53’ trailer spots immediately. Neighbor had the ideal location and at a very good price.  We were booked within minutes and the spaces were immediately available.  It’s hard to find places..."
  },
  {
    "author": "jen faux",
    "rating": 5,
    "date": "2025-06-13T21:26:22.000Z",
    "title": null,
    "text": "I had reached out to Bryce, last minute, and he was very accommodating. He also provided any and all pertinent information necessary to store our trailer. The lot itself is quite sizable with plenty o..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-10T19:47:40.000Z",
    "title": null,
    "text": "Jenna's spot was perfect for my temporary needs; easy access, decent price, and she kept an eye on things. I would recommend her for your outdoor vehicle storage needs. Thanks!"
  },
  {
    "author": "Matt Passios",
    "rating": 5,
    "date": "2025-09-21T23:37:31.000Z",
    "title": null,
    "text": "Good communication and great service. Just overall a really nice guy and will make sure whatever you keep parked there is safe."
  },
  {
    "author": "Allison Stokes",
    "rating": 5,
    "date": "2025-07-30T17:53:04.000Z",
    "title": null,
    "text": "Standard storage space for car while I was dealing with insurance post-accident. However, Jimmy was responsive and helpful when I needed to access the space and when I needed to have the car brought i..."
  },
  {
    "author": "Sofia",
    "rating": 5,
    "date": "2025-09-22T21:45:41.000Z",
    "title": null,
    "text": "This app worked well for me! I personally didn’t need to pay for the apps insurance is my only response, but other spots it may be a good call."
  },
  {
    "author": "Tiffany N",
    "rating": 5,
    "date": "2025-09-25T01:58:49.000Z",
    "title": null,
    "text": "Easy, quick communication from host, perfect spot to store my vehicle, well priced."
  },
  {
    "author": "DJ",
    "rating": 5,
    "date": "2025-08-15T22:49:07.000Z",
    "title": null,
    "text": "Easy transaction, good variety of places in the area that met all our needs. Seemless, stress-free long-term parking for our family vehicle."
  },
  {
    "author": "Holly",
    "rating": 5,
    "date": "2025-07-29T18:59:26.000Z",
    "title": null,
    "text": "Tisha has great rental spaces, we have had to move in and out a few times over the years and she is so nice and understanding when plans change. Always an easy move in, and move out experience"
  },
  {
    "author": "Matthew Plude",
    "rating": 5,
    "date": "2025-09-16T16:57:27.000Z",
    "title": null,
    "text": "Amazing host and beautiful property. Could not ask for a better place to store our RV. Highly recommend."
  },
  {
    "author": "Cyndi Gant",
    "rating": 4,
    "date": "2025-08-10T15:43:43.000Z",
    "title": null,
    "text": "Pretty easy to use. Messaging with potential renters is good. Only challenge I had was listing my garage. It seemed nothing met their criteria"
  },
  {
    "author": "Fatima Jones",
    "rating": 5,
    "date": "2025-08-18T13:51:29.000Z",
    "title": null,
    "text": "The space worked out for a while but then the town of where I rented from told host we would have to move our vehicle witch was fustrating"
  },
  {
    "author": "Scott Odenbrett",
    "rating": 5,
    "date": "2025-08-31T19:07:36.000Z",
    "title": null,
    "text": "I've used neighbor twice and have had great experiences both times.  It's easy to get started and when it's time to move on, it's easy to cancel."
  },
  {
    "author": "Mark Watson",
    "rating": 5,
    "date": "2025-09-04T01:27:26.000Z",
    "title": null,
    "text": "This is a great place to store a boat. It was easy access and I felt my boat was safe and secure while stored here. I stored my boat here for about 8 months and never had any issues and happily give a..."
  },
  {
    "author": "Clayton Lerch",
    "rating": 5,
    "date": "2025-09-17T19:06:55.000Z",
    "title": null,
    "text": "Great affordable rental space but i found a space a block from my house. I would recommend to anyone."
  },
  {
    "author": "Keith Stone",
    "rating": 5,
    "date": "2025-09-22T06:19:17.000Z",
    "title": null,
    "text": "Great host! Very flexible ! Awesome space, super easy  in and out! Security gate"
  },
  {
    "author": "Alex h",
    "rating": 5,
    "date": "2025-09-13T15:54:43.000Z",
    "title": null,
    "text": "Fantastic experience with Neighbor and my host. I would highly recommend and would use again in the future."
  },
  {
    "author": "Curt Wood",
    "rating": 5,
    "date": "2025-08-30T03:43:40.000Z",
    "title": null,
    "text": "Easy to access, plenty of room, clean space.  Worked out perfectly so I could store a vehicle while I needed the space in my personal garage."
  },
  {
    "author": "Michael C",
    "rating": 5,
    "date": "2025-09-26T02:41:58.000Z",
    "title": null,
    "text": "Great communication, and a nice out-of-view location with easy access.  I highly recommend Mark!"
  },
  {
    "author": "Matthew Spadoni",
    "rating": 5,
    "date": "2025-10-02T19:31:06.000Z",
    "title": null,
    "text": "Fernando was a great host. I will be back next spring when boat season resumes!"
  },
  {
    "author": "Ez",
    "rating": 5,
    "date": "2025-09-28T15:27:50.000Z",
    "title": null,
    "text": "This was much more affordable and convenient than traditional storage spaces. The host was extra communicative also."
  },
  {
    "author": "IllWill",
    "rating": 5,
    "date": "2025-10-01T14:59:44.000Z",
    "title": null,
    "text": "This helped me tremendously with my car that broke down"
  },
  {
    "author": "Tony Roberts",
    "rating": 5,
    "date": "2025-10-01T17:56:35.000Z",
    "title": null,
    "text": "Lots of space. Always accessible."
  },
  {
    "author": "Janeth Hernandez",
    "rating": 5,
    "date": "2025-09-23T14:29:47.000Z",
    "title": null,
    "text": "Jeff was great! Accommodated my needs at the last minute. Thank you Jeff!"
  },
  {
    "author": "Richard R.",
    "rating": 5,
    "date": "2025-10-01T00:53:21.000Z",
    "title": null,
    "text": "Good overall experience.  No issues. Huge and safe location."
  },
  {
    "author": "anthony",
    "rating": 5,
    "date": "2025-09-30T17:02:16.000Z",
    "title": null,
    "text": "Very responsive. Easy drop off"
  },
  {
    "author": "M Walker",
    "rating": 5,
    "date": "2025-09-26T19:01:43.000Z",
    "title": null,
    "text": "Trobi is a Great Host! Her property can host most Anything with Wheels."
  },
  {
    "author": "Jason & Stephanie Patterson",
    "rating": 5,
    "date": "2025-03-20T01:11:48.000Z",
    "title": null,
    "text": "Going on my third full year of being a host.  Had a couple of issues with renters and neighbor did as promised and rectified my issues each time.  April in the trust and safety department and Marcos t..."
  },
  {
    "author": "Becca Matta",
    "rating": 5,
    "date": "2025-05-05T22:48:25.000Z",
    "title": null,
    "text": "**Highly recommend renting this spot!** I used J's parking spot as long-term storage for my car while I traveled abroad for a few months and it was a really great experience! J was super responsive an..."
  },
  {
    "author": "Tiffany Phillips",
    "rating": 5,
    "date": "2025-04-13T12:15:24.000Z",
    "title": null,
    "text": "Kevin and Lee are phenomenal hosts. Their prompt responses helped make my mind up of which facility I chose. They are kind and professional and their facility has cameras and a swamp cooler which mad..."
  },
  {
    "author": "Ely Souza",
    "rating": 5,
    "date": "2025-08-08T10:23:10.000Z",
    "title": null,
    "text": "Great experience was able to find a place to park our trailer within just a few minutes saved us hundreds of dollars love this app"
  },
  {
    "author": "Subbu boy",
    "rating": 5,
    "date": "2025-07-26T18:42:08.000Z",
    "title": null,
    "text": "Great experience! The host was very responsive and made communication easy throughout the booking. The pickup and drop-off location was convenient and easy to find. Everything went smoothly—highly rec..."
  },
  {
    "author": "Will Mak",
    "rating": 5,
    "date": "2025-05-28T02:51:10.000Z",
    "title": null,
    "text": "⭐️⭐️⭐️⭐️⭐️ Outstanding Service – Highly Recommend!\n\nKimberly made the entire vehicle storage process incredibly smooth from start to finish. What could’ve been confusing and time-consuming turned ou..."
  },
  {
    "author": "Gregory Lampe, MD",
    "rating": 1,
    "date": "2025-02-11T23:16:31.000Z",
    "title": "Car Was Stolen While Being Stored with Neighbor.com",
    "text": "I was initially excited about Neighbor.com—it seemed like a great concept. However, my experience turned into a nightmare. I rented a parking space for my 2015 Honda Accord, and for the first three months, everything seemed fine. Then, my car was STOLEN from the rented space. What’s worse, I received no assistance from the host or from Neighbor.com in trying to recover it. There was no meaningful support, no help in navigating the situation, and no real accountability from the platform. My car is still missing, and this experience has left me deeply disappointed. If you’re considering using Neighbor.com for vehicle storage, think twice—there is little to no security, and you’re on your own if something goes wrong."
  },
  {
    "author": "Luis alejandro Rivera",
    "rating": 1,
    "date": "2025-01-01T02:01:54.000Z",
    "title": "Worst scam ever",
    "text": "Worst scam ever. Im a host , the renter did no pay for 3 months and i couldnt do anything .. i reach out to the platform but they said 4 months into i will be allow to tow the camper . Do no do bussiness with those ppl . There are the worst scam"
  },
  {
    "author": "Mommamia05",
    "rating": 1,
    "date": "2024-12-19T20:35:02.000Z",
    "title": "lots of calls to get banking info but…",
    "text": "lots of calls to get banking info but --the company has NO main office phone # to call. just contracted sales reps working from home whenever.... no 24/7 english speaking real humans. seems more of a chinese scam or govt data collection site. not seeing real happy campers or renters or hosts."
  },
  {
    "author": "Alex J. S.",
    "rating": 1,
    "date": "2024-12-13T05:03:59.000Z",
    "title": "I’m disappointed with Neighbor.com…",
    "text": "I’m disappointed with Neighbor.com customer service - when I contacted them that I have a bad experience with their host - Neighbor rep was not helpful. I was forced to remove my travel trailer early because their host was unprofessional jerk - he became hostile as soon as I was charged for the full month, my trailer was removed days later but no partial credit or refund was given as I understood (from Neighbor management) will be the case."
  },
  {
    "author": "Debra Jacobson",
    "rating": 1,
    "date": "2024-12-09T20:01:18.000Z",
    "title": "Don't use this web site",
    "text": "Don't use this web site! They take your private phone number and info and then call and solicit you!"
  },
  {
    "author": "Stever",
    "rating": 1,
    "date": "2024-12-07T18:00:07.000Z",
    "title": "Don't recommend",
    "text": "Very poor website makes using their services difficult and painful."
  },
  {
    "author": "Scott Levy",
    "rating": 1,
    "date": "2024-11-27T21:59:08.000Z",
    "title": "Lack of live operator customer service…",
    "text": "Lack of live operator customer service and when I sent an email to them as they asked for I was given more questions than answers.  I simply asked why I haven’t received payment and the response was I didn’t get paid.  Unfortunately this company follows suit of so many other where you have a problem and they basically say fix it yourself.   This is far from the service I received a year ago when I gave a shining review."
  },
  {
    "author": "David Kinderdine",
    "rating": 1,
    "date": "2024-11-20T21:30:33.000Z",
    "title": "I am a first time host",
    "text": "I am a first time host. I discovered they did not honor the price I set. They charged the renter a high fee and shorted me what I was due. I also could not register my bank account # to be paid. Their customer service is of little use. They will not call you and randomly answer their email. It bad enough they wait 30 days to pay you and then not making it easy to be paid is very frustrating."
  },
  {
    "author": "customer",
    "rating": 1,
    "date": "2024-11-12T06:36:54.000Z",
    "title": "Bad Faith!",
    "text": "All my items were stolen from the first 3 weeks out of my RV!  Then I was denied the insurance I purchased.  Horrible and in bad faith.  $6000! Stolen"
  },
  {
    "author": "Steve",
    "rating": 1,
    "date": "2024-11-12T04:59:11.000Z",
    "title": "Facebook’s low quality competition",
    "text": "Why is it that when you get a notification you have to pull up the whole post.  This is a waste of time.  There are post that I have no interest in or people.  I usually delete about 99% of them.  This site is a joke."
  },
  {
    "author": "Anonymous",
    "rating": 1,
    "date": "2024-11-09T21:25:28.000Z",
    "title": "When I approve someone to book my spot…",
    "text": "When I approve someone to book my spot and they cancel on me they should be charged the cancellation fee for wasting my damn time"
  },
  {
    "author": "Anne",
    "rating": 1,
    "date": "2024-11-06T10:20:17.000Z",
    "title": "This is not a serious company. Do not use them",
    "text": "I was unable to move in to the parking space as scheduled despite assurances from the Neighbors agent that I would have 24/7 move-in access when I booked. The building had no record of the reservation and could give no indication of when I would get access to the garage, other than that it would be at least 24-48 hours. This left me scrambling to make other arrangements. Meanwhile Neighbors has not responded to three messages requesting a refund, and their support line is always unstaffed. This is a not a serious company. Do not use them."
  },
  {
    "author": "sandra musselwhite",
    "rating": 1,
    "date": "2024-11-05T20:37:49.000Z",
    "title": "i am still waiting for a refund from…",
    "text": "i am still waiting for a refund from almost 2 years ago this time I have had very little response one guy wanted me to move my car from my driveway every week so he could take his car from my garage where he was supposed to be storing it for $150 so he could go joy riding--FOR $150 PER WEEK--AT HIS CONVIENCE??>?"
  },
  {
    "author": "Tammy Scribner",
    "rating": 1,
    "date": "2024-11-05T02:08:00.000Z",
    "title": "if you need to call go ahead but…",
    "text": "if you need to call go ahead but everything should be in notes not caring or helpfull at all and took months before i got my money!"
  },
  {
    "author": "Rhonda",
    "rating": 1,
    "date": "2024-11-04T20:36:09.000Z",
    "title": "I have excellent reviews",
    "text": "I have excellent reviews. but when someone messages me after 11PM and I am sleeping.. I can not get back to them until I wake up.  That ruins my record and I cannot be a top renter.. that's not fair"
  },
  {
    "author": "No chance ever again",
    "rating": 1,
    "date": "2024-11-04T05:21:28.000Z",
    "title": "Horrible customer service",
    "text": "Horrible customer service. Finding a person to talk to is like finding a needle in a haystack. The email support is completely useless and have you go around in circles. They take a huge fee from you and from the renter. Better to use another Sevice."
  },
  {
    "author": "Jason",
    "rating": 1,
    "date": "2024-10-31T21:44:23.000Z",
    "title": "I am a host on neighbor and I am trying…",
    "text": "I am a host on neighbor and I am trying to speak to someone for over a week now to know how to changed my bank information. Representative from neighbor keep sending me emails how to change my bank account information but I Am.not getting no where with the steps they send me"
  },
  {
    "author": "Orestes Espinosa",
    "rating": 1,
    "date": "2024-10-31T17:30:55.000Z",
    "title": "I was renting a lots they play games…",
    "text": "I was renting a lots they play games with paying you your money they'll hold your money for 3-4 months and then give you some nonsense excuse how they couldn't access your account or something stupid they've done it for the last two years usually starting around September October this year they did it back in August and in February they hold your money for 2 or 3 months and then when you realize you're not being deposited you call them and they give you just nonsense excuses"
  },
  {
    "author": "Angelica",
    "rating": 1,
    "date": "2024-10-31T01:22:29.000Z",
    "title": "It’s hard to get a hold of someone in…",
    "text": "It’s hard to get a hold of someone in the office as I reached out to one of the clients that hasn’t RV in my home and it’s not replying. She needs to come and fix her flat tire and change her cover on the RV since it’s all from the sun, as I would be giving her dates to move out, she’s not replied within 10 days"
  },
  {
    "author": "Kristopher",
    "rating": 1,
    "date": "2024-10-29T21:57:07.000Z",
    "title": "Nobody rents from me since you raised…",
    "text": "Nobody rents from me since you raised prices."
  },
  {
    "author": "David Blake",
    "rating": 5,
    "date": "2025-10-03T01:29:27.000Z",
    "title": null,
    "text": "My classic '74 MGB roadster was kept dry and in fine shape for nearly two years during my house remodel.  When I drove it home, it started right up and Shalbindra filled the tires to the proper pressu..."
  },
  {
    "author": "Charles Christiansen",
    "rating": 5,
    "date": "2025-09-23T21:16:57.000Z",
    "title": null,
    "text": "Ease of use of the app, money saving over traditional storage facilities. Have used this app for two different reservations over the last couple years and have found everything to be above board would..."
  },
  {
    "author": "CHARLES H",
    "rating": 4,
    "date": "2025-09-17T07:45:13.000Z",
    "title": null,
    "text": "Finding a parking spot for our RV was easy with Neighbor. Martin helped locate the location and helped me with the process. Jason, the host, was easy to work with and easy to communicate with as well...."
  },
  {
    "author": "Fabio",
    "rating": 5,
    "date": "2025-08-11T18:52:33.000Z",
    "title": null,
    "text": "I needed a long term parking spot and aside from having multiple options right off the bat all within 2 miles of my house, I got put in contact with the host within hours and I had secure the spot by..."
  },
  {
    "author": "Janet Desmarais",
    "rating": 5,
    "date": "2025-10-03T21:57:36.000Z",
    "title": null,
    "text": "Best safe space ever. Extended stay. Lighted gated area. Great communication. Would highly recommend."
  },
  {
    "author": "Paul",
    "rating": 5,
    "date": "2025-08-24T00:03:38.000Z",
    "title": null,
    "text": "Great experience, highly secure note on site security with multiple gated locks.  Location is in the mangroves so buggy at times bed price around. I will use this facility again next year."
  },
  {
    "author": "Elise",
    "rating": 5,
    "date": "2025-10-02T20:30:12.000Z",
    "title": null,
    "text": "The space is very private behind a fence. It is easy to access, and the host is quick to respond when coordinating drop off and pick up."
  },
  {
    "author": "William Wallace",
    "rating": 3,
    "date": "2025-09-18T01:19:02.000Z",
    "title": null,
    "text": "For the most part its been good, once its up and running it takes very little maintenance.  However some new options have led to issues, for example rhe automatic approval feature. Renter had a 40 foo..."
  },
  {
    "author": "Tommy Shields",
    "rating": 5,
    "date": "2025-07-17T21:56:54.000Z",
    "title": null,
    "text": "The place is setup rather well. Easy to pull in and maneuver your camper into its assigned parking spot. Location is very convenient from 275. The owner was on top of setting me up with access and liv..."
  },
  {
    "author": "DD",
    "rating": 4,
    "date": "2024-11-04T21:08:00.000Z",
    "title": null,
    "text": "Neighbor was GREAT income, I'm going to begin using it again soon! THE customer services really protected me when a fraudulent client wanted to get $ out of me to pay for towing fees for a vehicle t..."
  },
  {
    "author": "Irene Glazer",
    "rating": 3,
    "date": "2025-09-15T06:40:09.000Z",
    "title": null,
    "text": "Would be much better if you prorated the service as I ended up spending more than I needed to because I didn’t need the whole rest of the month."
  },
  {
    "author": "Diane B",
    "rating": 5,
    "date": "2025-06-02T04:10:18.000Z",
    "title": null,
    "text": "Neighbor was an excellent company to deal with. They were very professional, honest, and trustworthy! There were no hidden fees, the host I eventually chose is amazing. Both the company, and the host,..."
  },
  {
    "author": "Mari",
    "rating": 5,
    "date": "2024-11-04T23:17:15.000Z",
    "title": null,
    "text": "The renter I have now is GREAT. Very nice guy. Very respectful. I would definitely recommend the app. Just make sure you do not give out your number. Better to keep any convo in the app because honest..."
  },
  {
    "author": "Deana A.",
    "rating": 5,
    "date": "2025-07-17T22:39:24.000Z",
    "title": null,
    "text": "Neighbor was such a great help to our family when we needed emergency storage fast!  We rented from Mr. Raghav who replied quickly and allowed us to rent his space.  No problems and he even allowed us..."
  },
  {
    "author": "Parke Blair",
    "rating": 5,
    "date": "2025-07-04T06:24:46.000Z",
    "title": null,
    "text": "I have several Cars, including an incredibly rare BMW Convertible that I needed a place to park in between moves/Homes while staying at AIRBNB's in between.\nIncredibly reasonable price, close proximi..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-05T23:23:08.000Z",
    "title": null,
    "text": "Neighbor offered options outside the standard mass storage facilities, and though hesitant at first, everything has gone smoothly and I was able to find a fantastic host in a good, safe and close-by l..."
  },
  {
    "author": "Red Dog",
    "rating": 5,
    "date": "2025-08-11T19:48:57.000Z",
    "title": null,
    "text": "We needed 2 53’ trailer spots immediately. Neighbor had the ideal location and at a very good price.  We were booked within minutes and the spaces were immediately available.  It’s hard to find places..."
  },
  {
    "author": "jen faux",
    "rating": 5,
    "date": "2025-06-13T21:26:22.000Z",
    "title": null,
    "text": "I had reached out to Bryce, last minute, and he was very accommodating. He also provided any and all pertinent information necessary to store our trailer. The lot itself is quite sizable with plenty o..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-10T19:47:40.000Z",
    "title": null,
    "text": "Jenna's spot was perfect for my temporary needs; easy access, decent price, and she kept an eye on things. I would recommend her for your outdoor vehicle storage needs. Thanks!"
  },
  {
    "author": "Matt Passios",
    "rating": 5,
    "date": "2025-09-21T23:37:31.000Z",
    "title": null,
    "text": "Good communication and great service. Just overall a really nice guy and will make sure whatever you keep parked there is safe."
  },
  {
    "author": "Allison Stokes",
    "rating": 5,
    "date": "2025-07-30T17:53:04.000Z",
    "title": null,
    "text": "Standard storage space for car while I was dealing with insurance post-accident. However, Jimmy was responsive and helpful when I needed to access the space and when I needed to have the car brought i..."
  },
  {
    "author": "Sofia",
    "rating": 5,
    "date": "2025-09-22T21:45:41.000Z",
    "title": null,
    "text": "This app worked well for me! I personally didn’t need to pay for the apps insurance is my only response, but other spots it may be a good call."
  },
  {
    "author": "Tiffany N",
    "rating": 5,
    "date": "2025-09-25T01:58:49.000Z",
    "title": null,
    "text": "Easy, quick communication from host, perfect spot to store my vehicle, well priced."
  },
  {
    "author": "DJ",
    "rating": 5,
    "date": "2025-08-15T22:49:07.000Z",
    "title": null,
    "text": "Easy transaction, good variety of places in the area that met all our needs. Seemless, stress-free long-term parking for our family vehicle."
  },
  {
    "author": "Holly",
    "rating": 5,
    "date": "2025-07-29T18:59:26.000Z",
    "title": null,
    "text": "Tisha has great rental spaces, we have had to move in and out a few times over the years and she is so nice and understanding when plans change. Always an easy move in, and move out experience"
  },
  {
    "author": "Matthew Plude",
    "rating": 5,
    "date": "2025-09-16T16:57:27.000Z",
    "title": null,
    "text": "Amazing host and beautiful property. Could not ask for a better place to store our RV. Highly recommend."
  },
  {
    "author": "Cyndi Gant",
    "rating": 4,
    "date": "2025-08-10T15:43:43.000Z",
    "title": null,
    "text": "Pretty easy to use. Messaging with potential renters is good. Only challenge I had was listing my garage. It seemed nothing met their criteria"
  },
  {
    "author": "Fatima Jones",
    "rating": 5,
    "date": "2025-08-18T13:51:29.000Z",
    "title": null,
    "text": "The space worked out for a while but then the town of where I rented from told host we would have to move our vehicle witch was fustrating"
  },
  {
    "author": "Scott Odenbrett",
    "rating": 5,
    "date": "2025-08-31T19:07:36.000Z",
    "title": null,
    "text": "I've used neighbor twice and have had great experiences both times.  It's easy to get started and when it's time to move on, it's easy to cancel."
  },
  {
    "author": "Mark Watson",
    "rating": 5,
    "date": "2025-09-04T01:27:26.000Z",
    "title": null,
    "text": "This is a great place to store a boat. It was easy access and I felt my boat was safe and secure while stored here. I stored my boat here for about 8 months and never had any issues and happily give a..."
  },
  {
    "author": "Clayton Lerch",
    "rating": 5,
    "date": "2025-09-17T19:06:55.000Z",
    "title": null,
    "text": "Great affordable rental space but i found a space a block from my house. I would recommend to anyone."
  },
  {
    "author": "Keith Stone",
    "rating": 5,
    "date": "2025-09-22T06:19:17.000Z",
    "title": null,
    "text": "Great host! Very flexible ! Awesome space, super easy  in and out! Security gate"
  },
  {
    "author": "Alex h",
    "rating": 5,
    "date": "2025-09-13T15:54:43.000Z",
    "title": null,
    "text": "Fantastic experience with Neighbor and my host. I would highly recommend and would use again in the future."
  },
  {
    "author": "Curt Wood",
    "rating": 5,
    "date": "2025-08-30T03:43:40.000Z",
    "title": null,
    "text": "Easy to access, plenty of room, clean space.  Worked out perfectly so I could store a vehicle while I needed the space in my personal garage."
  },
  {
    "author": "Michael C",
    "rating": 5,
    "date": "2025-09-26T02:41:58.000Z",
    "title": null,
    "text": "Great communication, and a nice out-of-view location with easy access.  I highly recommend Mark!"
  },
  {
    "author": "Matthew Spadoni",
    "rating": 5,
    "date": "2025-10-02T19:31:06.000Z",
    "title": null,
    "text": "Fernando was a great host. I will be back next spring when boat season resumes!"
  },
  {
    "author": "Ez",
    "rating": 5,
    "date": "2025-09-28T15:27:50.000Z",
    "title": null,
    "text": "This was much more affordable and convenient than traditional storage spaces. The host was extra communicative also."
  },
  {
    "author": "IllWill",
    "rating": 5,
    "date": "2025-10-01T14:59:44.000Z",
    "title": null,
    "text": "This helped me tremendously with my car that broke down"
  },
  {
    "author": "Tony Roberts",
    "rating": 5,
    "date": "2025-10-01T17:56:35.000Z",
    "title": null,
    "text": "Lots of space. Always accessible."
  },
  {
    "author": "Janeth Hernandez",
    "rating": 5,
    "date": "2025-09-23T14:29:47.000Z",
    "title": null,
    "text": "Jeff was great! Accommodated my needs at the last minute. Thank you Jeff!"
  },
  {
    "author": "Richard R.",
    "rating": 5,
    "date": "2025-10-01T00:53:21.000Z",
    "title": null,
    "text": "Good overall experience.  No issues. Huge and safe location."
  },
  {
    "author": "anthony",
    "rating": 5,
    "date": "2025-09-30T17:02:16.000Z",
    "title": null,
    "text": "Very responsive. Easy drop off"
  },
  {
    "author": "M Walker",
    "rating": 5,
    "date": "2025-09-26T19:01:43.000Z",
    "title": null,
    "text": "Trobi is a Great Host! Her property can host most Anything with Wheels."
  },
  {
    "author": "Jason & Stephanie Patterson",
    "rating": 5,
    "date": "2025-03-20T01:11:48.000Z",
    "title": null,
    "text": "Going on my third full year of being a host.  Had a couple of issues with renters and neighbor did as promised and rectified my issues each time.  April in the trust and safety department and Marcos t..."
  },
  {
    "author": "Becca Matta",
    "rating": 5,
    "date": "2025-05-05T22:48:25.000Z",
    "title": null,
    "text": "**Highly recommend renting this spot!** I used J's parking spot as long-term storage for my car while I traveled abroad for a few months and it was a really great experience! J was super responsive an..."
  },
  {
    "author": "Tiffany Phillips",
    "rating": 5,
    "date": "2025-04-13T12:15:24.000Z",
    "title": null,
    "text": "Kevin and Lee are phenomenal hosts. Their prompt responses helped make my mind up of which facility I chose. They are kind and professional and their facility has cameras and a swamp cooler which mad..."
  },
  {
    "author": "Ely Souza",
    "rating": 5,
    "date": "2025-08-08T10:23:10.000Z",
    "title": null,
    "text": "Great experience was able to find a place to park our trailer within just a few minutes saved us hundreds of dollars love this app"
  },
  {
    "author": "Subbu boy",
    "rating": 5,
    "date": "2025-07-26T18:42:08.000Z",
    "title": null,
    "text": "Great experience! The host was very responsive and made communication easy throughout the booking. The pickup and drop-off location was convenient and easy to find. Everything went smoothly—highly rec..."
  },
  {
    "author": "Will Mak",
    "rating": 5,
    "date": "2025-05-28T02:51:10.000Z",
    "title": null,
    "text": "⭐️⭐️⭐️⭐️⭐️ Outstanding Service – Highly Recommend!\n\nKimberly made the entire vehicle storage process incredibly smooth from start to finish. What could’ve been confusing and time-consuming turned ou..."
  },
  {
    "author": "Wayne",
    "rating": 1,
    "date": "2024-10-29T01:05:07.000Z",
    "title": "Well the fact that you guys didn't…",
    "text": "Well the fact that you guys didn't notify me that my payment wasn't going through to my account for one the eviction process is ridiculous for two and for three there is not enough information about any of the processes nor is anybody very helpful or very quick to reply we are expected to reply within minutes and I have to wait 3 days for a response from your staff"
  },
  {
    "author": "Anthony",
    "rating": 1,
    "date": "2024-10-24T22:48:07.000Z",
    "title": "You need to do better if you want people to continue using their space so your company can make money",
    "text": "For someone who is a host that has 5 star reviews because I take care of my customers by going above and beyond. I expected this platform to take care of me when their renter defaulted. I was owed an additional month and instead got shorted."
  },
  {
    "author": "Kevin Mahar",
    "rating": 1,
    "date": "2024-10-24T22:30:52.000Z",
    "title": "Make sure your town won’t decide that you can’t store vehicles",
    "text": "The town decided that even though it was not against any regulation that I could no longer store vehicles on my property. The whole process was extremely stressful. So many people were irate that they had to move, and that the email that was sent out by NEIGHBOR said that they would be assisted in finding other places to rent. However, they were not assisted. I also asked for assistance from NEIGHBOR, which once I eventually connected with someone, they were actually very thorough and helpful."
  },
  {
    "author": "Marina LaRue",
    "rating": 1,
    "date": "2024-10-24T05:38:56.000Z",
    "title": "I stopped the reservation the same day…",
    "text": "I stopped the reservation the same day I made it and notified the host. A month later was charged for sept  and oct. I emailed Neighbor and explained I the situation and they only gave me an 80 percent refund because \"The host held the spot for me and deserves compensation\" The only reason I stopped the reservation the same day was because the host Mark had to go mow his yard and couldn't take my RV for at least another 5 days. So I found another spot to store it. I did everything right and still got charged for a spot I never used. Very sketchy company!"
  },
  {
    "author": "Jeremy DeeEm",
    "rating": 1,
    "date": "2024-10-25T01:06:08.000Z",
    "title": "Don't criticize them or they will violate privacy and reveal sensitive customer data publicly.  They also refuse to follow their own terms of service.",
    "text": "UPDATE: Neighbor.com's response to my critical review is to reveal sensitive customer data and, well... just lie their asses off in a snarky and deameaning manner.  As such, I've updated my star rating from 2-star to 1-star. Read their response... its completely an invasion of privacy and gaslighting the situation in an attempt to make themselves look better rather than apologize for their blatant misdeeds.  DO NOT TRUST THIS COMPANY. Also note that whenever someone posts a critical review of Neighbor.com, magically 3-4 fake glowing reviews are posted in the hours after. Congrats on failing How to Respond to a Critical Review 101.  Gaslighting?  Revealing customer information and data?  Snarky response?  Attempt to spin the narrative?  No acknowledgement of responsibility? No apology? Passive aggressive much? In my case, Neighbor.com knowingly allowed a customer that never once visited the property or bring their vehicle post a retaliatory 1-star review as retribution for not getting a full refund.  Neighbor.com claims to only accept relevant and unbiased reviews, but actually discourages both. If Neighbor.com actually cared about the integrity of the review process, there would be a bilateral review policy that posts both reviews of landowners and customers.  Don't believe the rhetoric and propaganda they spew; they're a high pressure sales driven organization and overcharges customers, underpays landowners and they refuse to close a landowner's account despite numerous written requests. Neighbor.com simply refuses to follow their own terms of service regarding review content.  They also claim to have a fair review process, but it is entirely unilateral, with only the customer providing a review the landowner and not the other way around let me tell you…like bad landowners, there are some really bad customers out there.  Why protect one and not the other? Neighbor.com also charges excessive service fees and hold onto funds for prolonged amounts of time before disbursement to landowner in order to make money off the interest you pay PLUS their exorbitant fees and excessive hidden costs."
  },
  {
    "author": "Kate",
    "rating": 1,
    "date": "2024-10-19T08:52:42.000Z",
    "title": "Constantly sold out website",
    "text": "So many lovely things on the website, but always sold out. More stock needs to be bought in. Really frustrating."
  },
  {
    "author": "Consumer",
    "rating": 1,
    "date": "2024-09-27T20:28:33.000Z",
    "title": "If I could give zero stats I would",
    "text": "If I could give zero stats I would. We had a customer stop paying 6 months ago, neighbor paid for the first sixty days but has failed to secure towing services. There customer service is non existent, no response to emails and the phone lines are no longer operational. Don’t become a host unless you’re okay with having a big uninsured liability left on you property that you’re not being paid for."
  },
  {
    "author": "Darrell K",
    "rating": 1,
    "date": "2024-10-09T15:36:52.000Z",
    "title": "Neighbor's Customer Service EARNS A 1Star Ratingr",
    "text": "Yesterday, my father-in-law sent me a link that showed me some space rentals. I'm a disabled vet now retired so I'm on a VERY fixed income. I've been renting a 10X20 unit for 11 years and that rent has gone through the roof. I found a space, well priced so it will save me money and be closer to where I'm at. I contacted the host via the Neighbor app. We exchanged messages. He said he'd call me today and indeed a call came in with the ID said, Neighbor. I answered. It wasn't the host it was customer service rep. I could barely understand her broken English but, the bottom line was she wanted me to Reserve the place and give them my method of payment right then. I fonx̌t know about you, but I don't lay out money, upfront sight unseen and told her exactly that. In fact I had to tell her that 4 (FOUR) times. To say that she was aggressive is a bit understated. I wasn't rude, but I was adamant and when I told her the 4th time, she hung up on me. There's quite a lot of 1Star reviews about Neighbor.com and now there's one more."
  },
  {
    "author": "customer",
    "rating": 1,
    "date": "2024-09-16T01:12:47.000Z",
    "title": "Customer service needs to be a lot…",
    "text": "Customer service needs to be a lot better I've had a problem with my account and I've sent numerous emails and I still haven't heard back"
  },
  {
    "author": "C J",
    "rating": 1,
    "date": "2024-09-13T10:00:42.000Z",
    "title": "HORRIBLE PRIVACY INVASION",
    "text": "I joined looking to rent a driveway. Phone number is listed as private in your profile, and I assumed would only be shared once I contacted a host, agreed to something, AND settled payment. Nope. A day after registering I am getting calls from unknown local numbers and some \"specialist\" from the site leaving me voicemails about storage spaces. Blocked them all. I did NOT consent for my personal phone # to be shared so blatantly. Immediately clicked the button to delete my account but it says it will take a day AND that they will try to call me again. Horrible and creepy!"
  },
  {
    "author": "Steve Fields",
    "rating": 1,
    "date": "2024-08-04T11:26:59.000Z",
    "title": "Totally scam",
    "text": "Totally scam. I don't recommend to anyone for Neighbor.com."
  },
  {
    "author": "MM",
    "rating": 1,
    "date": "2024-07-29T20:08:30.000Z",
    "title": "This is a total scam",
    "text": "This is a total scam. I rented a trailer but when I arrived to get it the trailer neded a 2 5/16 ball and I had a 2 inch ball. The ball was stuck onto the hitch ao I had to go home to get the ball off and purchase an appropriate ball. I did so and was heading back, all within the time I had paid for, but the renter cancelled the rental and the n=company refused to return my money. I didn't cancel the rental but they kept my money."
  },
  {
    "author": "E B",
    "rating": 1,
    "date": "2024-07-10T02:53:26.000Z",
    "title": "Had a garage that I wanted to post on…",
    "text": "Had a garage that I wanted to post on there but after talking with one of their sales guys Arthur I back out because he was so shady. Disappointed to say the least. It seems like a decent set up but they need better people in charge to walk potential property managers through everything."
  },
  {
    "author": "customer",
    "rating": 1,
    "date": "2024-06-15T00:54:38.000Z",
    "title": "We weren't able to move into the spot…",
    "text": "We weren't able to move into the spot and Neighbor won't refund our money."
  },
  {
    "author": "Over This",
    "rating": 1,
    "date": "2024-06-11T01:57:35.000Z",
    "title": "Guarantee is MEANINGLESS, and staff is a bunch of TROLLS :(",
    "text": "First, I got a derilict renter who parked what was likely a stolen vehicle in my space, and \"Neighbor,\" with their MEANINGLESS guarantee, would do absolutely Nothing to get the car towed ...and because I mentioned that I have an \"HOA\" (Condo Board) through whom I'd have to get the car towed, since Neighbor was no help, and expressed that I was frustrated, they then \"SUSPENDED\" _MYYY_ membership,when I was the victim(!), and started requiring me to prove that I'm allowed to rent my space, with a letter from my HOA ...YET, even though my account was \"suspended,\" my listing still stayed active, and I was still getting renters, BUT _not able to communicate_ with them, which was stressful, and when I asked them that I'm still able to get reservations and please (unrestrict my account, and) let me communicate with members, the representative NASTILY quipped \"Thanks for pointing that out,\" and DROPPED THE BOMB ON ME that they had shut down my account, and my renter was gone-- ..._I am out of work, right now, and this rental was my only small source of income_, and I AM DEVASTATED... Please, don't use Neighbor, because, it's unimaginable how much can go wrong, seriously wrong, and not only will they not have your back, if you complain they will PUNISH you :( Good luck everyone out there, I hope you can find alternate sources of income... And ...Be kind to each other, please :("
  },
  {
    "author": "Piotr Brzezinski",
    "rating": 1,
    "date": "2024-06-01T10:21:41.000Z",
    "title": "Absolute disaster with neighbor.com",
    "text": "Absolute disaster with neighbor.com My car has been blocked in by another car -- effectively impounded -- and neighbor.com has done absolutely nothing to help me regain access to my car"
  },
  {
    "author": "Ann Arbor",
    "rating": 1,
    "date": "2024-05-21T08:26:45.000Z",
    "title": "Aggressive Upselling Tactics: A Red Flag Experience with Neighbor.com",
    "text": "I signed up for the Neighbor.com site on Friday and started a draft of my listing. I immediately received a phone call from their sales rep, which I didn't pick up. By Monday, I had received nearly a dozen text messages, phone calls, and emails. This aggressive upselling is a big red flag for this company."
  },
  {
    "author": "Yuki Tokuyama",
    "rating": 1,
    "date": "2024-05-16T22:08:13.000Z",
    "title": "The website is SO BAD",
    "text": "The website is SO BAD.  Already makes me wonder how this company is in business with hands down THE MOST ANNOYING, CRAPPIEST WEBSITE I HAVE EVER EXPERIENCED IN 25 YEARS. Created an account to make a reservation and I login and as soon as I click on ANYTHING it asks me to login again.  I login and it sends me to the homepage, then I click on something and it asks me to login again.  What kind of amateur crap is this?  You guys already suck in my book.  I have to call customer service and wait on hold forever just to use you crappy website?  COME ON.  Just go out of business already"
  },
  {
    "author": "kevin",
    "rating": 1,
    "date": "2024-05-08T02:01:33.000Z",
    "title": "I parked my car with protection plan",
    "text": "I parked my car with protection plan, I ended up having my car, scratches all over my brand new car! Neighbor, refuse to pay my protection payment with bogus excuses! This is one of the most corrupt business practice ı came a cross! Dont ever work with Neighbor or you will lose all your money/ goods!"
  },
  {
    "author": "Vicki S. Rinard",
    "rating": 1,
    "date": "2024-05-07T20:59:00.000Z",
    "title": "What a nightmare",
    "text": "What a nightmare! I inquired about a space to store my motorhome, When I drove by to look at it I could see there was no way that it would be safe or secure! When I tried to cancel they would not respond, I tried e mail and Phone. Horrible Customer Service! Horrible Company."
  },
  {
    "author": "David Blake",
    "rating": 5,
    "date": "2025-10-03T01:29:27.000Z",
    "title": null,
    "text": "My classic '74 MGB roadster was kept dry and in fine shape for nearly two years during my house remodel.  When I drove it home, it started right up and Shalbindra filled the tires to the proper pressu..."
  },
  {
    "author": "Charles Christiansen",
    "rating": 5,
    "date": "2025-09-23T21:16:57.000Z",
    "title": null,
    "text": "Ease of use of the app, money saving over traditional storage facilities. Have used this app for two different reservations over the last couple years and have found everything to be above board would..."
  },
  {
    "author": "CHARLES H",
    "rating": 4,
    "date": "2025-09-17T07:45:13.000Z",
    "title": null,
    "text": "Finding a parking spot for our RV was easy with Neighbor. Martin helped locate the location and helped me with the process. Jason, the host, was easy to work with and easy to communicate with as well...."
  },
  {
    "author": "Fabio",
    "rating": 5,
    "date": "2025-08-11T18:52:33.000Z",
    "title": null,
    "text": "I needed a long term parking spot and aside from having multiple options right off the bat all within 2 miles of my house, I got put in contact with the host within hours and I had secure the spot by..."
  },
  {
    "author": "Janet Desmarais",
    "rating": 5,
    "date": "2025-10-03T21:57:36.000Z",
    "title": null,
    "text": "Best safe space ever. Extended stay. Lighted gated area. Great communication. Would highly recommend."
  },
  {
    "author": "Paul",
    "rating": 5,
    "date": "2025-08-24T00:03:38.000Z",
    "title": null,
    "text": "Great experience, highly secure note on site security with multiple gated locks.  Location is in the mangroves so buggy at times bed price around. I will use this facility again next year."
  },
  {
    "author": "Elise",
    "rating": 5,
    "date": "2025-10-02T20:30:12.000Z",
    "title": null,
    "text": "The space is very private behind a fence. It is easy to access, and the host is quick to respond when coordinating drop off and pick up."
  },
  {
    "author": "William Wallace",
    "rating": 3,
    "date": "2025-09-18T01:19:02.000Z",
    "title": null,
    "text": "For the most part its been good, once its up and running it takes very little maintenance.  However some new options have led to issues, for example rhe automatic approval feature. Renter had a 40 foo..."
  },
  {
    "author": "Tommy Shields",
    "rating": 5,
    "date": "2025-07-17T21:56:54.000Z",
    "title": null,
    "text": "The place is setup rather well. Easy to pull in and maneuver your camper into its assigned parking spot. Location is very convenient from 275. The owner was on top of setting me up with access and liv..."
  },
  {
    "author": "DD",
    "rating": 4,
    "date": "2024-11-04T21:08:00.000Z",
    "title": null,
    "text": "Neighbor was GREAT income, I'm going to begin using it again soon! THE customer services really protected me when a fraudulent client wanted to get $ out of me to pay for towing fees for a vehicle t..."
  },
  {
    "author": "Irene Glazer",
    "rating": 3,
    "date": "2025-09-15T06:40:09.000Z",
    "title": null,
    "text": "Would be much better if you prorated the service as I ended up spending more than I needed to because I didn’t need the whole rest of the month."
  },
  {
    "author": "Diane B",
    "rating": 5,
    "date": "2025-06-02T04:10:18.000Z",
    "title": null,
    "text": "Neighbor was an excellent company to deal with. They were very professional, honest, and trustworthy! There were no hidden fees, the host I eventually chose is amazing. Both the company, and the host,..."
  },
  {
    "author": "Mari",
    "rating": 5,
    "date": "2024-11-04T23:17:15.000Z",
    "title": null,
    "text": "The renter I have now is GREAT. Very nice guy. Very respectful. I would definitely recommend the app. Just make sure you do not give out your number. Better to keep any convo in the app because honest..."
  },
  {
    "author": "Deana A.",
    "rating": 5,
    "date": "2025-07-17T22:39:24.000Z",
    "title": null,
    "text": "Neighbor was such a great help to our family when we needed emergency storage fast!  We rented from Mr. Raghav who replied quickly and allowed us to rent his space.  No problems and he even allowed us..."
  },
  {
    "author": "Parke Blair",
    "rating": 5,
    "date": "2025-07-04T06:24:46.000Z",
    "title": null,
    "text": "I have several Cars, including an incredibly rare BMW Convertible that I needed a place to park in between moves/Homes while staying at AIRBNB's in between.\nIncredibly reasonable price, close proximi..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-05T23:23:08.000Z",
    "title": null,
    "text": "Neighbor offered options outside the standard mass storage facilities, and though hesitant at first, everything has gone smoothly and I was able to find a fantastic host in a good, safe and close-by l..."
  },
  {
    "author": "Red Dog",
    "rating": 5,
    "date": "2025-08-11T19:48:57.000Z",
    "title": null,
    "text": "We needed 2 53’ trailer spots immediately. Neighbor had the ideal location and at a very good price.  We were booked within minutes and the spaces were immediately available.  It’s hard to find places..."
  },
  {
    "author": "jen faux",
    "rating": 5,
    "date": "2025-06-13T21:26:22.000Z",
    "title": null,
    "text": "I had reached out to Bryce, last minute, and he was very accommodating. He also provided any and all pertinent information necessary to store our trailer. The lot itself is quite sizable with plenty o..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-10T19:47:40.000Z",
    "title": null,
    "text": "Jenna's spot was perfect for my temporary needs; easy access, decent price, and she kept an eye on things. I would recommend her for your outdoor vehicle storage needs. Thanks!"
  },
  {
    "author": "Matt Passios",
    "rating": 5,
    "date": "2025-09-21T23:37:31.000Z",
    "title": null,
    "text": "Good communication and great service. Just overall a really nice guy and will make sure whatever you keep parked there is safe."
  },
  {
    "author": "Allison Stokes",
    "rating": 5,
    "date": "2025-07-30T17:53:04.000Z",
    "title": null,
    "text": "Standard storage space for car while I was dealing with insurance post-accident. However, Jimmy was responsive and helpful when I needed to access the space and when I needed to have the car brought i..."
  },
  {
    "author": "Sofia",
    "rating": 5,
    "date": "2025-09-22T21:45:41.000Z",
    "title": null,
    "text": "This app worked well for me! I personally didn’t need to pay for the apps insurance is my only response, but other spots it may be a good call."
  },
  {
    "author": "Tiffany N",
    "rating": 5,
    "date": "2025-09-25T01:58:49.000Z",
    "title": null,
    "text": "Easy, quick communication from host, perfect spot to store my vehicle, well priced."
  },
  {
    "author": "DJ",
    "rating": 5,
    "date": "2025-08-15T22:49:07.000Z",
    "title": null,
    "text": "Easy transaction, good variety of places in the area that met all our needs. Seemless, stress-free long-term parking for our family vehicle."
  },
  {
    "author": "Holly",
    "rating": 5,
    "date": "2025-07-29T18:59:26.000Z",
    "title": null,
    "text": "Tisha has great rental spaces, we have had to move in and out a few times over the years and she is so nice and understanding when plans change. Always an easy move in, and move out experience"
  },
  {
    "author": "Matthew Plude",
    "rating": 5,
    "date": "2025-09-16T16:57:27.000Z",
    "title": null,
    "text": "Amazing host and beautiful property. Could not ask for a better place to store our RV. Highly recommend."
  },
  {
    "author": "Cyndi Gant",
    "rating": 4,
    "date": "2025-08-10T15:43:43.000Z",
    "title": null,
    "text": "Pretty easy to use. Messaging with potential renters is good. Only challenge I had was listing my garage. It seemed nothing met their criteria"
  },
  {
    "author": "Fatima Jones",
    "rating": 5,
    "date": "2025-08-18T13:51:29.000Z",
    "title": null,
    "text": "The space worked out for a while but then the town of where I rented from told host we would have to move our vehicle witch was fustrating"
  },
  {
    "author": "Scott Odenbrett",
    "rating": 5,
    "date": "2025-08-31T19:07:36.000Z",
    "title": null,
    "text": "I've used neighbor twice and have had great experiences both times.  It's easy to get started and when it's time to move on, it's easy to cancel."
  },
  {
    "author": "Mark Watson",
    "rating": 5,
    "date": "2025-09-04T01:27:26.000Z",
    "title": null,
    "text": "This is a great place to store a boat. It was easy access and I felt my boat was safe and secure while stored here. I stored my boat here for about 8 months and never had any issues and happily give a..."
  },
  {
    "author": "Clayton Lerch",
    "rating": 5,
    "date": "2025-09-17T19:06:55.000Z",
    "title": null,
    "text": "Great affordable rental space but i found a space a block from my house. I would recommend to anyone."
  },
  {
    "author": "Keith Stone",
    "rating": 5,
    "date": "2025-09-22T06:19:17.000Z",
    "title": null,
    "text": "Great host! Very flexible ! Awesome space, super easy  in and out! Security gate"
  },
  {
    "author": "Alex h",
    "rating": 5,
    "date": "2025-09-13T15:54:43.000Z",
    "title": null,
    "text": "Fantastic experience with Neighbor and my host. I would highly recommend and would use again in the future."
  },
  {
    "author": "Curt Wood",
    "rating": 5,
    "date": "2025-08-30T03:43:40.000Z",
    "title": null,
    "text": "Easy to access, plenty of room, clean space.  Worked out perfectly so I could store a vehicle while I needed the space in my personal garage."
  },
  {
    "author": "Michael C",
    "rating": 5,
    "date": "2025-09-26T02:41:58.000Z",
    "title": null,
    "text": "Great communication, and a nice out-of-view location with easy access.  I highly recommend Mark!"
  },
  {
    "author": "Matthew Spadoni",
    "rating": 5,
    "date": "2025-10-02T19:31:06.000Z",
    "title": null,
    "text": "Fernando was a great host. I will be back next spring when boat season resumes!"
  },
  {
    "author": "Ez",
    "rating": 5,
    "date": "2025-09-28T15:27:50.000Z",
    "title": null,
    "text": "This was much more affordable and convenient than traditional storage spaces. The host was extra communicative also."
  },
  {
    "author": "IllWill",
    "rating": 5,
    "date": "2025-10-01T14:59:44.000Z",
    "title": null,
    "text": "This helped me tremendously with my car that broke down"
  },
  {
    "author": "Tony Roberts",
    "rating": 5,
    "date": "2025-10-01T17:56:35.000Z",
    "title": null,
    "text": "Lots of space. Always accessible."
  },
  {
    "author": "Janeth Hernandez",
    "rating": 5,
    "date": "2025-09-23T14:29:47.000Z",
    "title": null,
    "text": "Jeff was great! Accommodated my needs at the last minute. Thank you Jeff!"
  },
  {
    "author": "Richard R.",
    "rating": 5,
    "date": "2025-10-01T00:53:21.000Z",
    "title": null,
    "text": "Good overall experience.  No issues. Huge and safe location."
  },
  {
    "author": "anthony",
    "rating": 5,
    "date": "2025-09-30T17:02:16.000Z",
    "title": null,
    "text": "Very responsive. Easy drop off"
  },
  {
    "author": "M Walker",
    "rating": 5,
    "date": "2025-09-26T19:01:43.000Z",
    "title": null,
    "text": "Trobi is a Great Host! Her property can host most Anything with Wheels."
  },
  {
    "author": "Jason & Stephanie Patterson",
    "rating": 5,
    "date": "2025-03-20T01:11:48.000Z",
    "title": null,
    "text": "Going on my third full year of being a host.  Had a couple of issues with renters and neighbor did as promised and rectified my issues each time.  April in the trust and safety department and Marcos t..."
  },
  {
    "author": "Becca Matta",
    "rating": 5,
    "date": "2025-05-05T22:48:25.000Z",
    "title": null,
    "text": "**Highly recommend renting this spot!** I used J's parking spot as long-term storage for my car while I traveled abroad for a few months and it was a really great experience! J was super responsive an..."
  },
  {
    "author": "Tiffany Phillips",
    "rating": 5,
    "date": "2025-04-13T12:15:24.000Z",
    "title": null,
    "text": "Kevin and Lee are phenomenal hosts. Their prompt responses helped make my mind up of which facility I chose. They are kind and professional and their facility has cameras and a swamp cooler which mad..."
  },
  {
    "author": "Ely Souza",
    "rating": 5,
    "date": "2025-08-08T10:23:10.000Z",
    "title": null,
    "text": "Great experience was able to find a place to park our trailer within just a few minutes saved us hundreds of dollars love this app"
  },
  {
    "author": "Subbu boy",
    "rating": 5,
    "date": "2025-07-26T18:42:08.000Z",
    "title": null,
    "text": "Great experience! The host was very responsive and made communication easy throughout the booking. The pickup and drop-off location was convenient and easy to find. Everything went smoothly—highly rec..."
  },
  {
    "author": "Will Mak",
    "rating": 5,
    "date": "2025-05-28T02:51:10.000Z",
    "title": null,
    "text": "⭐️⭐️⭐️⭐️⭐️ Outstanding Service – Highly Recommend!\n\nKimberly made the entire vehicle storage process incredibly smooth from start to finish. What could’ve been confusing and time-consuming turned ou..."
  },
  {
    "author": "Zachary Snavely",
    "rating": 1,
    "date": "2024-03-15T16:34:58.000Z",
    "title": "Vehicle Towed from Paid Neighbor Parking Space",
    "text": "Summary: Car was towed while using Neighbor. They won't reimburse. Story: Unfortunately, I would give Zero stars if that was possible. I had used Neighbor several times for long term vehicle storage, as it was less expensive than parking at the airport. I would pay Neighbor, park my car, and take an Uber for my flight, returning weeks later. After my most recent work trip I returned via Lyft to find my car gone. I tried contacting the \"host\" with no answer. I called Neighbor Customer Service, and the woman was very kind but unable to do another except try to reach out to the host. I then called the police who confirmed my car had been towed. I was able to pay my driver extra to sit with me for a few hours (in the night, in the rain, in a bad part of town), while I waited to have my car released from impound. The cost for release was $425, and I paid my Lyft driver an additional $50 for waiting with me for three hours. While Neighbor initially asked for receipts from the towing company, they now maintain that the storage of my vehicle is not their responsibility (even though I had paid them for this service). I have been going back and forth with them for three weeks since the incident. I have apparently spoken to the highest available person on the phone, who is the receptionist (very nice at least). She maintains that her manager, the person in charge, isn't able to speak to customers on the phone. They have assured me they have forwarded my feedback to the management team, but won't be offering a refund for my towing fees. At the bottom of the Neighbor website, there is text stating, \"Safety and Support: As long as you're with Neighbor, you're protected.\" What a joke."
  },
  {
    "author": "Arifuz Zaman",
    "rating": 1,
    "date": "2024-03-15T00:02:04.000Z",
    "title": "Horrible customer service!!",
    "text": "Horrible customer service!!! They want to blame you for everything, take your money, and then leave you high and dry. They refuse to help you. Stay away"
  },
  {
    "author": "Doug Plummer",
    "rating": 1,
    "date": "2024-02-09T06:20:42.000Z",
    "title": "Renter Beware",
    "text": "I was told I would be paying 180.00 per month for a garage. I'm actually paying 220.00 due to monthly'service fees' that were never mentioned while signing up. They make you pay through the app so you don't have a choice. 360.00 PER YEAR IN SERVICE FEES THAT YOU WEREN'T EVEN GIVEN A HEADS UP ABOUT. THATS HIGHWAY ROBBERY. IM NOW QUITTING NEIGHBOR (BUT ILL BE STAYING IN THE SAME PLACE IF YOU GET MY MEANING)"
  },
  {
    "author": "Fiona",
    "rating": 1,
    "date": "2023-12-27T00:40:14.000Z",
    "title": "I would avoid this company at all…",
    "text": "I would avoid this company at all costs. They're a scam and do not protect you and your items in anyway."
  },
  {
    "author": "SCAR ELUSIAN WEST",
    "rating": 1,
    "date": "2023-12-12T21:18:24.000Z",
    "title": "Absolutely disgusting",
    "text": "Absolutely disgusting. Horrible old men bullying and just Garbage 🗑UNINSTALLED THIS HORRIBLE APP. GONE."
  },
  {
    "author": "H W",
    "rating": 1,
    "date": "2023-11-15T20:54:36.000Z",
    "title": "Horrible app if your renting your…",
    "text": "Horrible app if your renting your space.   They take way to much money from both you and the renter.  They increase the amount they take without notice.    Its a scam don't use it to rent your storage area!!!!!   They are shady and don't disclose that they take alot of your rent money. Why is it that last year the fee was much less then the fee is right now.   With know notice/email anything.   Horrible app.  They Gauge You!    Use facebook Marketplace or Craigslist!!!!"
  },
  {
    "author": "Jupiter Jones",
    "rating": 1,
    "date": "2023-11-04T18:04:00.000Z",
    "title": "Got cheated by a rental owner, Neighbor.com does nothing",
    "text": "rented a space from a person on Neighbor.com, according to very specific rental dates. Rental owner cheated me, robbed, and will not refund the money. I contacted Neighbor.com, and they will do nothing. Thanks a lot, Neighbor.com.  Good job taking my money and standing up for your renters (sarcasm)"
  },
  {
    "author": "Larry Courtney",
    "rating": 1,
    "date": "2023-10-30T20:01:34.000Z",
    "title": "Do not use!",
    "text": "Do not use!! Beware!! I rented space for about 5 months. No longer needed the space. I told the host this. I was then charged twice. I contacted the host and they said they have no control over the money. In their policy it states that the host can cancel the reservation. I called Neighbor and they said they have a strict refund policy and that it was MY responsibility to cancel. Then they said the best they could do is a 70% refund. My monthly was $65 but they refunded $35. Obviously this is not 70%. They said they do not refund the fees. Neighbor is a terrible app and company."
  },
  {
    "author": "hansel llina",
    "rating": 1,
    "date": "2023-10-05T18:33:38.000Z",
    "title": "Customer service will harass owners",
    "text": "You will be sent a barrage of texts and emails and calls if you don’t respond to reservations immediately. This is even true if you already have a guest in the parking stall through neighbor. They will also take away payouts after reservation based on renters comments and reviews. Do not recommend."
  },
  {
    "author": "James Beecroft",
    "rating": 1,
    "date": "2023-07-18T03:05:33.000Z",
    "title": "Host Needs Mental Evaluation",
    "text": "a friend of mine and I were splitting the cost of keeping a car hauler at a woman's house in mapleton, utah.. Alyssa P or G. upon arrival today I had pulled up probably 2 minutes before she did to put a hoist lift on the trailer so we can use it. when the host Alyssa showed up got out of her car and started screaming at me for what I don't know but apparently she was having a bad day or something else was going on maybe mental issues long story short I started to try and reason with her it figured I was losing the battle she told me I was trespassing even though our trailer is on her property totally forgot who I was I even had to remove my glasses and hat to say you remember me I've talked to you three times since I've been here and we started renting in January so she seen me she knows who I am but she said she doesn't recall and that I need to send her a message through neighbor that I'm going to show up. to top things off she pulled out her phone and started recording me in the street as I was leaving saying I was harassing her and I basically just gave up and said you know you're the one walked all the way across your grass to put a phone up and say I was driving who's you know who's driving away I am so I highly highly highly recommend the neighbor possibly might ask for mental health records because this lady seriously cuckoo now she actually called the police they came out over nothing over her not taking her meds or whatever I don't know I don't know what her problem was but she trying to have me locked up for coming to work on our trailer. I implore neighbor to reevaluate this host Alyssa in mapleton Utah and warn anybody else that's in the area that she is dangerous and her kids play on all your stuff and drawing it with crayons and destroy things and she'll try and get you to pay on the side and at least she did us anyway I don't know about anybody else but stay away from her I hope neighbor looks into this and gets rid of her because she is some trash."
  },
  {
    "author": "D C",
    "rating": 1,
    "date": "2023-07-18T00:13:55.000Z",
    "title": "Don't do it! Don't even think about it!! Thieves",
    "text": "Don't do it. They're manipulative thieves. They baited and switched my rental unit. It was supposed to be double the size. I notices this as my rental truck was dropping off my storage items. I had to buy and additional storage unit on the fly and then do an extra delivery there. They are blaming the owner of the rental unit and he's blaming them for the miscalculation. Who knows? They gave me 1 month free equal to $137.90 which was nothing compared to the extra drop by the truck and the extra 4 months that I had to pay for the space that I didn't get with my Neighbor rental. Now get this too. My contract billing was paid for the last month on July 12th. I was out of there on July 15th. I learned today on July 17th that they credited me $56.45 when it should've been $124.55. They said that was their policy and they didn't have to refund at all. I can't wait for them to get what they deserve when their malicious practices catch up with them."
  },
  {
    "author": "James",
    "rating": 1,
    "date": "2023-07-11T20:22:18.000Z",
    "title": "The worst service I have ever used",
    "text": "Words cannot describe how terrible this service is. I rented space through Neighbor and the person renting the space moved into the storage unit. Neighbor assured me that they would help remove him from the space and cover all fees. After 60 days, they gave up and told me I had to take on legal costs to remove the renter and best of all, they cancelled the reservation 1 day before the payout and said they would not payout the scheduled rent any longer. Stay away from this company."
  },
  {
    "author": "Jon Keene",
    "rating": 1,
    "date": "2023-07-11T15:12:14.000Z",
    "title": "Zero for two w/ Neighbor Storage",
    "text": "I tried twice to store my RV while recently traveling around the country.  The first spot I reserved the \"host\" ghosted me the day prior to my arrival so I ended up having to make an alternate short term storage solution.  Neighbor agreed with me and provided 100% refund which was appreciated and expected. The 2nd reservation a few weeks later was for 3 months on the other side of the country and when I arrived to store my RV the storage space was full.  The \"host\" tried to get someone to move items around but proceeded to get stuck. So again I had to scramble to find another storage location.  In this case Neighbor provided me with only a 70% refund stating that 1- I did not cancel before I arrived (how would I know there was an issue before I got there??? and  2 - the host did not agree that I should receive a full refund ( like somehow this was partly my fault???)  After these experiences I would definitely not recommend Neighbor Storage for your storage needs.  Go to a reputable storage company that you can rely on even if you have to pay a little more. Note the response from Neighbor - if there is an issue with your storage and the host does not agree to a refund then you don't get one.  Kind of like the fox watching the hen house - remember that when making your reservations that you are at the mercy of the host......."
  },
  {
    "author": "Elizabeth",
    "rating": 1,
    "date": "2023-06-14T15:35:51.000Z",
    "title": "DANA KIEL scam",
    "text": "This woman (DANA KIEL) rented me her driveway and then harassed me asking for MORE money. \"If I do not receive payment in 20 minutes the police officer that’s here will have the bus towed immediately.\" \"Venmo me the $500 @Dana-Kiel-3\""
  },
  {
    "author": "Al in Denver",
    "rating": 1,
    "date": "2023-05-18T01:53:15.000Z",
    "title": "Thieves",
    "text": "I used Neighbor.com to find inside storage for a vehicle over the winter.  I moved out of the unit in March and Neighbor continued to charge my debit card the $135/month for three months before I noticed today.  I reached out to neighbor.com and they would only refund $252 of the $405 that they stole from me.  Absolute larceny.  This company and the people that rent through them are thieves.  Stay away"
  },
  {
    "author": "Jimmie Holman",
    "rating": 1,
    "date": "2023-05-14T21:15:57.000Z",
    "title": "Many attempt at un a unscrewing have…",
    "text": "Many attempt at un a unsubscribing have been ignored... will be blocking"
  },
  {
    "author": "Douglas Okamoto",
    "rating": 1,
    "date": "2023-04-27T19:17:09.000Z",
    "title": "Creepy Overreach",
    "text": "I listed on neighbor.com for over a year and had good renters and flaky ones as well; overall experience is no better than using Craigslist for free.  Forget about neighbor.com’s claim that they provide “protections”.  The major problem with neighbor.com is that they try to limit communication between you and the prospective renter by blocking phone numbers and blanking certain text in the messages that you send through their platform.  I get that they want owners to collect payment through the neighbor.com app, but they stifle business by choking communication between owners and potential renters to arrange for viewings and to negotiate rental amounts. Recently, I got creepy passive aggressive messages from neighbor.com asserting that I was going around the app, when I was doing no such thing.  After a few of these incidences, neighbor.com completely lost my trust and I am much happier with my alternatives.  Neighbor.com needs to let go of their insecurities and build trust in users if they want to do well as a company.  If the company has an inviting platform, people will use it.  For now, use Craigslist for free."
  },
  {
    "author": "Thomas Barnes",
    "rating": 1,
    "date": "2023-04-26T19:43:25.000Z",
    "title": "Provide a signed lease agreement for…",
    "text": "Provide a signed lease agreement for the \"spot\""
  },
  {
    "author": "Nate M",
    "rating": 1,
    "date": "2023-04-21T01:05:18.000Z",
    "title": "Despicable and unethical",
    "text": "The app has scammers on it. My vehicle was towed from the parking spot that I reserved through Neighbor. I'm now 6+ weeks without my vehicle. I have a $7,000 tow bill and the loan company is threatening to reposes the vehicle. Neighbor has taken zero responsibility and managing this whole stressful ordeal has turned into a part-time job. I'm playing musical chairs between Neighbor, the host, the tow company, the cops and the loan company. Most importantly, I repeat: Neighbor has taken zero responsibility. I would highly suggest to run from this company and never risk using them. The money you think you're saving can very likely backfire."
  },
  {
    "author": "Karen Caloca",
    "rating": 1,
    "date": "2023-04-17T22:34:39.000Z",
    "title": "Neighbor keeps your money",
    "text": "I used neighbor to rent property I own. When a renter moved out, neighbor went again their written policy and actually kept $400 of my money. I have sent emails, made phone calls and they say, “we are sorry we made a mistake” but don’t put their money where their mouth is. Don’t recommend"
  },
  {
    "author": "David Blake",
    "rating": 5,
    "date": "2025-10-03T01:29:27.000Z",
    "title": null,
    "text": "My classic '74 MGB roadster was kept dry and in fine shape for nearly two years during my house remodel.  When I drove it home, it started right up and Shalbindra filled the tires to the proper pressu..."
  },
  {
    "author": "Charles Christiansen",
    "rating": 5,
    "date": "2025-09-23T21:16:57.000Z",
    "title": null,
    "text": "Ease of use of the app, money saving over traditional storage facilities. Have used this app for two different reservations over the last couple years and have found everything to be above board would..."
  },
  {
    "author": "CHARLES H",
    "rating": 4,
    "date": "2025-09-17T07:45:13.000Z",
    "title": null,
    "text": "Finding a parking spot for our RV was easy with Neighbor. Martin helped locate the location and helped me with the process. Jason, the host, was easy to work with and easy to communicate with as well...."
  },
  {
    "author": "Fabio",
    "rating": 5,
    "date": "2025-08-11T18:52:33.000Z",
    "title": null,
    "text": "I needed a long term parking spot and aside from having multiple options right off the bat all within 2 miles of my house, I got put in contact with the host within hours and I had secure the spot by..."
  },
  {
    "author": "Janet Desmarais",
    "rating": 5,
    "date": "2025-10-03T21:57:36.000Z",
    "title": null,
    "text": "Best safe space ever. Extended stay. Lighted gated area. Great communication. Would highly recommend."
  },
  {
    "author": "Paul",
    "rating": 5,
    "date": "2025-08-24T00:03:38.000Z",
    "title": null,
    "text": "Great experience, highly secure note on site security with multiple gated locks.  Location is in the mangroves so buggy at times bed price around. I will use this facility again next year."
  },
  {
    "author": "Elise",
    "rating": 5,
    "date": "2025-10-02T20:30:12.000Z",
    "title": null,
    "text": "The space is very private behind a fence. It is easy to access, and the host is quick to respond when coordinating drop off and pick up."
  },
  {
    "author": "William Wallace",
    "rating": 3,
    "date": "2025-09-18T01:19:02.000Z",
    "title": null,
    "text": "For the most part its been good, once its up and running it takes very little maintenance.  However some new options have led to issues, for example rhe automatic approval feature. Renter had a 40 foo..."
  },
  {
    "author": "Tommy Shields",
    "rating": 5,
    "date": "2025-07-17T21:56:54.000Z",
    "title": null,
    "text": "The place is setup rather well. Easy to pull in and maneuver your camper into its assigned parking spot. Location is very convenient from 275. The owner was on top of setting me up with access and liv..."
  },
  {
    "author": "DD",
    "rating": 4,
    "date": "2024-11-04T21:08:00.000Z",
    "title": null,
    "text": "Neighbor was GREAT income, I'm going to begin using it again soon! THE customer services really protected me when a fraudulent client wanted to get $ out of me to pay for towing fees for a vehicle t..."
  },
  {
    "author": "Irene Glazer",
    "rating": 3,
    "date": "2025-09-15T06:40:09.000Z",
    "title": null,
    "text": "Would be much better if you prorated the service as I ended up spending more than I needed to because I didn’t need the whole rest of the month."
  },
  {
    "author": "Diane B",
    "rating": 5,
    "date": "2025-06-02T04:10:18.000Z",
    "title": null,
    "text": "Neighbor was an excellent company to deal with. They were very professional, honest, and trustworthy! There were no hidden fees, the host I eventually chose is amazing. Both the company, and the host,..."
  },
  {
    "author": "Mari",
    "rating": 5,
    "date": "2024-11-04T23:17:15.000Z",
    "title": null,
    "text": "The renter I have now is GREAT. Very nice guy. Very respectful. I would definitely recommend the app. Just make sure you do not give out your number. Better to keep any convo in the app because honest..."
  },
  {
    "author": "Deana A.",
    "rating": 5,
    "date": "2025-07-17T22:39:24.000Z",
    "title": null,
    "text": "Neighbor was such a great help to our family when we needed emergency storage fast!  We rented from Mr. Raghav who replied quickly and allowed us to rent his space.  No problems and he even allowed us..."
  },
  {
    "author": "Parke Blair",
    "rating": 5,
    "date": "2025-07-04T06:24:46.000Z",
    "title": null,
    "text": "I have several Cars, including an incredibly rare BMW Convertible that I needed a place to park in between moves/Homes while staying at AIRBNB's in between.\nIncredibly reasonable price, close proximi..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-05T23:23:08.000Z",
    "title": null,
    "text": "Neighbor offered options outside the standard mass storage facilities, and though hesitant at first, everything has gone smoothly and I was able to find a fantastic host in a good, safe and close-by l..."
  },
  {
    "author": "Red Dog",
    "rating": 5,
    "date": "2025-08-11T19:48:57.000Z",
    "title": null,
    "text": "We needed 2 53’ trailer spots immediately. Neighbor had the ideal location and at a very good price.  We were booked within minutes and the spaces were immediately available.  It’s hard to find places..."
  },
  {
    "author": "jen faux",
    "rating": 5,
    "date": "2025-06-13T21:26:22.000Z",
    "title": null,
    "text": "I had reached out to Bryce, last minute, and he was very accommodating. He also provided any and all pertinent information necessary to store our trailer. The lot itself is quite sizable with plenty o..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-10T19:47:40.000Z",
    "title": null,
    "text": "Jenna's spot was perfect for my temporary needs; easy access, decent price, and she kept an eye on things. I would recommend her for your outdoor vehicle storage needs. Thanks!"
  },
  {
    "author": "Matt Passios",
    "rating": 5,
    "date": "2025-09-21T23:37:31.000Z",
    "title": null,
    "text": "Good communication and great service. Just overall a really nice guy and will make sure whatever you keep parked there is safe."
  },
  {
    "author": "Allison Stokes",
    "rating": 5,
    "date": "2025-07-30T17:53:04.000Z",
    "title": null,
    "text": "Standard storage space for car while I was dealing with insurance post-accident. However, Jimmy was responsive and helpful when I needed to access the space and when I needed to have the car brought i..."
  },
  {
    "author": "Sofia",
    "rating": 5,
    "date": "2025-09-22T21:45:41.000Z",
    "title": null,
    "text": "This app worked well for me! I personally didn’t need to pay for the apps insurance is my only response, but other spots it may be a good call."
  },
  {
    "author": "Tiffany N",
    "rating": 5,
    "date": "2025-09-25T01:58:49.000Z",
    "title": null,
    "text": "Easy, quick communication from host, perfect spot to store my vehicle, well priced."
  },
  {
    "author": "DJ",
    "rating": 5,
    "date": "2025-08-15T22:49:07.000Z",
    "title": null,
    "text": "Easy transaction, good variety of places in the area that met all our needs. Seemless, stress-free long-term parking for our family vehicle."
  },
  {
    "author": "Holly",
    "rating": 5,
    "date": "2025-07-29T18:59:26.000Z",
    "title": null,
    "text": "Tisha has great rental spaces, we have had to move in and out a few times over the years and she is so nice and understanding when plans change. Always an easy move in, and move out experience"
  },
  {
    "author": "Matthew Plude",
    "rating": 5,
    "date": "2025-09-16T16:57:27.000Z",
    "title": null,
    "text": "Amazing host and beautiful property. Could not ask for a better place to store our RV. Highly recommend."
  },
  {
    "author": "Cyndi Gant",
    "rating": 4,
    "date": "2025-08-10T15:43:43.000Z",
    "title": null,
    "text": "Pretty easy to use. Messaging with potential renters is good. Only challenge I had was listing my garage. It seemed nothing met their criteria"
  },
  {
    "author": "Fatima Jones",
    "rating": 5,
    "date": "2025-08-18T13:51:29.000Z",
    "title": null,
    "text": "The space worked out for a while but then the town of where I rented from told host we would have to move our vehicle witch was fustrating"
  },
  {
    "author": "Scott Odenbrett",
    "rating": 5,
    "date": "2025-08-31T19:07:36.000Z",
    "title": null,
    "text": "I've used neighbor twice and have had great experiences both times.  It's easy to get started and when it's time to move on, it's easy to cancel."
  },
  {
    "author": "Mark Watson",
    "rating": 5,
    "date": "2025-09-04T01:27:26.000Z",
    "title": null,
    "text": "This is a great place to store a boat. It was easy access and I felt my boat was safe and secure while stored here. I stored my boat here for about 8 months and never had any issues and happily give a..."
  },
  {
    "author": "Clayton Lerch",
    "rating": 5,
    "date": "2025-09-17T19:06:55.000Z",
    "title": null,
    "text": "Great affordable rental space but i found a space a block from my house. I would recommend to anyone."
  },
  {
    "author": "Keith Stone",
    "rating": 5,
    "date": "2025-09-22T06:19:17.000Z",
    "title": null,
    "text": "Great host! Very flexible ! Awesome space, super easy  in and out! Security gate"
  },
  {
    "author": "Alex h",
    "rating": 5,
    "date": "2025-09-13T15:54:43.000Z",
    "title": null,
    "text": "Fantastic experience with Neighbor and my host. I would highly recommend and would use again in the future."
  },
  {
    "author": "Curt Wood",
    "rating": 5,
    "date": "2025-08-30T03:43:40.000Z",
    "title": null,
    "text": "Easy to access, plenty of room, clean space.  Worked out perfectly so I could store a vehicle while I needed the space in my personal garage."
  },
  {
    "author": "Michael C",
    "rating": 5,
    "date": "2025-09-26T02:41:58.000Z",
    "title": null,
    "text": "Great communication, and a nice out-of-view location with easy access.  I highly recommend Mark!"
  },
  {
    "author": "Matthew Spadoni",
    "rating": 5,
    "date": "2025-10-02T19:31:06.000Z",
    "title": null,
    "text": "Fernando was a great host. I will be back next spring when boat season resumes!"
  },
  {
    "author": "Ez",
    "rating": 5,
    "date": "2025-09-28T15:27:50.000Z",
    "title": null,
    "text": "This was much more affordable and convenient than traditional storage spaces. The host was extra communicative also."
  },
  {
    "author": "IllWill",
    "rating": 5,
    "date": "2025-10-01T14:59:44.000Z",
    "title": null,
    "text": "This helped me tremendously with my car that broke down"
  },
  {
    "author": "Tony Roberts",
    "rating": 5,
    "date": "2025-10-01T17:56:35.000Z",
    "title": null,
    "text": "Lots of space. Always accessible."
  },
  {
    "author": "Janeth Hernandez",
    "rating": 5,
    "date": "2025-09-23T14:29:47.000Z",
    "title": null,
    "text": "Jeff was great! Accommodated my needs at the last minute. Thank you Jeff!"
  },
  {
    "author": "Richard R.",
    "rating": 5,
    "date": "2025-10-01T00:53:21.000Z",
    "title": null,
    "text": "Good overall experience.  No issues. Huge and safe location."
  },
  {
    "author": "anthony",
    "rating": 5,
    "date": "2025-09-30T17:02:16.000Z",
    "title": null,
    "text": "Very responsive. Easy drop off"
  },
  {
    "author": "M Walker",
    "rating": 5,
    "date": "2025-09-26T19:01:43.000Z",
    "title": null,
    "text": "Trobi is a Great Host! Her property can host most Anything with Wheels."
  },
  {
    "author": "Jason & Stephanie Patterson",
    "rating": 5,
    "date": "2025-03-20T01:11:48.000Z",
    "title": null,
    "text": "Going on my third full year of being a host.  Had a couple of issues with renters and neighbor did as promised and rectified my issues each time.  April in the trust and safety department and Marcos t..."
  },
  {
    "author": "Becca Matta",
    "rating": 5,
    "date": "2025-05-05T22:48:25.000Z",
    "title": null,
    "text": "**Highly recommend renting this spot!** I used J's parking spot as long-term storage for my car while I traveled abroad for a few months and it was a really great experience! J was super responsive an..."
  },
  {
    "author": "Tiffany Phillips",
    "rating": 5,
    "date": "2025-04-13T12:15:24.000Z",
    "title": null,
    "text": "Kevin and Lee are phenomenal hosts. Their prompt responses helped make my mind up of which facility I chose. They are kind and professional and their facility has cameras and a swamp cooler which mad..."
  },
  {
    "author": "Ely Souza",
    "rating": 5,
    "date": "2025-08-08T10:23:10.000Z",
    "title": null,
    "text": "Great experience was able to find a place to park our trailer within just a few minutes saved us hundreds of dollars love this app"
  },
  {
    "author": "Subbu boy",
    "rating": 5,
    "date": "2025-07-26T18:42:08.000Z",
    "title": null,
    "text": "Great experience! The host was very responsive and made communication easy throughout the booking. The pickup and drop-off location was convenient and easy to find. Everything went smoothly—highly rec..."
  },
  {
    "author": "Will Mak",
    "rating": 5,
    "date": "2025-05-28T02:51:10.000Z",
    "title": null,
    "text": "⭐️⭐️⭐️⭐️⭐️ Outstanding Service – Highly Recommend!\n\nKimberly made the entire vehicle storage process incredibly smooth from start to finish. What could’ve been confusing and time-consuming turned ou..."
  },
  {
    "author": "Lea C",
    "rating": 1,
    "date": "2023-04-14T18:13:09.000Z",
    "title": "HOST notified when/why, moved out cancelled charge for 5 months after",
    "text": "Your APP makes it hard to cancel.  Fix your app. We did not create a report for tire damage.  True. Our response and decision was to MOVE OUT. Host was notified when and WHY. Our decision not to pursue compensation for vandalism while at your site is very independent of our canceling your service.  They are not the same.  What customer wants their vehicle damaged while paying for parking? Then, what customer intends to continuing paying for parking they are not using for an extra 5 months AFTER NOTICE of vandalism?  Do what is right. We did not make you responsible for the damage to the tires. Decision was to move to a more secure parking location.  This decision is not equal a wish to continue paying for service we are not using for an extra 5 months.  Two different actions. We did not formally report on your process. We decided to move the car instead.  Host was notified. Did try to cancel your app did not cooperate.  Fix your app. Refund 5 months of non-service.  Do what is right. Do not confuse the two issues. This is not a location where there are hundreds of cars.  Our was a LIMO and your HOST was very well aware WE MOVED!! Only limo on the lot. Cannot be confused. Do what is right. Stop giving excuses.  Do what is right for a customer."
  },
  {
    "author": "Donetta",
    "rating": 1,
    "date": "2023-04-10T23:44:17.000Z",
    "title": "Paid for car storage",
    "text": "Paid for car storage. While in storage the vehicle was wrecked by accident. Reached out to Neighbor who said they will not pay for anything but $500 because I only paid for that plan"
  },
  {
    "author": "Gary",
    "rating": 1,
    "date": "2023-03-06T21:04:44.000Z",
    "title": "BEWARE hidden fees",
    "text": "Whilst the idea is great, the pricing is very underhand. there re 10-15% hidden fees added on the last page of the checkout. I was told 'airbnb do it' on the call to their support team (which they no longer do after scrapping this in Nov 2022) its a shame as it could be a great service, just don't deceive your (potential) customers"
  },
  {
    "author": "Douglas Gregory",
    "rating": 1,
    "date": "2023-03-04T12:44:29.000Z",
    "title": "I used the service for a temporary…",
    "text": "I used the service for a temporary storage while visiting family. Agreed on price and terms and repeat use. Was stalked by the neighbor and left early for fear of harm."
  },
  {
    "author": "Douglas Gregory",
    "rating": 1,
    "date": "2023-03-06T18:49:03.000Z",
    "title": "Used this service in Edmond Ok",
    "text": "Used this service in Edmond Ok, neighbor playing Karen let me feeling unsafe $170 for 2.5 days.  MAJOR RIP-OFF"
  },
  {
    "author": "Mark Raymond",
    "rating": 1,
    "date": "2023-02-28T23:27:29.000Z",
    "title": "Website is a joke.will not let you sign…",
    "text": "Website is a joke.will not let you sign in rejects good credit cards and no body answers phone"
  },
  {
    "author": "Hector Madrigal",
    "rating": 1,
    "date": "2023-02-18T16:56:13.000Z",
    "title": "Very dissapointed and fruatated from…",
    "text": "Very dissapointed and fruatated from using this neighbor service, totally regre it. End up paying a full month for one day of parking space. Cancellation policy very unfare for costumers. Pleaae be careful using this service.or dont use it at all."
  },
  {
    "author": "Rick Sharpe",
    "rating": 1,
    "date": "2023-02-12T10:03:26.000Z",
    "title": "WOLVES IN SHEEP'S CLOTHING",
    "text": "This is a horrible sheep's clothing scam operation. I'm looking for a space to keep my beautiful new luxury work vehicle in San Diego. This site gives you misleading scam map reference and tells you it won't give you location until after you pay. So you pay and they zoom in on the location, and it's 13 miles from my home. They totally bait and switched me on location for my money. I like the proximity to freeways so I say I'll give it a shot anyway. I send a polite email to the host CHRISTIAN, and he ignores me completely. Then 24vhours go by and they cancel me and tell me it could take up to a week to get my money back? HORRIBLE SCAM SITE. BUYER BEWARE! F-"
  },
  {
    "author": "Julie May",
    "rating": 1,
    "date": "2023-01-23T03:00:00.000Z",
    "title": "HORRIBLE!",
    "text": "HORRIBLE!! I rented and paid for a spot. After renting uHaul truck brought my stuff across town and when I got there it was half the size it claimed me and it was full of stuff.. well they reimburse me for a quart for storage that didn’t exist that I paid for. I had to pay and I keep my stuff in the truck and pay for that until I guess I’m not short isn’t it costing me hundreds of dollars."
  },
  {
    "author": "Andra Schinteie",
    "rating": 1,
    "date": "2023-01-13T20:36:58.000Z",
    "title": "Scam! Stay away",
    "text": "Scam! They take your money then the \"owner\" doesn't answer the phone, text only, he doesn't reply to your texts after you already paid for 6-7 hours, after I canceled the reservation the same day, Neighbor costumer service took my money anyways, responded to my emails after more than 1 month and refused to refund my money even if I didn't use their space not even for 1 second. Disrespectful, rude, thieves! Stay away, it's all a huge scam"
  },
  {
    "author": "Mark S",
    "rating": 1,
    "date": "2023-01-03T19:47:32.000Z",
    "title": "Neighbor won’t refund money",
    "text": "Neighbor asked for my credit card and eventually charged me for a space I never used. Overall the charges ran for four months when I discovered it on my bank statement. I called them on the phone and they only gave me the last month back and refused to refund the other three months even though I never rented the space. It’s basically pretty much of a scam although they do provide product if you are able to navigate through some of the confusion. By not refunding the money, both Neighbor and the guy that had the space profit off of what they say was my mistake. I never got the use of the space on even know where it is."
  },
  {
    "author": "Andrea Sturm",
    "rating": 1,
    "date": "2022-12-13T06:27:07.000Z",
    "title": "Censored",
    "text": "Censored Violation of our rights of freedom of y"
  },
  {
    "author": "Brett",
    "rating": 1,
    "date": "2022-12-10T04:13:42.000Z",
    "title": "Neighbor takes the side of schizo customers over well-meaning hosts.",
    "text": "Well, these guys went from 5 to 1 star real quick. Do NOT host with this app. You will get schizos coming to your apartment, loiter outside my apartment for like 8 hours, overstuffing my room with ridiculous amount of stuff. He suddenly got violent and cursing dropping f-bombs over the app and I told Neighbor immediately, they saw how crazy he was and suggested police. In the end managed to kick him out but app still let's him rate me 1 star, saying \"oh freedom of speech\". WTH? The absolute least Neighbor could do at this point is delete the 1-star review, and they fail to do that. Stay away unless you enjoy getting spit in the face"
  },
  {
    "author": "Andrea",
    "rating": 1,
    "date": "2022-12-13T18:36:29.000Z",
    "title": "Predatory company running a scam",
    "text": "They say that you have 7 days before they charge a late fee. I was told they try to charge your card every 48 hours. That is a lie. I have notifications from my bank that they tried EVERY day but the last day before the late fee would be added. That is the only time they waited 48 hours so they could then charge a late fee. The money was in my account on the last day they should have attempted before the late fee. This is the 2nd time they've done this. They are ripping people off and taking advantage of them. They know people will pay the late fee because they don't want to lose their belongings. Find a better option and avoid this predatory company and their scam. In response to their reply, they are blatantly lying. I was not referring to last month. I was referring to DECEMBER 2022. Last momth you took the payment and the late fee payment. I had no problem with November because my payment was late. However, I have proof that you took the whole amount and there was no courtesy refund of a late fee. You might be trying to cover NOW with a courtesy refund because my bank says I'm only being charged with the original amount. This was only AFTER I did what I said I would by letting people know what kind of company you really are. You need to stop lying in your replies and trying to twist facts."
  },
  {
    "author": "P Roppo",
    "rating": 1,
    "date": "2022-12-09T19:46:05.000Z",
    "title": "Neighbor.com is out of their mind if…",
    "text": "Neighbor.com is out of their mind if they want to collect everybody's biometrics - after uploading your ID - for a parking spot. I can rent houses with less personal information. Not happening."
  },
  {
    "author": "Jeff",
    "rating": 1,
    "date": "2022-12-02T19:12:26.000Z",
    "title": "Scam",
    "text": "Scam,  you can see till you pay. Then nothing is confirmed in time. I was charged full price after seeing site and it was not suitable after they offered hall price to get me there."
  },
  {
    "author": "CRYSTAL QUEST",
    "rating": 1,
    "date": "2022-11-17T23:04:48.000Z",
    "title": "Scam",
    "text": "To leave a review you have to select a star. This app is a SCAM the renters and the agents. Rose(neighbor agent) Eric (renter) Baytown,Tx area he claims to have 2 driveways this isn’t even his property. They take your money for approval then scam you! Please be aware! I have filed a police report and contacted Fox 26 News Houston,Tx"
  },
  {
    "author": "Sylvia Brallier",
    "rating": 1,
    "date": "2022-11-17T06:20:17.000Z",
    "title": "This is a disaster waiting to happen",
    "text": "This is a disaster waiting to happen! Renting from unbonded people leads to problems. And whatever you do make sure you sign out not only with the customer you’re renting from but with the company. The person knew I moved out but continue to take my money for three more months! The company Stretched and gave me one month back because I was being aggressively in their face. This is just wrong. Don’t risk your money. Go with a bonded situation not renting with pedestrians who can just take your money. They basically told me they couldn’t pay me back because how would there renter feel about that? Please Felicia."
  },
  {
    "author": "Paul",
    "rating": 1,
    "date": "2022-11-11T01:04:47.000Z",
    "title": "Please Help Me! Contact Joseph Woodbury and Chad Iverson",
    "text": "Hi, I have had one \"guest\" who wrenched my garage door open to get his items. When I politely asked him to pay the $200.00 to repair the door he took his items and left under police escort so that he did not have to pay. Next, I am communicating with your CFO Chad Iverson and CEO Joseph Woodbury. Further, I was removed from the platform by one agents (\"June\")  for asking for damages. I would like to be put back on the platform (reinstituted) and for June to be interviewed, please. My name is Paul Neuhausen, M: 818-324-6815"
  },
  {
    "author": "Yatish N",
    "rating": 1,
    "date": "2022-11-07T17:59:29.000Z",
    "title": "There is only one way to get paid out…",
    "text": "There is only one way to get paid out which is ridiculous"
  },
  {
    "author": "David Blake",
    "rating": 5,
    "date": "2025-10-03T01:29:27.000Z",
    "title": null,
    "text": "My classic '74 MGB roadster was kept dry and in fine shape for nearly two years during my house remodel.  When I drove it home, it started right up and Shalbindra filled the tires to the proper pressu..."
  },
  {
    "author": "Charles Christiansen",
    "rating": 5,
    "date": "2025-09-23T21:16:57.000Z",
    "title": null,
    "text": "Ease of use of the app, money saving over traditional storage facilities. Have used this app for two different reservations over the last couple years and have found everything to be above board would..."
  },
  {
    "author": "CHARLES H",
    "rating": 4,
    "date": "2025-09-17T07:45:13.000Z",
    "title": null,
    "text": "Finding a parking spot for our RV was easy with Neighbor. Martin helped locate the location and helped me with the process. Jason, the host, was easy to work with and easy to communicate with as well...."
  },
  {
    "author": "Fabio",
    "rating": 5,
    "date": "2025-08-11T18:52:33.000Z",
    "title": null,
    "text": "I needed a long term parking spot and aside from having multiple options right off the bat all within 2 miles of my house, I got put in contact with the host within hours and I had secure the spot by..."
  },
  {
    "author": "Janet Desmarais",
    "rating": 5,
    "date": "2025-10-03T21:57:36.000Z",
    "title": null,
    "text": "Best safe space ever. Extended stay. Lighted gated area. Great communication. Would highly recommend."
  },
  {
    "author": "Paul",
    "rating": 5,
    "date": "2025-08-24T00:03:38.000Z",
    "title": null,
    "text": "Great experience, highly secure note on site security with multiple gated locks.  Location is in the mangroves so buggy at times bed price around. I will use this facility again next year."
  },
  {
    "author": "Elise",
    "rating": 5,
    "date": "2025-10-02T20:30:12.000Z",
    "title": null,
    "text": "The space is very private behind a fence. It is easy to access, and the host is quick to respond when coordinating drop off and pick up."
  },
  {
    "author": "William Wallace",
    "rating": 3,
    "date": "2025-09-18T01:19:02.000Z",
    "title": null,
    "text": "For the most part its been good, once its up and running it takes very little maintenance.  However some new options have led to issues, for example rhe automatic approval feature. Renter had a 40 foo..."
  },
  {
    "author": "Tommy Shields",
    "rating": 5,
    "date": "2025-07-17T21:56:54.000Z",
    "title": null,
    "text": "The place is setup rather well. Easy to pull in and maneuver your camper into its assigned parking spot. Location is very convenient from 275. The owner was on top of setting me up with access and liv..."
  },
  {
    "author": "DD",
    "rating": 4,
    "date": "2024-11-04T21:08:00.000Z",
    "title": null,
    "text": "Neighbor was GREAT income, I'm going to begin using it again soon! THE customer services really protected me when a fraudulent client wanted to get $ out of me to pay for towing fees for a vehicle t..."
  },
  {
    "author": "Irene Glazer",
    "rating": 3,
    "date": "2025-09-15T06:40:09.000Z",
    "title": null,
    "text": "Would be much better if you prorated the service as I ended up spending more than I needed to because I didn’t need the whole rest of the month."
  },
  {
    "author": "Diane B",
    "rating": 5,
    "date": "2025-06-02T04:10:18.000Z",
    "title": null,
    "text": "Neighbor was an excellent company to deal with. They were very professional, honest, and trustworthy! There were no hidden fees, the host I eventually chose is amazing. Both the company, and the host,..."
  },
  {
    "author": "Mari",
    "rating": 5,
    "date": "2024-11-04T23:17:15.000Z",
    "title": null,
    "text": "The renter I have now is GREAT. Very nice guy. Very respectful. I would definitely recommend the app. Just make sure you do not give out your number. Better to keep any convo in the app because honest..."
  },
  {
    "author": "Deana A.",
    "rating": 5,
    "date": "2025-07-17T22:39:24.000Z",
    "title": null,
    "text": "Neighbor was such a great help to our family when we needed emergency storage fast!  We rented from Mr. Raghav who replied quickly and allowed us to rent his space.  No problems and he even allowed us..."
  },
  {
    "author": "Parke Blair",
    "rating": 5,
    "date": "2025-07-04T06:24:46.000Z",
    "title": null,
    "text": "I have several Cars, including an incredibly rare BMW Convertible that I needed a place to park in between moves/Homes while staying at AIRBNB's in between.\nIncredibly reasonable price, close proximi..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-05T23:23:08.000Z",
    "title": null,
    "text": "Neighbor offered options outside the standard mass storage facilities, and though hesitant at first, everything has gone smoothly and I was able to find a fantastic host in a good, safe and close-by l..."
  },
  {
    "author": "Red Dog",
    "rating": 5,
    "date": "2025-08-11T19:48:57.000Z",
    "title": null,
    "text": "We needed 2 53’ trailer spots immediately. Neighbor had the ideal location and at a very good price.  We were booked within minutes and the spaces were immediately available.  It’s hard to find places..."
  },
  {
    "author": "jen faux",
    "rating": 5,
    "date": "2025-06-13T21:26:22.000Z",
    "title": null,
    "text": "I had reached out to Bryce, last minute, and he was very accommodating. He also provided any and all pertinent information necessary to store our trailer. The lot itself is quite sizable with plenty o..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-10T19:47:40.000Z",
    "title": null,
    "text": "Jenna's spot was perfect for my temporary needs; easy access, decent price, and she kept an eye on things. I would recommend her for your outdoor vehicle storage needs. Thanks!"
  },
  {
    "author": "Matt Passios",
    "rating": 5,
    "date": "2025-09-21T23:37:31.000Z",
    "title": null,
    "text": "Good communication and great service. Just overall a really nice guy and will make sure whatever you keep parked there is safe."
  },
  {
    "author": "Allison Stokes",
    "rating": 5,
    "date": "2025-07-30T17:53:04.000Z",
    "title": null,
    "text": "Standard storage space for car while I was dealing with insurance post-accident. However, Jimmy was responsive and helpful when I needed to access the space and when I needed to have the car brought i..."
  },
  {
    "author": "Sofia",
    "rating": 5,
    "date": "2025-09-22T21:45:41.000Z",
    "title": null,
    "text": "This app worked well for me! I personally didn’t need to pay for the apps insurance is my only response, but other spots it may be a good call."
  },
  {
    "author": "Tiffany N",
    "rating": 5,
    "date": "2025-09-25T01:58:49.000Z",
    "title": null,
    "text": "Easy, quick communication from host, perfect spot to store my vehicle, well priced."
  },
  {
    "author": "DJ",
    "rating": 5,
    "date": "2025-08-15T22:49:07.000Z",
    "title": null,
    "text": "Easy transaction, good variety of places in the area that met all our needs. Seemless, stress-free long-term parking for our family vehicle."
  },
  {
    "author": "Holly",
    "rating": 5,
    "date": "2025-07-29T18:59:26.000Z",
    "title": null,
    "text": "Tisha has great rental spaces, we have had to move in and out a few times over the years and she is so nice and understanding when plans change. Always an easy move in, and move out experience"
  },
  {
    "author": "Matthew Plude",
    "rating": 5,
    "date": "2025-09-16T16:57:27.000Z",
    "title": null,
    "text": "Amazing host and beautiful property. Could not ask for a better place to store our RV. Highly recommend."
  },
  {
    "author": "Cyndi Gant",
    "rating": 4,
    "date": "2025-08-10T15:43:43.000Z",
    "title": null,
    "text": "Pretty easy to use. Messaging with potential renters is good. Only challenge I had was listing my garage. It seemed nothing met their criteria"
  },
  {
    "author": "Fatima Jones",
    "rating": 5,
    "date": "2025-08-18T13:51:29.000Z",
    "title": null,
    "text": "The space worked out for a while but then the town of where I rented from told host we would have to move our vehicle witch was fustrating"
  },
  {
    "author": "Scott Odenbrett",
    "rating": 5,
    "date": "2025-08-31T19:07:36.000Z",
    "title": null,
    "text": "I've used neighbor twice and have had great experiences both times.  It's easy to get started and when it's time to move on, it's easy to cancel."
  },
  {
    "author": "Mark Watson",
    "rating": 5,
    "date": "2025-09-04T01:27:26.000Z",
    "title": null,
    "text": "This is a great place to store a boat. It was easy access and I felt my boat was safe and secure while stored here. I stored my boat here for about 8 months and never had any issues and happily give a..."
  },
  {
    "author": "Clayton Lerch",
    "rating": 5,
    "date": "2025-09-17T19:06:55.000Z",
    "title": null,
    "text": "Great affordable rental space but i found a space a block from my house. I would recommend to anyone."
  },
  {
    "author": "Keith Stone",
    "rating": 5,
    "date": "2025-09-22T06:19:17.000Z",
    "title": null,
    "text": "Great host! Very flexible ! Awesome space, super easy  in and out! Security gate"
  },
  {
    "author": "Alex h",
    "rating": 5,
    "date": "2025-09-13T15:54:43.000Z",
    "title": null,
    "text": "Fantastic experience with Neighbor and my host. I would highly recommend and would use again in the future."
  },
  {
    "author": "Curt Wood",
    "rating": 5,
    "date": "2025-08-30T03:43:40.000Z",
    "title": null,
    "text": "Easy to access, plenty of room, clean space.  Worked out perfectly so I could store a vehicle while I needed the space in my personal garage."
  },
  {
    "author": "Michael C",
    "rating": 5,
    "date": "2025-09-26T02:41:58.000Z",
    "title": null,
    "text": "Great communication, and a nice out-of-view location with easy access.  I highly recommend Mark!"
  },
  {
    "author": "Matthew Spadoni",
    "rating": 5,
    "date": "2025-10-02T19:31:06.000Z",
    "title": null,
    "text": "Fernando was a great host. I will be back next spring when boat season resumes!"
  },
  {
    "author": "Ez",
    "rating": 5,
    "date": "2025-09-28T15:27:50.000Z",
    "title": null,
    "text": "This was much more affordable and convenient than traditional storage spaces. The host was extra communicative also."
  },
  {
    "author": "IllWill",
    "rating": 5,
    "date": "2025-10-01T14:59:44.000Z",
    "title": null,
    "text": "This helped me tremendously with my car that broke down"
  },
  {
    "author": "Tony Roberts",
    "rating": 5,
    "date": "2025-10-01T17:56:35.000Z",
    "title": null,
    "text": "Lots of space. Always accessible."
  },
  {
    "author": "Janeth Hernandez",
    "rating": 5,
    "date": "2025-09-23T14:29:47.000Z",
    "title": null,
    "text": "Jeff was great! Accommodated my needs at the last minute. Thank you Jeff!"
  },
  {
    "author": "Richard R.",
    "rating": 5,
    "date": "2025-10-01T00:53:21.000Z",
    "title": null,
    "text": "Good overall experience.  No issues. Huge and safe location."
  },
  {
    "author": "anthony",
    "rating": 5,
    "date": "2025-09-30T17:02:16.000Z",
    "title": null,
    "text": "Very responsive. Easy drop off"
  },
  {
    "author": "M Walker",
    "rating": 5,
    "date": "2025-09-26T19:01:43.000Z",
    "title": null,
    "text": "Trobi is a Great Host! Her property can host most Anything with Wheels."
  },
  {
    "author": "Jason & Stephanie Patterson",
    "rating": 5,
    "date": "2025-03-20T01:11:48.000Z",
    "title": null,
    "text": "Going on my third full year of being a host.  Had a couple of issues with renters and neighbor did as promised and rectified my issues each time.  April in the trust and safety department and Marcos t..."
  },
  {
    "author": "Becca Matta",
    "rating": 5,
    "date": "2025-05-05T22:48:25.000Z",
    "title": null,
    "text": "**Highly recommend renting this spot!** I used J's parking spot as long-term storage for my car while I traveled abroad for a few months and it was a really great experience! J was super responsive an..."
  },
  {
    "author": "Tiffany Phillips",
    "rating": 5,
    "date": "2025-04-13T12:15:24.000Z",
    "title": null,
    "text": "Kevin and Lee are phenomenal hosts. Their prompt responses helped make my mind up of which facility I chose. They are kind and professional and their facility has cameras and a swamp cooler which mad..."
  },
  {
    "author": "Ely Souza",
    "rating": 5,
    "date": "2025-08-08T10:23:10.000Z",
    "title": null,
    "text": "Great experience was able to find a place to park our trailer within just a few minutes saved us hundreds of dollars love this app"
  },
  {
    "author": "Subbu boy",
    "rating": 5,
    "date": "2025-07-26T18:42:08.000Z",
    "title": null,
    "text": "Great experience! The host was very responsive and made communication easy throughout the booking. The pickup and drop-off location was convenient and easy to find. Everything went smoothly—highly rec..."
  },
  {
    "author": "Will Mak",
    "rating": 5,
    "date": "2025-05-28T02:51:10.000Z",
    "title": null,
    "text": "⭐️⭐️⭐️⭐️⭐️ Outstanding Service – Highly Recommend!\n\nKimberly made the entire vehicle storage process incredibly smooth from start to finish. What could’ve been confusing and time-consuming turned ou..."
  },
  {
    "author": "Peter E",
    "rating": 1,
    "date": "2022-10-31T23:01:57.000Z",
    "title": "This smells like a scam",
    "text": "This smells like a scam, and acts like one.  First of all they want a credit card just to ask the owner where the garage is.  The owner must \"approve\" a \"reservation\" in order to communicate and then the credit card is charged.  In my case, the \"owner\" did not actually control the space and tried to switch me from a garage to a covered space.  In the meantime, Neighbor charged me for the 1st month's rent.  I tried calling the 801 number on the credit card charge but there apparently is no such number.  I emailed support --                 nothing....  The \"owner\" is still listing garage as available however.  SCAM!!!! A second owner tried to limit the times I could access the garage to a 4 hour slot 5 days a week with advance notice. Total waste of time and, obviously, at best a hassle to get a refund for a product that doesn't exist."
  },
  {
    "author": "r m",
    "rating": 1,
    "date": "2022-10-29T21:47:32.000Z",
    "title": "No deals here",
    "text": "Was looking for self storage but the prices were no better than commercial facilities so why bother?"
  },
  {
    "author": "customer",
    "rating": 1,
    "date": "2022-10-20T21:40:22.000Z",
    "title": "They take your money upfront...",
    "text": "Signed up to find a space to temporarily park a 23' sailboat. Located a space and the site required that payment be made upfront before the deal was even finalized by property owner. Huh? Then, when the deal fell through (property owner had already used the space and forgot to remove the listing), the funds for the deal had already been deducted from the credit card by neighbor.com, and would not be returned for \"3 to 5 days\". What??? It appears that the neighbor.com service uses this process as interest-free temp funding for themselves, instead of using an escrow or small deposit or micro withdrawal system to pre-verify transaction funds. Whether by design or incompetence, neighbor.com jams up your funds for for \"3 to 5 days\" on denied transactions, which is bogus. Approve the deal with the property owner via messaging prior and/or offsite first before running it through neighbor.com for payment. Or go around them altogether, lol. Duh."
  },
  {
    "author": "Emma Daguste",
    "rating": 1,
    "date": "2022-10-19T16:29:50.000Z",
    "title": "THESE PEOPLE STOLE MY MONEY",
    "text": "THESE PEOPLE STOLE MY MONEY! I rented a place for two months from July 18 to September 18th. I was charged for 3 months...an additional month after I removed my vehicle on the 17th. I tried to remove my credit card the same day but their website would not allow me to remove my credit card number until my vehicle was actually removed. Then they charged me the next day, on the 18th.   When I e-mailed them, they said that there was nothing they could do because they already sent it to the host.  I contacted the host and she would not refund my money even though she showed me 3 different credit transactions that she received from Neighbors on my behalf.  She tried to rationalize it as 3 months, wanting to charge me for the whole month of July which is not fair!  I started on July 18th!  I will not use this service again and would not refer anyone!  Be careful with this service."
  },
  {
    "author": "Mark",
    "rating": 1,
    "date": "2022-10-11T22:11:43.000Z",
    "title": "SCAM, SCAM, SCAM!!!   STAY FAR AWAY!",
    "text": "SCAM, SCAM, SCAM  --- this site is full of scam fake hosts collecting from false locations.  I read now from other renters that their vehicle got towed like mine and they got no support from Neighbor so I expect none and you should stay far away or risk losing whatever you are storing and paying to do so!  Got my lein notice today to let me know my vehicle was towed.  Tow company wanted more than vehicle worth.  Now paying to give away my vehicle! I did email the neighbor support address (there is no phone number). Got a response from neighbor.com today asking for more information which I will send."
  },
  {
    "author": "GG",
    "rating": 1,
    "date": "2022-09-24T02:16:35.000Z",
    "title": "Not worth it",
    "text": "I have this app for a while but never actually signed up. I want to rent out my garage space or driveway to make some money. I’ve been checking out other listings and trying to see what other hosts do. I finally signed up few days ago. I stopped when they asked me to upload my ID. I want to wait till after I list my space which I’m not ready yet. Within hours I started receiving texts that asked why my sign-up not complete. If I don’t complete soon, they will call me, which they did multiple times. And more texts too. I blocked all the calls and ignore all texts. That’s very intrusive and unnecessary. After reading tons of negative reviews, plus my own experience here, I deleted my account."
  },
  {
    "author": "Jessica Mathers",
    "rating": 1,
    "date": "2022-09-22T02:09:34.000Z",
    "title": "Insanely Pushy Sales People, 2 calls+text in one day",
    "text": "I signed up yesterday to look for places to store my vehicle and sent a message to one host asking if he was on a bus line. Fast forward `13 hours and I've received 2 phone calls and one text from salespeople trying to get me to reserve and pay for the spot before I know if it's on the bus line. This is WAY overboard. I requested that they delete my account and not to contact me again."
  },
  {
    "author": "Jazzy B.",
    "rating": 1,
    "date": "2022-09-17T19:06:24.000Z",
    "title": "Beware of their payment policy…",
    "text": "Beware of their payment policy as they're not clear. I may have to go to the BBB to check out what my rights are. I was on vacation in Las Vegas and my car broke down the car shop informed me back they could not fix my car & I couldn't keep my car there. well I live in San Diego so I needed to ship the car back home. Until I came up with the money to do that I needed to park my car somewhere safe. I came across neighbor.com, The host I used was very good he went above and beyond he worked with all 3 of my tow truckers. He even held on to my keys and kept my car under video surveillance so I can feel comfortable. I let him know my car was only going to be there for about 2-3 weeks. When I looked for my reservation I placed I was only going to need the space for no longer than a month (site gives you options of: one week, one month, or multiple months). So I need the reservation for 1 month They charged me close to $60. Nothing there said the $60 was a discounted first month price. Once my car was picked up and shipped back home I canceled the rest of my reservation, which was another 2 weeks. Next thing I know I'm getting charges that I'm still disputing today from neighbor. When I finally was able to talk to a human (because they give you a robot at first). They let me know that was just a discounted first month and because I didn't continue on with the second month. So they had to charge me the full amount. When I looked on a reservation it said nothing about that! I wouldn't have booked the reservation if I knew that! I let the person I was on the phone with know how silly that sound when my reservation was literally made for one month! I didn't click on multiple months as an option just simply 1 month. All he could do was apologize and say that's their policy which I saw nothing about that. Definitely feels like a scam. I will never use them again. I was going to tell everybody about the site. considering I work in entertainment and how often my artist and friends are out there in Vegas. Good thing I placed this on my cash app card where I can keep locking my card and disputing the charges until I can get them to stop. I'll keep you guys updated about my current experience, as I have my lawyer looking over to see what I can legally do for the time being. I'm definitely going to go to the BBB and let them know what unfair practices They are practicing. I would have been fine if they had told me up front once you end your reservation you're going to get charged another $60 instead of it being a surprise. Because I wouldn't have booked that, I would have just called the hotel I was staying at and paid them an extra $100 to keep my car there since I only needed the space for 2 weeks."
  },
  {
    "author": "Al S",
    "rating": 1,
    "date": "2022-09-08T22:27:23.000Z",
    "title": "scams and poor service",
    "text": "scams and poor service On first impression, the site looks and feels legit and with an interface akin to airbnb or similar, but something seems to be deeply wrong with this startup.  A real shame, it's a great idea. Pushy agents called and messaged me prior to my booking. 1st booking was canceled for no good reason. 2nd booking was a scam: the people at the location had the space blocked and knew nothing about the space being listed. Avoid."
  },
  {
    "author": "Ellie",
    "rating": 1,
    "date": "2022-08-27T03:26:18.000Z",
    "title": "Billing Scam",
    "text": "I needed a space for 4 days and was told that a 30-day rental was required.  Host and Neighbor.com were aware of timing as it was discussed at length.  Ultimately, I agreed to pay the full month as no other options were available. The following month my credit card was charged for another 30 days.  The host was surprised and disappointed.  Neighbor.com refunded the second month’s charge but withheld approximately $20 for a “late” cancellation fee.  After emailing Neighbor.com twice, my request for a full refund was rejected.  Scam!!  Do not give these folks your cc number.  I have notified Mastercard of the illegal charge and shared written communications.  My time is worth more than $20, but I’m continuing to fight as I’m tired of all the scams."
  },
  {
    "author": "Scott Shappe",
    "rating": 1,
    "date": "2022-08-26T19:39:20.000Z",
    "title": "Pushy salesmen",
    "text": "I got halfway through a listing because I was curious about it. I was texted by a representative to complete it, and I told the representative that the space was not yet ready. He encouraged me to list it anyway (red flag number one), and I said that I would not until it was ready, and that it would not be for several months. He then proceeds to start calling me, which prompts me to let him know that I will never be using this site as long as it employees people that don't understand the difference between checking on prospects and harassing them. Matthew, if you read this, consider a different career where you don't have to meet a quota."
  },
  {
    "author": "Franck Dernoncourt",
    "rating": 1,
    "date": "2022-08-22T20:32:27.000Z",
    "title": "They'll spam your phone number",
    "text": "They'll spam your phone number. Woke me up in the morning. Also the service is very unreliable. Don't use them"
  },
  {
    "author": "Jaime Macinnis",
    "rating": 1,
    "date": "2022-08-21T16:19:32.000Z",
    "title": "Beware - Do not have their act together.",
    "text": "I responded to a listing and signed up only to find it was out of the area I was wanting to be in. Cancelled immediately but nevertheless was billed not once, not twice but three times even after working with customer service. Then I was told because I disputed the charge they banned me from the website. The only reason I went to the website was to confirm the reservation was cancelled. These guys have a lot of growing to do. Would never consider using them again."
  },
  {
    "author": "Denis",
    "rating": 1,
    "date": "2022-08-21T03:24:47.000Z",
    "title": "Using neighbor.com costed me over $10,000 in damages. Beware!",
    "text": "Using neighbor.com costed me over $10,000 in damages. Beware! My car was parked in Los Angeles at the parking lot that I was paying for 6 month (September - February). Came back from overseas trip in February, came to pick up my car to the location only to find out my car was not there. Host did not respond to communication, no help from Neighbor support either. I had to go to Police and claim my car as stolen. 2 weeks later I have received a call from Riverside police officer who told me to come to police tow yard in Riverside to get my car. Apparently, my car has been towed from the parking lot I was paying for. Tow company kept it in tow yard, later sold as junk from auction. When I picked my car it was damaged outside, dents, scratches, worn out tires. Inside was just disgusting. It took me a lot of time and money to make this car drivable again. I had worked with my insurance for few month to get compensated. My car was totaled as a result. My premium gone up. And some of the damages has not been covered. I have also worked with Neighbor.com support, the representative was very human and helpful. Even though it took time, I was able to get full refund for the storage. However, When I wanted to leave negative review for the host, Neighbor.com suppressed my review. It's been over 2 weeks since I published my review and still \"under review\". Please be aware that platform doesn't do background check on hosts, you can easily get into situation like mine and you will have to deal with it on your own. If I only knew how much of a trouble and damage using Neighbor.com will cause - I would never ever come near this platform."
  },
  {
    "author": "Kevin Whitney",
    "rating": 1,
    "date": "2022-08-08T01:46:47.000Z",
    "title": "Beware… illegal listings",
    "text": "I found several listings in my area on neighbor.com that are city street parking spots in residential neighborhoods. This isnt even legal. I would not trust this site if they allow illegal listings."
  },
  {
    "author": "Ka",
    "rating": 1,
    "date": "2022-07-21T13:49:52.000Z",
    "title": "It was a nightmare………………….",
    "text": "I was a renter who needed a storage space to store my vehicle and personal belongings. Let me be up-front. My 1st time experience with neighbor.com was absolutely terrible. They touted on their website about their scam prevention with their \"multi-layer defense strategy. Measures used include photo ID, phone, and email verification.\" However, it still failed to do anything to protect me from the scammer, who illegally claimed an abandoned house as his own then listed on the website stating they “just bought this lovely home and is willing to help people out.” First off, neighbors.com did not verify the legal ownership of the property from the scammer; I doubt if they even tried to verify the conditions and the dimensions of the property because the size of the deserted garage space was not as described on the listings when I arrived at the property. From the point when when I met up with the scammer host to arriving at the property, it screamed suspicions in every way. Not only was the property badly deserted and rundown, the garage was also much smaller than what was stated on the website. The scammer simply told me to park at the driveway in front of the garage. The host was very unresponsive and kept making excuses for all the suscupicions I raised to him. However, it was couple days before I left the area, so I had no choice but to stick with the property but I purchased the protection plan from Neighbor at the last minute just in case something bad happened. God forbid, when I returned back to the area, I found out my car was impounded because the son of the real owner (who passed away long time ago) found an unknown vehicle parking inside his dad’s property. I had to go through the headaches, anger and frustrations of trying to get the hold of the scammer, find out where my car was towed, and buy back my car from a shady auction winner out of my own pocket. My car was damaged during the towing and many valuable items were stolen from inside the car. This experience had traumatized me and scarred me permanently. I sincerely hope my experience will be helpful in informing any future customers who consider Neighbor.com."
  },
  {
    "author": "Dennis Kwang",
    "rating": 1,
    "date": "2022-07-20T01:32:14.000Z",
    "title": "The neighbor guarantee is a scam",
    "text": "The neighbor guarantee is a scam. I rented a spot from a host that turned out to be a scammer and had my car tolled. Not only did Neighbor not refund me for the cost of the rent but did not cover any damages to my items. After months of frustration with customer service and their insurance provider, there was no resolution. Do not trust!"
  },
  {
    "author": "David",
    "rating": 1,
    "date": "2022-08-01T18:29:24.000Z",
    "title": "I’m looking for a spot for winter to…",
    "text": "I’m looking for a spot for winter to store my boat I messaged one person an waiting on their reply So Sunday morning around 7-8 arjay  from slc Utah calls me from 1-385-488-2888 saying different things I need to do an he can walk me through the process I said no thanks it was a simple yes or no question I asked I just couldn’t believe this guy called me that early on a Sunday some of us work an like to sleep in on the weekends but I think this made up my mind to probably not use this app if they are that rude an pushy It wasn’t a host it was one of your customer service people the host east fine an said the same thing about you guys"
  },
  {
    "author": "PissedNeighbor",
    "rating": 1,
    "date": "2022-07-14T17:39:04.000Z",
    "title": "This app is a scam",
    "text": "This app is a scam. All I got was useless inquiries from people asking to live in old RV's in my driveway even though my ad is super clear that I will never allow that. First car that rented my driveway died after not being started for 2 weeks and was a huge pain in the ass to deal with. Neighbor was ZERO help. If someone parks in your driveway you can't touch their car or move it, which means the battery will drain in a week or two and it will not start trapping you and the car. Just plain stupid policies. NOT WORTH THE HEADACHE!"
  },
  {
    "author": "Mario",
    "rating": 1,
    "date": "2022-06-18T01:39:15.000Z",
    "title": "I think this app is an app I've used in…",
    "text": "I think this app is an app I've used in the past but now it seems like I've never used it before could I have used a different one? I'm not sure but they both kind of sucked . Plus listening to all the grown adults in the app b*tch and complain about their stuck up lives makes me sick an I pitty most of you"
  },
  {
    "author": "David Blake",
    "rating": 5,
    "date": "2025-10-03T01:29:27.000Z",
    "title": null,
    "text": "My classic '74 MGB roadster was kept dry and in fine shape for nearly two years during my house remodel.  When I drove it home, it started right up and Shalbindra filled the tires to the proper pressu..."
  },
  {
    "author": "Charles Christiansen",
    "rating": 5,
    "date": "2025-09-23T21:16:57.000Z",
    "title": null,
    "text": "Ease of use of the app, money saving over traditional storage facilities. Have used this app for two different reservations over the last couple years and have found everything to be above board would..."
  },
  {
    "author": "CHARLES H",
    "rating": 4,
    "date": "2025-09-17T07:45:13.000Z",
    "title": null,
    "text": "Finding a parking spot for our RV was easy with Neighbor. Martin helped locate the location and helped me with the process. Jason, the host, was easy to work with and easy to communicate with as well...."
  },
  {
    "author": "Fabio",
    "rating": 5,
    "date": "2025-08-11T18:52:33.000Z",
    "title": null,
    "text": "I needed a long term parking spot and aside from having multiple options right off the bat all within 2 miles of my house, I got put in contact with the host within hours and I had secure the spot by..."
  },
  {
    "author": "Janet Desmarais",
    "rating": 5,
    "date": "2025-10-03T21:57:36.000Z",
    "title": null,
    "text": "Best safe space ever. Extended stay. Lighted gated area. Great communication. Would highly recommend."
  },
  {
    "author": "Paul",
    "rating": 5,
    "date": "2025-08-24T00:03:38.000Z",
    "title": null,
    "text": "Great experience, highly secure note on site security with multiple gated locks.  Location is in the mangroves so buggy at times bed price around. I will use this facility again next year."
  },
  {
    "author": "Elise",
    "rating": 5,
    "date": "2025-10-02T20:30:12.000Z",
    "title": null,
    "text": "The space is very private behind a fence. It is easy to access, and the host is quick to respond when coordinating drop off and pick up."
  },
  {
    "author": "William Wallace",
    "rating": 3,
    "date": "2025-09-18T01:19:02.000Z",
    "title": null,
    "text": "For the most part its been good, once its up and running it takes very little maintenance.  However some new options have led to issues, for example rhe automatic approval feature. Renter had a 40 foo..."
  },
  {
    "author": "Tommy Shields",
    "rating": 5,
    "date": "2025-07-17T21:56:54.000Z",
    "title": null,
    "text": "The place is setup rather well. Easy to pull in and maneuver your camper into its assigned parking spot. Location is very convenient from 275. The owner was on top of setting me up with access and liv..."
  },
  {
    "author": "DD",
    "rating": 4,
    "date": "2024-11-04T21:08:00.000Z",
    "title": null,
    "text": "Neighbor was GREAT income, I'm going to begin using it again soon! THE customer services really protected me when a fraudulent client wanted to get $ out of me to pay for towing fees for a vehicle t..."
  },
  {
    "author": "Irene Glazer",
    "rating": 3,
    "date": "2025-09-15T06:40:09.000Z",
    "title": null,
    "text": "Would be much better if you prorated the service as I ended up spending more than I needed to because I didn’t need the whole rest of the month."
  },
  {
    "author": "Diane B",
    "rating": 5,
    "date": "2025-06-02T04:10:18.000Z",
    "title": null,
    "text": "Neighbor was an excellent company to deal with. They were very professional, honest, and trustworthy! There were no hidden fees, the host I eventually chose is amazing. Both the company, and the host,..."
  },
  {
    "author": "Mari",
    "rating": 5,
    "date": "2024-11-04T23:17:15.000Z",
    "title": null,
    "text": "The renter I have now is GREAT. Very nice guy. Very respectful. I would definitely recommend the app. Just make sure you do not give out your number. Better to keep any convo in the app because honest..."
  },
  {
    "author": "Deana A.",
    "rating": 5,
    "date": "2025-07-17T22:39:24.000Z",
    "title": null,
    "text": "Neighbor was such a great help to our family when we needed emergency storage fast!  We rented from Mr. Raghav who replied quickly and allowed us to rent his space.  No problems and he even allowed us..."
  },
  {
    "author": "Parke Blair",
    "rating": 5,
    "date": "2025-07-04T06:24:46.000Z",
    "title": null,
    "text": "I have several Cars, including an incredibly rare BMW Convertible that I needed a place to park in between moves/Homes while staying at AIRBNB's in between.\nIncredibly reasonable price, close proximi..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-05T23:23:08.000Z",
    "title": null,
    "text": "Neighbor offered options outside the standard mass storage facilities, and though hesitant at first, everything has gone smoothly and I was able to find a fantastic host in a good, safe and close-by l..."
  },
  {
    "author": "Red Dog",
    "rating": 5,
    "date": "2025-08-11T19:48:57.000Z",
    "title": null,
    "text": "We needed 2 53’ trailer spots immediately. Neighbor had the ideal location and at a very good price.  We were booked within minutes and the spaces were immediately available.  It’s hard to find places..."
  },
  {
    "author": "jen faux",
    "rating": 5,
    "date": "2025-06-13T21:26:22.000Z",
    "title": null,
    "text": "I had reached out to Bryce, last minute, and he was very accommodating. He also provided any and all pertinent information necessary to store our trailer. The lot itself is quite sizable with plenty o..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-10T19:47:40.000Z",
    "title": null,
    "text": "Jenna's spot was perfect for my temporary needs; easy access, decent price, and she kept an eye on things. I would recommend her for your outdoor vehicle storage needs. Thanks!"
  },
  {
    "author": "Matt Passios",
    "rating": 5,
    "date": "2025-09-21T23:37:31.000Z",
    "title": null,
    "text": "Good communication and great service. Just overall a really nice guy and will make sure whatever you keep parked there is safe."
  },
  {
    "author": "Allison Stokes",
    "rating": 5,
    "date": "2025-07-30T17:53:04.000Z",
    "title": null,
    "text": "Standard storage space for car while I was dealing with insurance post-accident. However, Jimmy was responsive and helpful when I needed to access the space and when I needed to have the car brought i..."
  },
  {
    "author": "Sofia",
    "rating": 5,
    "date": "2025-09-22T21:45:41.000Z",
    "title": null,
    "text": "This app worked well for me! I personally didn’t need to pay for the apps insurance is my only response, but other spots it may be a good call."
  },
  {
    "author": "Tiffany N",
    "rating": 5,
    "date": "2025-09-25T01:58:49.000Z",
    "title": null,
    "text": "Easy, quick communication from host, perfect spot to store my vehicle, well priced."
  },
  {
    "author": "DJ",
    "rating": 5,
    "date": "2025-08-15T22:49:07.000Z",
    "title": null,
    "text": "Easy transaction, good variety of places in the area that met all our needs. Seemless, stress-free long-term parking for our family vehicle."
  },
  {
    "author": "Holly",
    "rating": 5,
    "date": "2025-07-29T18:59:26.000Z",
    "title": null,
    "text": "Tisha has great rental spaces, we have had to move in and out a few times over the years and she is so nice and understanding when plans change. Always an easy move in, and move out experience"
  },
  {
    "author": "Matthew Plude",
    "rating": 5,
    "date": "2025-09-16T16:57:27.000Z",
    "title": null,
    "text": "Amazing host and beautiful property. Could not ask for a better place to store our RV. Highly recommend."
  },
  {
    "author": "Cyndi Gant",
    "rating": 4,
    "date": "2025-08-10T15:43:43.000Z",
    "title": null,
    "text": "Pretty easy to use. Messaging with potential renters is good. Only challenge I had was listing my garage. It seemed nothing met their criteria"
  },
  {
    "author": "Fatima Jones",
    "rating": 5,
    "date": "2025-08-18T13:51:29.000Z",
    "title": null,
    "text": "The space worked out for a while but then the town of where I rented from told host we would have to move our vehicle witch was fustrating"
  },
  {
    "author": "Scott Odenbrett",
    "rating": 5,
    "date": "2025-08-31T19:07:36.000Z",
    "title": null,
    "text": "I've used neighbor twice and have had great experiences both times.  It's easy to get started and when it's time to move on, it's easy to cancel."
  },
  {
    "author": "Mark Watson",
    "rating": 5,
    "date": "2025-09-04T01:27:26.000Z",
    "title": null,
    "text": "This is a great place to store a boat. It was easy access and I felt my boat was safe and secure while stored here. I stored my boat here for about 8 months and never had any issues and happily give a..."
  },
  {
    "author": "Clayton Lerch",
    "rating": 5,
    "date": "2025-09-17T19:06:55.000Z",
    "title": null,
    "text": "Great affordable rental space but i found a space a block from my house. I would recommend to anyone."
  },
  {
    "author": "Keith Stone",
    "rating": 5,
    "date": "2025-09-22T06:19:17.000Z",
    "title": null,
    "text": "Great host! Very flexible ! Awesome space, super easy  in and out! Security gate"
  },
  {
    "author": "Alex h",
    "rating": 5,
    "date": "2025-09-13T15:54:43.000Z",
    "title": null,
    "text": "Fantastic experience with Neighbor and my host. I would highly recommend and would use again in the future."
  },
  {
    "author": "Curt Wood",
    "rating": 5,
    "date": "2025-08-30T03:43:40.000Z",
    "title": null,
    "text": "Easy to access, plenty of room, clean space.  Worked out perfectly so I could store a vehicle while I needed the space in my personal garage."
  },
  {
    "author": "Michael C",
    "rating": 5,
    "date": "2025-09-26T02:41:58.000Z",
    "title": null,
    "text": "Great communication, and a nice out-of-view location with easy access.  I highly recommend Mark!"
  },
  {
    "author": "Matthew Spadoni",
    "rating": 5,
    "date": "2025-10-02T19:31:06.000Z",
    "title": null,
    "text": "Fernando was a great host. I will be back next spring when boat season resumes!"
  },
  {
    "author": "Ez",
    "rating": 5,
    "date": "2025-09-28T15:27:50.000Z",
    "title": null,
    "text": "This was much more affordable and convenient than traditional storage spaces. The host was extra communicative also."
  },
  {
    "author": "IllWill",
    "rating": 5,
    "date": "2025-10-01T14:59:44.000Z",
    "title": null,
    "text": "This helped me tremendously with my car that broke down"
  },
  {
    "author": "Tony Roberts",
    "rating": 5,
    "date": "2025-10-01T17:56:35.000Z",
    "title": null,
    "text": "Lots of space. Always accessible."
  },
  {
    "author": "Janeth Hernandez",
    "rating": 5,
    "date": "2025-09-23T14:29:47.000Z",
    "title": null,
    "text": "Jeff was great! Accommodated my needs at the last minute. Thank you Jeff!"
  },
  {
    "author": "Richard R.",
    "rating": 5,
    "date": "2025-10-01T00:53:21.000Z",
    "title": null,
    "text": "Good overall experience.  No issues. Huge and safe location."
  },
  {
    "author": "anthony",
    "rating": 5,
    "date": "2025-09-30T17:02:16.000Z",
    "title": null,
    "text": "Very responsive. Easy drop off"
  },
  {
    "author": "M Walker",
    "rating": 5,
    "date": "2025-09-26T19:01:43.000Z",
    "title": null,
    "text": "Trobi is a Great Host! Her property can host most Anything with Wheels."
  },
  {
    "author": "Jason & Stephanie Patterson",
    "rating": 5,
    "date": "2025-03-20T01:11:48.000Z",
    "title": null,
    "text": "Going on my third full year of being a host.  Had a couple of issues with renters and neighbor did as promised and rectified my issues each time.  April in the trust and safety department and Marcos t..."
  },
  {
    "author": "Becca Matta",
    "rating": 5,
    "date": "2025-05-05T22:48:25.000Z",
    "title": null,
    "text": "**Highly recommend renting this spot!** I used J's parking spot as long-term storage for my car while I traveled abroad for a few months and it was a really great experience! J was super responsive an..."
  },
  {
    "author": "Tiffany Phillips",
    "rating": 5,
    "date": "2025-04-13T12:15:24.000Z",
    "title": null,
    "text": "Kevin and Lee are phenomenal hosts. Their prompt responses helped make my mind up of which facility I chose. They are kind and professional and their facility has cameras and a swamp cooler which mad..."
  },
  {
    "author": "Ely Souza",
    "rating": 5,
    "date": "2025-08-08T10:23:10.000Z",
    "title": null,
    "text": "Great experience was able to find a place to park our trailer within just a few minutes saved us hundreds of dollars love this app"
  },
  {
    "author": "Subbu boy",
    "rating": 5,
    "date": "2025-07-26T18:42:08.000Z",
    "title": null,
    "text": "Great experience! The host was very responsive and made communication easy throughout the booking. The pickup and drop-off location was convenient and easy to find. Everything went smoothly—highly rec..."
  },
  {
    "author": "Will Mak",
    "rating": 5,
    "date": "2025-05-28T02:51:10.000Z",
    "title": null,
    "text": "⭐️⭐️⭐️⭐️⭐️ Outstanding Service – Highly Recommend!\n\nKimberly made the entire vehicle storage process incredibly smooth from start to finish. What could’ve been confusing and time-consuming turned ou..."
  },
  {
    "author": "u brio",
    "rating": 1,
    "date": "2022-06-24T21:06:17.000Z",
    "title": "A word of warning about using neighbor.com",
    "text": "A word of warning about using neighbor.com. It’s an interesting concept, but I’ve found that the hassles are more than any money saved instead of using a commercial storage facility. I found someone near me who had space to rent in a garage. The location was good and the price was good. I was approved to use the space on May 17. I posted a start date of May 24. Neighbor.com's email said the host would be contacting me soon. I never heard from the host, so I contacted him on May 24 about when I could view the space. Several more emails with the host finally produced a meet date. I wasn’t able to see the garage until May 31—two weeks after my approval and one week after my start date. I was surprised when the host told me he worked from home. So he ignored my messages for 2 weeks even though he was available to show it during that time. I decided not to use the space and asked for a refund of my initial payment. I was told I could not get a refund because refunds are only allowed within 1 day after my start date. One day after my start date, I was still waiting to connect with the host.  Now it is a battle of fighting this company via my bank. I’m sure other hosts wouldn’t wait 2 weeks to connect with a customer. So it is the host’s fault in this case, not neighbor.com’s fault. But they aren’t interested in fixing the issue. My hassles with the host are compounded by the hassles of dealing with neighbor.com. As in real life, there are good neighbors and bad neighbors(.com). UPDATE: My bank refunded me the money I spent with Neighbor.com. It was generous of them, but I didn't want them to eat the money. I expected Neighbor.com to give me a refund, but they just kept telling me that I could only get a refund 1 day after my start date. I knew that, but my circumstances didn't fit into their policy. I wasn't asking for a major exception to their rules. I expected good customer service based on the fact that the host never contacted me until a week after my start date. None of this was my fault, except for not being pushy with the host."
  },
  {
    "author": "Mike Flores",
    "rating": 1,
    "date": "2022-05-23T23:10:24.000Z",
    "title": "Total scam and waste of my time",
    "text": "Total scam and waste of my time. I had an ‘engineer’ with bad grammar inquiring to rent my garage only to be rude. Of course Neighbor listening only to her side banned me. I won’t rent to people who have nefarious intentions or list with unethical business."
  },
  {
    "author": "MJ",
    "rating": 1,
    "date": "2022-04-17T14:16:04.000Z",
    "title": "I’ve use the service for a year to…",
    "text": "I’ve use the service for a year to store a classic car. I lucked out because I found a decent guy that lives alone that cares about the car. That being said, there app is not reliable and doing things as simple as updating your payment method is an exercise in futility.  Their customer service is nonexistent and, if something happens and you miss a payment they send you a text message telling you that they’re going to publicly auction your belongings. I cannot in good faith recommend this app or their platform and if you do decide to use it, do it at your own peril."
  },
  {
    "author": "Chris Nguyen",
    "rating": 1,
    "date": "2022-04-14T20:03:34.000Z",
    "title": "This is not the Airbnb/Uber of Anything but Losing",
    "text": "This is not the Airbnb, Uber, of anything. Airbnb and Uber vet their users, on both sides, and step in when there is malice to either user or provider. Neigbor.com DOES NOT. Neighbor.com does not vet the renters on their platform. Anyone with a fake name, email, google number can rent from you. I tried to recover the real name of my renter to pursue legal action and they don't even have that on file and I can't even get ahold of him. A renter rented my space damaged myproperty 3 various times as well as my actual neighbor and Neighbor.com pointed me to their agreements page and said they DO NOT step in or provide any compensation or SERVICES if property is damaged. All the liability is off their backs all they provide is the 'PLATFORM'  which connects renters and hosts. This leads to scammers, disagreements, property damage, and lost revenue to hosts. I would not recommend this app to anyone. It is better to create your own agreement that you both can sign and it protects the host and their property. Be Aware Updated: These guys will say \"I'm sorry\" ,\"We're working on it\" , \"We're trying to get better\" . THEY AREN'T and the hundreds upon thousand of people who reviewed them on FB and here agree. This is the same as uber such that Uber had to see murders in cars, women being sexually harassed, and drivers mistreated before they started doing something. Sadly, the same will happen here. Don't let it something like that happen on your property or family. #DELETENEIGHBORAPP"
  },
  {
    "author": "Tadgh B",
    "rating": 1,
    "date": "2022-04-13T20:51:07.000Z",
    "title": "I was almost finished with the host sign up process",
    "text": "I was almost finished with the host sign up process on the app and then I thought I better read the legal documents first. I read the TOS first and boy am I glad that I did. This company claims to protect you the host with a million dollar liability policy but in reality you are on your own. I suggest every one read the TOS before doing business with this company."
  },
  {
    "author": "Brad Diggans",
    "rating": 1,
    "date": "2022-04-11T14:59:35.000Z",
    "title": "Beware Scammers Everywhere",
    "text": "Scammers Everywhere I listed a garage on this app a few weeks ago.  I started to get responses pretty quickly.  Most requested to contact me out of the app which is the first red flag. Person tried to rent garage 3 months paid in advanced and mailed me a check.  Thought I was protecting myself by having them prepay.  Check comes in but its for more than rent amount.  The person explained that he needed me to deposit the full check and send funds to a shipping company. I waited until the check cleared and funds were approved in my account and went to pay the shipping company but their main form of payment was PayPal or Venmo.  Figured that the check was cleared already so sent the shipping money via Venmo as I have paid other service providers this way in the past. After payment I get email that says the person can no longer rent as the job he was to take was no longer available.  At this point I know its a scam.  Person requests refund but I can keep $200 for my troubles. I call my bank and they said the original check could be cancelled up to 5 days after deposit.  I told the person i would give him a refund after the 5th day and he started to threaten me with reporting me and cancelling the check proving my point of waiting to the 5th day.   Scammer used the name of Bryan Christopher.  Email of bryanchristopher325@gmail and phone number of 513-982-0028. Was contacted next day through Neighbor again with similar scam.  Person trying to pay 3 months upfront but this time it was a lawyer fee.  I will tear up the check when/if it comes."
  },
  {
    "author": "Alejandro",
    "rating": 1,
    "date": "2022-03-18T02:30:21.000Z",
    "title": "Absolutely terrible",
    "text": "Absolutely terrible.  They obviously do not screen their Hosts as other bad reviews have mentioned.  I Stored my RV with a Host and made a side deal with Host to stay night 1 day a week.  We had a falling out & I decided to move out due to her constant manipulation & lies.  In her texts (on neighbor.com text app) she admitted that we had made this side deal.  Her thought was to get back at me, so I wouldnt be able to stay one night a week by saying in text that “I just found out from Neighbor.com that I could not have you staying even 1 night a week”.  Eli at Neighbor.com decided to remove me from App due to violation of rules.  Ok, thats cool, whatever, but Host violated rules as well.  She admitted to it on their platform!   I could care less about getting booted from such a chintzy site, but I know that Host would care and she didnt get booted.  Eli then said “it was due to my behaviour, regarding texts on platform.  I know for a fact I didnt curse or anything like that.  All I did was state the facts that she was manipulative and a liar.  Pretty much like this review.  Will I now be booted from \"Trustpilot\"?  I asked him what exactly I said that was offensive & he said “we have already given you our reasoning”,  pretty much blowing me off.  I also wanted to leave a bad review for her as I had gas stolen from my RV at Host spot but now that I am taken off platform, I cannot.  Host specifically stated in add that it was a safe place to store vehicles.  Other tenants should be aware right?  Eli’s response was basically “meh, whatever”.  I can tell you what is going on here.  Neighbor.com makes money off of the Hosts, so of course they didnt want to research problem & come to obvious conclusion that the Host is the “only” one that should of been booted from platform.  Terrible business, stay away! I am now responding to Neighbor.com's response on \"Trustpilot\".  These people are unbelievable.  Their response is basically a bunch of blah blah blah, just filling in space with words to show that they responded.  They count on most people not making the effort of reading it and actually understanding that they really are not saying anything.  I have been repeatedly told about their terms of service when I bring up facts like, the Host violated the rules and there is proof.  How does repeating \"that\" answer the fact that they did not penalize her?  I also keep telling them that she admitted to making this agreement of one night a week with me \"ON THEIR PLATFORM\"!!  And they keep saying that \"we communicated outside of platform\".  No it isn't and I have the proof!  They just go ahead and ignore me when I say that.  That is what is called \"Gaslighting\".  The bottom line is, nobody cares about their concerns about blah blah blah terms and agreements.  This is what real people are concerned with( the truth!).  The host made the side deal with me and there is unequivical proof of that, and that she admitted to it on the platform.  Neighbor.com are masters of Gaslighting and ignoring the obvious and only care about the money.  Again, they didnt want to kick her off the site for breaking their rules because they make the money off of \"her\".  Plain and simple.  They dont want to admit to that because in the end, even though they make money off of the Host, \"NOBODY\" makes any money without the tenant.  So Gaslighting and creating confusion is all they really have in order to have people believe that they dont treat the \"tenants\" in this business transaction terrible.  In summation, Neighbor.com's business practice is officially to take the hosts side at any costs in a dispute between Host and Tenant because that is where the money comes from.  Removing me from app also kept me from giving host bad review on Neighbor.com on her bizarre behaviour and that \"no\" it is not a safe spot to keep your vehicle as my full tank of gas was stolen on RV."
  },
  {
    "author": "Lena Li",
    "rating": 1,
    "date": "2022-03-03T00:07:31.000Z",
    "title": "Thank you neighbor for ruining a 2 year old car!",
    "text": "Sounds like a good idea in practice but it’s pretty clear that the hosts are not vetted. Left a  barely 2 year old car in pristine condition in a “garage” for 1.5 years since I decided to temporarily relocate due to Covid. Ultimately I had my car shipped to me since I would not be returning and it arrived covered in leaves and dirt several inches thick along the windshield. There were even cigarette butts under the wipers. There were leaves and dirt inside of the ventilation. The host clearly didn’t store the car in a garage otherwise there is no way it would be covered in leaves and dirt. The host even had the audacity to charge me to “clean” my car halfway through the storage period. After I thoroughly cleaned the car of all the debris I realized that the paint on the car had become so damaged that it was no longer even glossy. You could see the stains from being constantly rained on until the paint became damaged. It would cost thousands of dollars to fix. Even though I had paid for an indoor garage storage he had stored it outside the majority of my he time causing significant damage to the exterior of the car. I’m devastated by what the host has done to my car. Neighbors response to this was that they wouldn’t do anything. Thank you neighbor for causing my nearly new car thousands of dollars worth of damage!"
  },
  {
    "author": "Teyo Jerge",
    "rating": 1,
    "date": "2022-02-24T02:40:05.000Z",
    "title": "Insurance blowoff",
    "text": "Vehicle damaged while stored, payments going to Neighbor. The validity of the Insurance claim was cut and dry, confirmed/agreed by the host. Neighbors response has been a run around and lack of response while car was undrivable. Handled it myself. Two months later I receive an email from their insurance company, informing me Neighbor is requesting some sort of fraud investigation. In order to process the claim. If an insurance claim becomes necessary expect Neighbor to complicate, avoid, or resist any way possible, while occasionally sending professional sounding redirects and avoidant communications rather than take any sort of effective meaningful action in alignment with their marketing that suggests they are insured and trustworthy. For example….."
  },
  {
    "author": "helmut koch",
    "rating": 1,
    "date": "2022-01-28T23:47:36.000Z",
    "title": "Stay Away!",
    "text": "Although the concept behind the neighbors storage app seems like a good idea, in practice it is seriously flawed and untrustworthy. There are just too many dishonest people out there, both hosts and renters, that make use of this service an exercise in frustration and futility. I have been scammed twice by hosts who advertised  storage areas they did not own or that were public parking lots. The screening process appears to be very superficial to nonexistent, and the people who run the app do not seem to care. It’s an extreme example of buyer/renter beware and the time and effort one has to expend to make sure a rental space is legitimate is not worth it. I will never use this service again and I warn anyone who is contemplating using it to stay clear and far away!"
  },
  {
    "author": "Adam Natoma",
    "rating": 1,
    "date": "2022-01-28T19:13:47.000Z",
    "title": "Dishonest theived",
    "text": "They continue to debit your account stealing your money even after you have cancelled their service"
  },
  {
    "author": "Chris Nguyen",
    "rating": 1,
    "date": "2022-01-13T06:17:45.000Z",
    "title": "As with many people on this website I…",
    "text": "As with many people on this website I too have tried to contact neighbor support dozens of times and they take at least a week to respond each time. An open issue took 6 weeks to resolve. They also do not care about the hosts and do not back up their hosts if renters go awry. I would not feel safe renting my space in this site."
  },
  {
    "author": "Teyo Jerge",
    "rating": 1,
    "date": "2022-01-18T08:59:34.000Z",
    "title": "Valid insurance claim verified by…",
    "text": "Valid insurance claim verified by renter and host received the run around and the dust off. The insurance coverage is just a marketing tool, they have no intention of actually using it, regardless of the validity of the claim. Post Neighbor reply. Exactly!! “Team will always do whatever they can”. Could you be more general or vague, they’ve done nothing. I’ve already reached out to you, by website and email. You have my name, you have the claim, you have the host who was present and took pictures of the damage. Then re-direct me to read about the “guarantee” on your website. This folks is what a professional corporate run around looks like. Still no response directly, but they have time to post empty words here, then suggest I reach out and review their website. It was cut and dry covered, damage from attempted theft while paying Neighbor monthly for storage. The “ team” was non responsive with the exception of our host, who completely agreed the damage was clearly covered."
  },
  {
    "author": "Michael Batista",
    "rating": 1,
    "date": "2021-12-08T17:08:15.000Z",
    "title": "vehicle stolen from a neighbor host",
    "text": "I had my vehicle stolen from a neighbor host and neighbor has refused to make me whole financially. My now spotless insurance claim history has a big fat total loss claim on it for the next 5 years that my PREMIUMS will be higher due to this total loss claim. This amount of money spread over the next 5 years will only be enough to cover my PREMIUM INCREASES. Not only am I out the deductible, but I am out the every single month for the premium increase for the next 5 years. ******EDITED ON 12/8/2021 TO REFLECT UPDATE TO NEIGHBOR's RESPONSE****** Hello Michael, Thank you for your recent follow up with the unfortunate situation with your vehicle.We understand the frustration that this has caused you. We have worked diligently to assist you in your loss and help in any way we could to create a swift resolution. We were pleased to hear that your insurance was able to make you whole and provide you with coverage in your primary claim. Per our terms of service, our renter protection is a secondary coverage and therefore in this situation; because you were covered fully under your policy with Geiko, there is no further coverage that is offered through Neighbor. Allie spoke with you on July 12th and from that time, we were waiting on your response. Many months have passed without communication from you. Now in November, you are contacting us requesting a settlement, but as far as our terms of service, we are not liable to cover any further claim. We certainly do sympathize with how difficult this must have been for you and have removed this host from our platform. As stated before, we are pleased to hear that your loss was covered under your primary insurance and hope that has allowed you to move forward. We strive to create a safe and positive experience for both our hosts and renters and are most disappointed that your experience was not reflective of that. Best wishes to you in your future endeavors. Best, Trust & Safety Neighbor Note to the community: The settlement requested was a meager $5,000 to cover the cost of my This amount of money spread over the next 5 years will only be enough to cover my PREMIUM INCREASES for the total loss claim, and pay for my deductible.  I wasn't asking for an unreasonable amount of funds.  Just enough to make me financially whole for the next 5 years I'll be out every single month from Neighbor's negligence by allowing (at the time of the incident) people on their platform without even performing a background check.  This is not my fault and I should not be held responsible for their host's actions. In this case, theft.  I should not be made an example of."
  },
  {
    "author": "Don White",
    "rating": 1,
    "date": "2021-11-30T18:23:04.000Z",
    "title": "Stayed 5 days got charged 3 months",
    "text": "Stayed 5 days got charged 3 months. Had problem with thier website trying to verify my email account and kept on getting rejected so I had to call cancel my service.  Apparently that doesn't work, you have to use the website to cancel. Called customer service absolutely no help whatsoever."
  },
  {
    "author": "Diane Pfundstein",
    "rating": 1,
    "date": "2021-11-22T18:34:59.000Z",
    "title": "I received no response regarding the…",
    "text": "I received no response regarding the rental I requested after attempting contact 4 times. I think this is a scam. They said you usually hear from this owner of the rental area within three hours but no response from her either. YET They want to know why I haven’t gone through with my reservation!"
  },
  {
    "author": "Joanne Morris",
    "rating": 1,
    "date": "2021-11-16T22:26:28.000Z",
    "title": "If it would accept zero stars",
    "text": "If it would accept zero stars, I would have chosen zero.  I rented a space for my travel trailer and was scheduled to move my trailer. The day before I was to move it, I had to put my truck in the repair shop. I tried to call Neighbor to cancel my reservation but you get voice mail.  I waited a day and tried to call again.  This happened two more times. I began to email them and no response. After the fourth email, I received a cancellation. The cancellation happened to be after the next rental payment was due. I have tried repeatedly to contact customer service but that doesn`t happen. I am dunned several times a day with an email for a payment that is not due. Stay as far away as possible from this company."
  },
  {
    "author": "Brian Chojnacki",
    "rating": 1,
    "date": "2021-11-11T14:37:19.000Z",
    "title": "My car was stolen while using this app",
    "text": "My car was stolen while using this app. Luckily, I filed a police report and was able to get my car back. Neighbor did absolutely nothing to go above and beyond to fix this situation as the only thing I received was my money back from using the app. I would highly recommend you stay away from using their service not only for the safety of your property but because of the moral ethics of this company."
  },
  {
    "author": "Rebecca",
    "rating": 1,
    "date": "2021-11-02T00:39:13.000Z",
    "title": "Charged for a Cancelled Reservation",
    "text": "This company scammed me out of $81, constantly trying to charge my credit card. So I made other arrangements and understood I could not get my initial fee of $40 that I paid for the first month’s of the parking space. Ok, no problem. I cancelled with the owner of the space I was supposed to be renting and also via the app. I was also given a brief survey of why I was cancelling. All proof that I cancelled my reservation successfully. A month later(I always lock my credit card for security reasons), I get a notification by email stating neighbor tried to charge me $81 for my rental space that had been cancelled a month ago. I sent in the proof via email to support along with all the screenshots. Apparently, my reservation hadn’t been cancelled? That makes no sense because I had screenshots proving otherwise sent though that email. Several days in, their system continued to try and charge my card. Unfortunately around the time I was checking out at a store, they managed to steal the $81. I immediately emailed customer service with the same screenshots, demanding a response. Again, my reservation had been cancelled and I had proof. Funny, because they continuously  kept emailing me and were able to get ahold of me quite easily every single time they tried to charge my card and yet when I asked for a refund, customer service never responded back(it had been several days now). I contacted via phone, demanding a manger or supervisor. The woman refused that I could speak to either and simply said she would send this over to a refund team, mark it as urgent and I would hear from them in a couple of days. It has been over a week now. I have also continuously tried to get in contact once more with customer support via email. No response. This company will scam you out of your money. I’m out $80 for a reservation that was cancelled a month ago. It’s not even about the money. It’s how negligent and childish they are being, ignoring all the proof I have that it had been cancelled."
  },
  {
    "author": "Crystal",
    "rating": 1,
    "date": "2021-10-13T16:17:53.000Z",
    "title": "Terrible customer service/no help",
    "text": "This company is terrible if someone damages your property that will not help you they told me that even though a renter has destroyed the side of my home it took them 3 days to tell me message us on our social media since the links for help do not work they tell me we have a 1 million dollar policy that does not cover property damage that I would have to go through my insurance I’m completely floored they put it back on the homeowner and wash their hands. Don’t let your property get damaged they will not help you good luck I am done with these people"
  },
  {
    "author": "David Blake",
    "rating": 5,
    "date": "2025-10-03T01:29:27.000Z",
    "title": null,
    "text": "My classic '74 MGB roadster was kept dry and in fine shape for nearly two years during my house remodel.  When I drove it home, it started right up and Shalbindra filled the tires to the proper pressu..."
  },
  {
    "author": "Charles Christiansen",
    "rating": 5,
    "date": "2025-09-23T21:16:57.000Z",
    "title": null,
    "text": "Ease of use of the app, money saving over traditional storage facilities. Have used this app for two different reservations over the last couple years and have found everything to be above board would..."
  },
  {
    "author": "CHARLES H",
    "rating": 4,
    "date": "2025-09-17T07:45:13.000Z",
    "title": null,
    "text": "Finding a parking spot for our RV was easy with Neighbor. Martin helped locate the location and helped me with the process. Jason, the host, was easy to work with and easy to communicate with as well...."
  },
  {
    "author": "Fabio",
    "rating": 5,
    "date": "2025-08-11T18:52:33.000Z",
    "title": null,
    "text": "I needed a long term parking spot and aside from having multiple options right off the bat all within 2 miles of my house, I got put in contact with the host within hours and I had secure the spot by..."
  },
  {
    "author": "Janet Desmarais",
    "rating": 5,
    "date": "2025-10-03T21:57:36.000Z",
    "title": null,
    "text": "Best safe space ever. Extended stay. Lighted gated area. Great communication. Would highly recommend."
  },
  {
    "author": "Paul",
    "rating": 5,
    "date": "2025-08-24T00:03:38.000Z",
    "title": null,
    "text": "Great experience, highly secure note on site security with multiple gated locks.  Location is in the mangroves so buggy at times bed price around. I will use this facility again next year."
  },
  {
    "author": "Elise",
    "rating": 5,
    "date": "2025-10-02T20:30:12.000Z",
    "title": null,
    "text": "The space is very private behind a fence. It is easy to access, and the host is quick to respond when coordinating drop off and pick up."
  },
  {
    "author": "William Wallace",
    "rating": 3,
    "date": "2025-09-18T01:19:02.000Z",
    "title": null,
    "text": "For the most part its been good, once its up and running it takes very little maintenance.  However some new options have led to issues, for example rhe automatic approval feature. Renter had a 40 foo..."
  },
  {
    "author": "Tommy Shields",
    "rating": 5,
    "date": "2025-07-17T21:56:54.000Z",
    "title": null,
    "text": "The place is setup rather well. Easy to pull in and maneuver your camper into its assigned parking spot. Location is very convenient from 275. The owner was on top of setting me up with access and liv..."
  },
  {
    "author": "DD",
    "rating": 4,
    "date": "2024-11-04T21:08:00.000Z",
    "title": null,
    "text": "Neighbor was GREAT income, I'm going to begin using it again soon! THE customer services really protected me when a fraudulent client wanted to get $ out of me to pay for towing fees for a vehicle t..."
  },
  {
    "author": "Irene Glazer",
    "rating": 3,
    "date": "2025-09-15T06:40:09.000Z",
    "title": null,
    "text": "Would be much better if you prorated the service as I ended up spending more than I needed to because I didn’t need the whole rest of the month."
  },
  {
    "author": "Diane B",
    "rating": 5,
    "date": "2025-06-02T04:10:18.000Z",
    "title": null,
    "text": "Neighbor was an excellent company to deal with. They were very professional, honest, and trustworthy! There were no hidden fees, the host I eventually chose is amazing. Both the company, and the host,..."
  },
  {
    "author": "Mari",
    "rating": 5,
    "date": "2024-11-04T23:17:15.000Z",
    "title": null,
    "text": "The renter I have now is GREAT. Very nice guy. Very respectful. I would definitely recommend the app. Just make sure you do not give out your number. Better to keep any convo in the app because honest..."
  },
  {
    "author": "Deana A.",
    "rating": 5,
    "date": "2025-07-17T22:39:24.000Z",
    "title": null,
    "text": "Neighbor was such a great help to our family when we needed emergency storage fast!  We rented from Mr. Raghav who replied quickly and allowed us to rent his space.  No problems and he even allowed us..."
  },
  {
    "author": "Parke Blair",
    "rating": 5,
    "date": "2025-07-04T06:24:46.000Z",
    "title": null,
    "text": "I have several Cars, including an incredibly rare BMW Convertible that I needed a place to park in between moves/Homes while staying at AIRBNB's in between.\nIncredibly reasonable price, close proximi..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-05T23:23:08.000Z",
    "title": null,
    "text": "Neighbor offered options outside the standard mass storage facilities, and though hesitant at first, everything has gone smoothly and I was able to find a fantastic host in a good, safe and close-by l..."
  },
  {
    "author": "Red Dog",
    "rating": 5,
    "date": "2025-08-11T19:48:57.000Z",
    "title": null,
    "text": "We needed 2 53’ trailer spots immediately. Neighbor had the ideal location and at a very good price.  We were booked within minutes and the spaces were immediately available.  It’s hard to find places..."
  },
  {
    "author": "jen faux",
    "rating": 5,
    "date": "2025-06-13T21:26:22.000Z",
    "title": null,
    "text": "I had reached out to Bryce, last minute, and he was very accommodating. He also provided any and all pertinent information necessary to store our trailer. The lot itself is quite sizable with plenty o..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-10T19:47:40.000Z",
    "title": null,
    "text": "Jenna's spot was perfect for my temporary needs; easy access, decent price, and she kept an eye on things. I would recommend her for your outdoor vehicle storage needs. Thanks!"
  },
  {
    "author": "Matt Passios",
    "rating": 5,
    "date": "2025-09-21T23:37:31.000Z",
    "title": null,
    "text": "Good communication and great service. Just overall a really nice guy and will make sure whatever you keep parked there is safe."
  },
  {
    "author": "Allison Stokes",
    "rating": 5,
    "date": "2025-07-30T17:53:04.000Z",
    "title": null,
    "text": "Standard storage space for car while I was dealing with insurance post-accident. However, Jimmy was responsive and helpful when I needed to access the space and when I needed to have the car brought i..."
  },
  {
    "author": "Sofia",
    "rating": 5,
    "date": "2025-09-22T21:45:41.000Z",
    "title": null,
    "text": "This app worked well for me! I personally didn’t need to pay for the apps insurance is my only response, but other spots it may be a good call."
  },
  {
    "author": "Tiffany N",
    "rating": 5,
    "date": "2025-09-25T01:58:49.000Z",
    "title": null,
    "text": "Easy, quick communication from host, perfect spot to store my vehicle, well priced."
  },
  {
    "author": "DJ",
    "rating": 5,
    "date": "2025-08-15T22:49:07.000Z",
    "title": null,
    "text": "Easy transaction, good variety of places in the area that met all our needs. Seemless, stress-free long-term parking for our family vehicle."
  },
  {
    "author": "Holly",
    "rating": 5,
    "date": "2025-07-29T18:59:26.000Z",
    "title": null,
    "text": "Tisha has great rental spaces, we have had to move in and out a few times over the years and she is so nice and understanding when plans change. Always an easy move in, and move out experience"
  },
  {
    "author": "Matthew Plude",
    "rating": 5,
    "date": "2025-09-16T16:57:27.000Z",
    "title": null,
    "text": "Amazing host and beautiful property. Could not ask for a better place to store our RV. Highly recommend."
  },
  {
    "author": "Cyndi Gant",
    "rating": 4,
    "date": "2025-08-10T15:43:43.000Z",
    "title": null,
    "text": "Pretty easy to use. Messaging with potential renters is good. Only challenge I had was listing my garage. It seemed nothing met their criteria"
  },
  {
    "author": "Fatima Jones",
    "rating": 5,
    "date": "2025-08-18T13:51:29.000Z",
    "title": null,
    "text": "The space worked out for a while but then the town of where I rented from told host we would have to move our vehicle witch was fustrating"
  },
  {
    "author": "Scott Odenbrett",
    "rating": 5,
    "date": "2025-08-31T19:07:36.000Z",
    "title": null,
    "text": "I've used neighbor twice and have had great experiences both times.  It's easy to get started and when it's time to move on, it's easy to cancel."
  },
  {
    "author": "Mark Watson",
    "rating": 5,
    "date": "2025-09-04T01:27:26.000Z",
    "title": null,
    "text": "This is a great place to store a boat. It was easy access and I felt my boat was safe and secure while stored here. I stored my boat here for about 8 months and never had any issues and happily give a..."
  },
  {
    "author": "Clayton Lerch",
    "rating": 5,
    "date": "2025-09-17T19:06:55.000Z",
    "title": null,
    "text": "Great affordable rental space but i found a space a block from my house. I would recommend to anyone."
  },
  {
    "author": "Keith Stone",
    "rating": 5,
    "date": "2025-09-22T06:19:17.000Z",
    "title": null,
    "text": "Great host! Very flexible ! Awesome space, super easy  in and out! Security gate"
  },
  {
    "author": "Alex h",
    "rating": 5,
    "date": "2025-09-13T15:54:43.000Z",
    "title": null,
    "text": "Fantastic experience with Neighbor and my host. I would highly recommend and would use again in the future."
  },
  {
    "author": "Curt Wood",
    "rating": 5,
    "date": "2025-08-30T03:43:40.000Z",
    "title": null,
    "text": "Easy to access, plenty of room, clean space.  Worked out perfectly so I could store a vehicle while I needed the space in my personal garage."
  },
  {
    "author": "Michael C",
    "rating": 5,
    "date": "2025-09-26T02:41:58.000Z",
    "title": null,
    "text": "Great communication, and a nice out-of-view location with easy access.  I highly recommend Mark!"
  },
  {
    "author": "Matthew Spadoni",
    "rating": 5,
    "date": "2025-10-02T19:31:06.000Z",
    "title": null,
    "text": "Fernando was a great host. I will be back next spring when boat season resumes!"
  },
  {
    "author": "Ez",
    "rating": 5,
    "date": "2025-09-28T15:27:50.000Z",
    "title": null,
    "text": "This was much more affordable and convenient than traditional storage spaces. The host was extra communicative also."
  },
  {
    "author": "IllWill",
    "rating": 5,
    "date": "2025-10-01T14:59:44.000Z",
    "title": null,
    "text": "This helped me tremendously with my car that broke down"
  },
  {
    "author": "Tony Roberts",
    "rating": 5,
    "date": "2025-10-01T17:56:35.000Z",
    "title": null,
    "text": "Lots of space. Always accessible."
  },
  {
    "author": "Janeth Hernandez",
    "rating": 5,
    "date": "2025-09-23T14:29:47.000Z",
    "title": null,
    "text": "Jeff was great! Accommodated my needs at the last minute. Thank you Jeff!"
  },
  {
    "author": "Richard R.",
    "rating": 5,
    "date": "2025-10-01T00:53:21.000Z",
    "title": null,
    "text": "Good overall experience.  No issues. Huge and safe location."
  },
  {
    "author": "anthony",
    "rating": 5,
    "date": "2025-09-30T17:02:16.000Z",
    "title": null,
    "text": "Very responsive. Easy drop off"
  },
  {
    "author": "M Walker",
    "rating": 5,
    "date": "2025-09-26T19:01:43.000Z",
    "title": null,
    "text": "Trobi is a Great Host! Her property can host most Anything with Wheels."
  },
  {
    "author": "Jason & Stephanie Patterson",
    "rating": 5,
    "date": "2025-03-20T01:11:48.000Z",
    "title": null,
    "text": "Going on my third full year of being a host.  Had a couple of issues with renters and neighbor did as promised and rectified my issues each time.  April in the trust and safety department and Marcos t..."
  },
  {
    "author": "Becca Matta",
    "rating": 5,
    "date": "2025-05-05T22:48:25.000Z",
    "title": null,
    "text": "**Highly recommend renting this spot!** I used J's parking spot as long-term storage for my car while I traveled abroad for a few months and it was a really great experience! J was super responsive an..."
  },
  {
    "author": "Tiffany Phillips",
    "rating": 5,
    "date": "2025-04-13T12:15:24.000Z",
    "title": null,
    "text": "Kevin and Lee are phenomenal hosts. Their prompt responses helped make my mind up of which facility I chose. They are kind and professional and their facility has cameras and a swamp cooler which mad..."
  },
  {
    "author": "Ely Souza",
    "rating": 5,
    "date": "2025-08-08T10:23:10.000Z",
    "title": null,
    "text": "Great experience was able to find a place to park our trailer within just a few minutes saved us hundreds of dollars love this app"
  },
  {
    "author": "Subbu boy",
    "rating": 5,
    "date": "2025-07-26T18:42:08.000Z",
    "title": null,
    "text": "Great experience! The host was very responsive and made communication easy throughout the booking. The pickup and drop-off location was convenient and easy to find. Everything went smoothly—highly rec..."
  },
  {
    "author": "Will Mak",
    "rating": 5,
    "date": "2025-05-28T02:51:10.000Z",
    "title": null,
    "text": "⭐️⭐️⭐️⭐️⭐️ Outstanding Service – Highly Recommend!\n\nKimberly made the entire vehicle storage process incredibly smooth from start to finish. What could’ve been confusing and time-consuming turned ou..."
  },
  {
    "author": "Dennis Kwang",
    "rating": 1,
    "date": "2021-10-12T21:48:53.000Z",
    "title": "Don't use neighbor",
    "text": "Unfortunately, I got scammed by the host and had my car towed. What is even worse is that there are things missing from my car and I have tried filing a claim with neighbor.com only to be met with silence. Not professional and their guarantee is a scam."
  },
  {
    "author": "John Dalton",
    "rating": 1,
    "date": "2021-10-07T12:03:37.000Z",
    "title": "Beware of scam postings!",
    "text": "I signed up for neighbor so I could rent a parking space for 1 month while my mother in law stayed with us to help with our newborn. Sadly, upon going to pick up my car I discovered the host I had rented with had falsely claimed ownership of the parking space and my car was towed. Now I’m stuck with a $535 bill to recover my car. Additionally the police say the only thing they can do is hold the host accountable for the $25 I paid for the parking space which isn’t worth the time or the headache. This alone would not cause me to write a one star review, the reason I am putting this out there is despite my 2 voice mails and 1 email to their support team I have yet to hear back from Neighbor. Also, after making several attempts to call them I have found that neighbor has turned of the phones and is not answering live calls. All of them get sent to voicemail.  It’s been a week now since sending my email so hopefully they do eventually get back to me, if they do I will be sure to update this review."
  },
  {
    "author": "Ashley Fender",
    "rating": 1,
    "date": "2021-09-30T02:12:24.000Z",
    "title": "NEIGHBOR APP SCREWED ME OVER",
    "text": "Poor service. I was overcharged the amount agreed upon, and Neighbor refuses to refund me. In addition to that, the employee told me to cancel my membership with the host and did not inform me that 1) it would automatically expire despite my having already overpayed for an entire month of service just three days ago and 2) I would lose insurance. Then the employee had the nerve to call me back and place blame instead of coming up with solutions. EXTREMELY POOR SERVICE. Just pay a real storage site instead of people that cannot do their job."
  },
  {
    "author": "Troy Garner",
    "rating": 1,
    "date": "2021-09-28T19:12:03.000Z",
    "title": "I’ve been renting storage space on…",
    "text": "I’ve been renting storage space on neighbor for about a year I’m ready to retrieve my items but I can’t find my host information to contact them - my conversation area is blank in the app - I’ve reached out to neighbor several times for assistance to help me somehow contact my host but to date neighbor hasn’t done anything to assist except send Emails telling me to check my conversations in the app - I’ve tried everything to get my things back - neighbors support doesn’t work no one answers their phone number either They’re the worst !!!!!! They have no problem taking payment from my credit card every month -but when it’s move out time they don’t know anything they can’t connect me with my host again??? Really!!! I wouldn’t recommend this app to my worst enemy SMFH!!!!! Troy"
  },
  {
    "author": "Noel Crockett",
    "rating": 1,
    "date": "2021-09-25T19:02:36.000Z",
    "title": "SCAMMING CON ARTISTS…",
    "text": "I booked a storage reservation on Neighbor.com for the same day. I got a deal for $43 a month. I thought, wow this is fantastic! Well then I got a message saying I had to wait up to 48 hours to be approved by the host,and that I needed  to write the host a good reason why they should approve me. Ok well that held up my scheduled tow truck, but whatever. I didn't read the fine print so I wait for approval. The host approves me for my monthly payment  of $43 and the money is taken from my account. I book a tow truck and the tow guy asks me for the drop off address. Well I pull up the reservation and the address doesn't have the street name only the street number and zip code. I contact the host several times without a response, so I made other storage arrangements.  Then later that afternoon the host finally responds to me. Now keep in my mind my Reservation was set for the prior day. Well I ask the host to cancel my reservation, and he tells me that he can't bcz neighbor will charge him a $60 fee. I sent several emails to neighbor, and still to this day (a month later) they have not replied to my cancelation request. And every day they attempt to charge my account in various different amounts. I have to cancel my card because they won't stop attempting to take money from me. Don't give this company your card information. As far as I can tell, it's a scam ran by some people who are tech savvy, and know how to manipulate search engine traffic."
  },
  {
    "author": "Brian Tietjens",
    "rating": 1,
    "date": "2021-09-13T15:52:03.000Z",
    "title": "Horrible company",
    "text": "Horrible company. Very deceptive business practice. Beware of their 50% off deal for the first month! They find a way to bill your credit card for it. CROOKS - STAY AWAY - VERY DISHONEST."
  },
  {
    "author": "FamBam",
    "rating": 1,
    "date": "2021-09-11T06:00:47.000Z",
    "title": "Storage, not a Living Space!",
    "text": "Host Review-I like the way that host and client are connected and everything is through the app. However, I noticed that within potential clients, there are many who want to live on the storage site rather then “store or park” their items. We didn’t expect what we experienced, people trying to live on our property."
  },
  {
    "author": "Spicy Dan",
    "rating": 1,
    "date": "2021-09-01T21:15:36.000Z",
    "title": "Neighbor IGNORED me then STOLE all the money",
    "text": "I registered Neighbor with my passport ID a couple months ago and got my spaces rent out, however, Stripe asked for my SSN which I don't have so they refused to pay me even though my spaces were fully reserved for at least 2 months. I sent them email (both Neighbor and Stripe)  about how to fix it, turned out they ignored my email for an entire week and secretly removed all my listings and payment history, which means I can't get paid and all my earnings are gone. Here's the entire story: At the signing up part, I used my passport ID to register and manually get approved by the specialist they sent me, it means I can list my space and get paid already, I was not required to provide SSN at all. then Stripe asked for my SSN for identity all of a sudden near payment date and used it to pause the payment, I kept sending emails saying I don't have it yet and my passport photo ID was already a solid proof of my identity but no reply from either of them. Today when I checked Neighbor app, ALL my earning records and listings are gone. I just want to say, at the beginning they were like super active and friendly to urge me providing information to sign up by endless texting and calling..... and now they totally ignore me just because a tiny issue and STEAL my earnings, absolutely disgusting what they did!!! In case anyone who read this and a lawyer, is that a fraud?"
  },
  {
    "author": "Henry Davis",
    "rating": 1,
    "date": "2021-08-30T21:54:43.000Z",
    "title": "Just another Negative review this time…",
    "text": "Just another Negative review this time as a HOST...(I wrote with a pseudo name to not be followed home at night by a NEIGHBOR enforcement officer) BUSINESS ANALYSIS of NEIGHBOR This outline is of a deeper analysis of the NEIGHBOR  BUSINESS PRACTICES written by a HOST within the public services provided under the published Terms and Conditions of NEIGHBOR. This is a very short treatise/outline on the business model NEIGHBOR  ostensibly used in establishing their business. This writing is in no way advocating the use or non-use of this service.  I am not an employee of NEIGHBOR or its affiliates or its parent organization. 1) Great idea, lead to, 2) Build on the AirBnb model, resulting in, 3) Start-up with lack of detailed analysis of \"in fault\" potential issues, thus, 4) Using the \"Build the business in progress\" model (read on the fly), 5) Development and release of the online application (read before someone else does) breeds commerce without staffing, policies to manage the surge of contracts (read hosts and buyers), breeding, 6) PROBLEMS and lots of them, creating, 7) Cash flow imbalance of income versus the cost of customer service staffing and training, documented procedures for a multitude of issues (read overwhelmed), resulting in, 8) Negative host and buyer feedback to the level of 47% (must extrapolate for those that didn't write reviews), creating a need for, 9) Solutions within chaos. A brilliant idea cannot flourish within chaos.  Only by disciplined following of the below recommendations will the business recover quickly versus a lengthy and painful \"on the fly\" approach. THE PATH FORWARD: ... The last paragraph in this information is a complaint from a customer,  not me, but, points out the \"hole\" in the NEIGHBOR business model. I actually have the same problem so I copied this person's well written review. \"I'm a pretty patient person, but this company does not care...at all. No one ever picks up the phone. You'll get a response after days of emailing them without a resolution, so you have to email them again and wait over a week. I'm currently waiting on a response on a time sensitive situation and it's been over a week, no one has gotten back to me. Customer service is non-existent.\""
  },
  {
    "author": "KG",
    "rating": 1,
    "date": "2021-08-19T19:27:53.000Z",
    "title": "bummer  experience",
    "text": "I found storage on the app. Gave a credit card. Then they sent a message that the storage was not available. 5 days later they have not credited back my card. My big beef is they don't let you see where the storage is located before committing. At least show me the neighborhood. Disapointed and waiting for a refund."
  },
  {
    "author": "Wayne Sun",
    "rating": 1,
    "date": "2021-08-18T21:16:22.000Z",
    "title": "I don't know if this a joke or scam",
    "text": "I don't know if this a joke or scam. I need a car storage so I submitted inquiries - no answer. Then I sent requests which needed to know my credit card information. After I gave my information and sent the requests, I got no response at all, even though on the website said their average response time are all 6 hours! I had to cancel all my requests the next day. Now I'm waiting to see if they're going to charge my credit card. The website also ask you to leave feedback. That's a joke, too. You cannot see any feedback you or someone else left for the space owners. Totally waste of time, if it's not a scam!"
  },
  {
    "author": "Tom T",
    "rating": 1,
    "date": "2021-08-14T12:05:33.000Z",
    "title": "The Worst",
    "text": "The Worst. Run Now. The host cancelled on me and Neighbor will not stop charging me. Customer service doesn't respond to anything. The cancellation on my end doesn't go through. I have to have my credit card company fight it for me now. Even their customer survey only lets you click 10/10 lol."
  },
  {
    "author": "liam tobin",
    "rating": 1,
    "date": "2021-08-14T03:34:36.000Z",
    "title": "Stay away!!!!!",
    "text": "No customer service. My host left the business. Neighbor’s one and only response was to just cancel online. Still charged me then charged me $25 late fee. Can’t get a human. Can’t get an email answered. Total scam. STAY AWAY. More negative reviews than positive look for yourself."
  },
  {
    "author": "Gla",
    "rating": 1,
    "date": "2021-08-09T18:26:36.000Z",
    "title": "I'm a pretty patient person but...",
    "text": "I'm a pretty patient person, but this company does not care...at all. No one ever picks up the phone. You'll get a response after days of emailing them without a resolution, so you have to email them again and wait over a week. I'm currently waiting on a response on a time sensitive situation and it's been over a week, no one has gotten back to me. Customer service is non-existent. As long as they get their money, that is all they care about."
  },
  {
    "author": "Sam Holm",
    "rating": 1,
    "date": "2021-08-07T00:30:33.000Z",
    "title": "Had my trailer stolen from property and…",
    "text": "Had my trailer stolen from property and tarps and chains and binders were stolen off trailer. Submitted insurance claim through neighbors insurance and claim was denied. Will never trust or use neighbor again. What a joke for an insurance company."
  },
  {
    "author": "samuel",
    "rating": 1,
    "date": "2021-09-05T19:46:08.000Z",
    "title": "NEVER! NEVER! NEVER! NEVER! NEVER! NEVER! NEVER AGAIN!",
    "text": "This rating should be minus zero(-O), if there is anything like that. Neighbor.com is a scam site in collaboration with scammer hosts and fraudsters. Never you try to rent from them. They are holding my unregistered Toyota sienna 2007 with the Title since Febuary, 2021 which is for export. Neighbor.com is in collaboration with this their approved host Rhadashi Fields in this crime. They don't do background checks on their approved hosts but approve every dick and harry to defraud the public. I  moved in my unregistered vehicle in Febuary, 2021 in their approved host's address and also the Vehicle Title sent in March by fedex tracking 773102052074 so that it can be picked up by trucker to the Dundalk seaport for export. I have been trying to  move the stored items  out since march, 2021 which my trucker had been there for removal several times but failed due to the neighbor.com approved host has not be showing up to move out the stored items since March, 2021 till now. Neighbor.com are not doing anything to retrieve my stored items from the their approved host and neighbor.com doesn't answer calls and have been charging my debit card and reverse when written to them. Never you transact any rental with them or any of their host. They are scammers and fraudsters. You are warned for your own good. It will be good if we can stop them from ripping people off in anyway legally possible because more people are falling victim and they are smiling to the bank. NEVER! NEVER! NEVER! NEVER! NEVER! NEVER! This is my second review from the above 1st review. Neighbor.com sent an email to me on 9th August, 2021 after my 1st review about their collaboration in the scam and fraud saying this in the email, i quote, \"Your ticket has been escalated to Neighbor's Trust & Safety team. I gave you a call this morning, but was unable to get through to you. I would like to schedule a time for us to chat so that we can schedule a time for your vehicle to be picked up. Your host works during the day, but is willing to facilitate the removal. I reached out to him today as well. Below is a picture of the title of your vehicle, to help confirm to you that the vehicle is still safe and the host is willing to work with you. When is a good time to reach out?\" This is since 9th of August, 2021 that they sent the email by their support team Mr. Seth Christensen. He lied that he tried to get to me but that is just part of their deceit and i gave out my all known contacts again which they have with them and up till now no one has got to me for the said discussion or removal of the vehicle that i have been trying to retrieve from their approved collaborator host Rhadashi Fields. The picture Title of the vehicle was sent in the email saying that the vehicle is still available which i asked them to snap the vehicle where it is parked if still available. If the vehicle is still available and what makes their collaborator not to handover the vehicle since febuary 2021 till now. Do you know that neighbor.com has 105 staff members or collaborators but your calls won't be answered. Never you do storage with them or any of their cohorts except you have extra to spare or give out. They have to be stopped by ic3.gov and other sister agencies if you have been ripped off by them or their cohorts."
  },
  {
    "author": "Wayne Hammer Hampton",
    "rating": 1,
    "date": "2021-07-27T17:18:29.000Z",
    "title": "POOR, CHARGE MY CARD AFTER MOVING OUT!",
    "text": "My experience was very poor. First the rental space was advertised 20' x 20'garage, but was actually 10' x 20'. So I let the renter know I would stay but I would move after 1/2 price month. Because I need that amount of space as advertised. After pay 1st month 1/2 price and moving out 2day before the next month, I was charged another payment. Call & text support no answer or response, until I went through Bank proceeds for refund. Now you say that I have to continue staying there to get 1st month 1/2 price. Where does it say that anywhere. Fraud, refund me my money you took off my card after I clearly move out before the new month began. Oh yea I see you corrected the dimensions now."
  },
  {
    "author": "Nick",
    "rating": 1,
    "date": "2021-07-10T15:25:18.000Z",
    "title": "Total scam",
    "text": "The idea behind Neighbor.com is good. Yet, the execution is poor. Hosts don’t see the money for a month after the tenant moves in.  They charge hosts and tenants fees, collectively it’s about 30% of monthly rent. Imaging giving $1000 every month out of your $3000 rent to the realtor who found you a house to live in!? That’s absurd. It’s an information service, should not cost more that 3-5% monthly or 50% once off. They flood Google with their ads, so their ad will be the first one you see when searching for a parking space. But when a new tenant contacts the property, they actually think they communicate directly to the property. They have no idea there is some stupid neighbor involved. In addition, their customer service is no where to be found if the tenant or host have problems, but they will chase you like vicious dogs if you decide to cancel your space. Or if your are a host, they will abandon the trailer if the tenant stops paying. They will charge the tenant an additional month at the end, yet the host will not see those money. They keep it!?! This company is a total scam."
  },
  {
    "author": "Anthony Vestal",
    "rating": 1,
    "date": "2021-07-10T17:03:56.000Z",
    "title": "BEWARE",
    "text": "BEWARE Bad Idea Reserved means purchased. (Neighbor special lingo) I reserved a spot, never moved in and cancelled 3 days later. The fee was supposed to be like $73.00, I was fine with them keeping it, but then they charged me an additional $73.00 because I didn't rent for 2 months.  So I asked if they where re renting the space and they said I \"canceled\" ( which means moved out) in the neighbor special lingo. and have no rights to the space even though they charged me a full months rent. It's a scam and they pick and choose what words mean. support was useless contacted me a week and a half later. Yeah reserved means reserved And 3 days should be pro rated Scam I reserved another spot before this one and they cancelled after they took my money.  therefore it's not permanent till move in. I never moved in. Why not explain on the original page instead of bait and switch? I was out of town and in a position of desperation. And after the first cancellation from the renter. (So how was the first renter able to cancel?) this was the only space to put my semi. Explain that. After I looked at a space the app took back to the begining. Starting over through the listing. Frustrating You know your wrong."
  },
  {
    "author": "Anonymous Reviewer",
    "rating": 1,
    "date": "2021-07-05T23:05:01.000Z",
    "title": "Unauthorized Scheduled Payments",
    "text": "This service is a great idea, HOWEVER my personal experience has not been. PLEASE BEWARE!!! I don't believe this company has the manpower nor the systems of communication, app usability, customer service or screening processes locked in enough to provide a safe, secure, dependable service.  Here are my story's significant points that may help people who dare to use this service in the future or are considering it: #1 I needed a space to store my car for a couple months. I sent in a reservation request to a host that ultimately was \"Declined -Space Unavailable.\" My card was charged but I received a refund a few days later. HOWEVER, due to my investigations online about prior users' reviews and how Neighbor still charged user's cards after a reservation was canceled, I checked my Neighbor account today just in case. Although I never used the Space, the request was denied, and I got a refund, my Neighbor account has my debit card set to take out a \"scheduled\" $65.53 from my account for August 1, 2021!!! Really?!! Now I have to email them again and I'll get to the part about customer service and trying to reach them... #2 So, I reserved another space that was Available, the reservation was approved and my card was charged. The host didn't have their storage address on their profile. I received the address after I reserved the space. I went on Google Maps to check out the parking garage and the area it was in. Then I looked at where my car would be and I didn't feel secure leaving it there AND when I messaged my host after the reservation was approved to tell them my drop off plans and ask a question the host sent me an automated response which didn't answer my question. I ultimately did not feel secure about the reservation or my ability to communicate with the host so I canceled my reservation and received a refund a few days later. Low and behold, that is also showing up now on my Neighbor account as a \"Scheduled\" payment for $144.13 for September 1, 2021!!! Really??? Omg...so I have 2 scheduled payments on my card coming up for two spaces that I never used, were canceled and received refunds for! #3 I called their customer phone line and there is no one to speak to there, ever. I have tried several times. Good luck with that! I just had to ask them a simple question.. \"Do I have to pay a whole month's rent if I only end up using a space for a couple days out of that month? I couldn't get a hold of someone live over the phone, so I Emailed them instead. They FINALLY responded 16 days later, apologizing for their delay and promising to improve (as you will see again and again if you read the other reviews on here). They said I would have to pay rent for the whole month. #5 After my experience so far, I have to spend my time writing a review to warn other people about this mess of a business and to express to Neighbor, since this seems to be the best place to actually get a response from them in a timely manner, and to state that I MAY have to report them to the BBB if they don't resolve those \"Scheduled\" future payments, PERMANENTLY. Not only that, now I have to keep an eye on my Neighbor app to make sure they actually don't schedule even more future payments after they resolve the ones that are scheduled now! This has been a huge headache for me, has taken up so much of my time, and is causing me so much stress. #6 My final feelings are that I am never going to use this service in the future, I won't recommend it, and I am so grateful to all the other people who have taken the time to write a review because those reviews prepared me for what to expect in my experience. Thank you reviewers!! And finally, if you want security with your payments, your belongings, etc. I would NOT use Neighbor. Shell out that extra dough to make sure you don't have to worry about all this drama AND please read the rest of the reviews on here and anywhere else you can find them. You may thank yourself in the future. I know I am. Now I have to take more of my time to write them another email with screenshots and wait for them to resolve these scheduled payments, which will probably take another 16 DAYS or more like the last time I emailed them. AND!!! My headache won't be over. I will still have to check back in to my app to make sure that they resolved scheduled payments permanently. Extremely unpleasant,  stressful experience! Today I should be sitting in the sun enjoying the 4th of July weekend, yet here I am writing this review. Totally disappointing."
  },
  {
    "author": "David Blake",
    "rating": 5,
    "date": "2025-10-03T01:29:27.000Z",
    "title": null,
    "text": "My classic '74 MGB roadster was kept dry and in fine shape for nearly two years during my house remodel.  When I drove it home, it started right up and Shalbindra filled the tires to the proper pressu..."
  },
  {
    "author": "Charles Christiansen",
    "rating": 5,
    "date": "2025-09-23T21:16:57.000Z",
    "title": null,
    "text": "Ease of use of the app, money saving over traditional storage facilities. Have used this app for two different reservations over the last couple years and have found everything to be above board would..."
  },
  {
    "author": "CHARLES H",
    "rating": 4,
    "date": "2025-09-17T07:45:13.000Z",
    "title": null,
    "text": "Finding a parking spot for our RV was easy with Neighbor. Martin helped locate the location and helped me with the process. Jason, the host, was easy to work with and easy to communicate with as well...."
  },
  {
    "author": "Fabio",
    "rating": 5,
    "date": "2025-08-11T18:52:33.000Z",
    "title": null,
    "text": "I needed a long term parking spot and aside from having multiple options right off the bat all within 2 miles of my house, I got put in contact with the host within hours and I had secure the spot by..."
  },
  {
    "author": "Janet Desmarais",
    "rating": 5,
    "date": "2025-10-03T21:57:36.000Z",
    "title": null,
    "text": "Best safe space ever. Extended stay. Lighted gated area. Great communication. Would highly recommend."
  },
  {
    "author": "Paul",
    "rating": 5,
    "date": "2025-08-24T00:03:38.000Z",
    "title": null,
    "text": "Great experience, highly secure note on site security with multiple gated locks.  Location is in the mangroves so buggy at times bed price around. I will use this facility again next year."
  },
  {
    "author": "Elise",
    "rating": 5,
    "date": "2025-10-02T20:30:12.000Z",
    "title": null,
    "text": "The space is very private behind a fence. It is easy to access, and the host is quick to respond when coordinating drop off and pick up."
  },
  {
    "author": "William Wallace",
    "rating": 3,
    "date": "2025-09-18T01:19:02.000Z",
    "title": null,
    "text": "For the most part its been good, once its up and running it takes very little maintenance.  However some new options have led to issues, for example rhe automatic approval feature. Renter had a 40 foo..."
  },
  {
    "author": "Tommy Shields",
    "rating": 5,
    "date": "2025-07-17T21:56:54.000Z",
    "title": null,
    "text": "The place is setup rather well. Easy to pull in and maneuver your camper into its assigned parking spot. Location is very convenient from 275. The owner was on top of setting me up with access and liv..."
  },
  {
    "author": "DD",
    "rating": 4,
    "date": "2024-11-04T21:08:00.000Z",
    "title": null,
    "text": "Neighbor was GREAT income, I'm going to begin using it again soon! THE customer services really protected me when a fraudulent client wanted to get $ out of me to pay for towing fees for a vehicle t..."
  },
  {
    "author": "Irene Glazer",
    "rating": 3,
    "date": "2025-09-15T06:40:09.000Z",
    "title": null,
    "text": "Would be much better if you prorated the service as I ended up spending more than I needed to because I didn’t need the whole rest of the month."
  },
  {
    "author": "Diane B",
    "rating": 5,
    "date": "2025-06-02T04:10:18.000Z",
    "title": null,
    "text": "Neighbor was an excellent company to deal with. They were very professional, honest, and trustworthy! There were no hidden fees, the host I eventually chose is amazing. Both the company, and the host,..."
  },
  {
    "author": "Mari",
    "rating": 5,
    "date": "2024-11-04T23:17:15.000Z",
    "title": null,
    "text": "The renter I have now is GREAT. Very nice guy. Very respectful. I would definitely recommend the app. Just make sure you do not give out your number. Better to keep any convo in the app because honest..."
  },
  {
    "author": "Deana A.",
    "rating": 5,
    "date": "2025-07-17T22:39:24.000Z",
    "title": null,
    "text": "Neighbor was such a great help to our family when we needed emergency storage fast!  We rented from Mr. Raghav who replied quickly and allowed us to rent his space.  No problems and he even allowed us..."
  },
  {
    "author": "Parke Blair",
    "rating": 5,
    "date": "2025-07-04T06:24:46.000Z",
    "title": null,
    "text": "I have several Cars, including an incredibly rare BMW Convertible that I needed a place to park in between moves/Homes while staying at AIRBNB's in between.\nIncredibly reasonable price, close proximi..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-05T23:23:08.000Z",
    "title": null,
    "text": "Neighbor offered options outside the standard mass storage facilities, and though hesitant at first, everything has gone smoothly and I was able to find a fantastic host in a good, safe and close-by l..."
  },
  {
    "author": "Red Dog",
    "rating": 5,
    "date": "2025-08-11T19:48:57.000Z",
    "title": null,
    "text": "We needed 2 53’ trailer spots immediately. Neighbor had the ideal location and at a very good price.  We were booked within minutes and the spaces were immediately available.  It’s hard to find places..."
  },
  {
    "author": "jen faux",
    "rating": 5,
    "date": "2025-06-13T21:26:22.000Z",
    "title": null,
    "text": "I had reached out to Bryce, last minute, and he was very accommodating. He also provided any and all pertinent information necessary to store our trailer. The lot itself is quite sizable with plenty o..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-10T19:47:40.000Z",
    "title": null,
    "text": "Jenna's spot was perfect for my temporary needs; easy access, decent price, and she kept an eye on things. I would recommend her for your outdoor vehicle storage needs. Thanks!"
  },
  {
    "author": "Matt Passios",
    "rating": 5,
    "date": "2025-09-21T23:37:31.000Z",
    "title": null,
    "text": "Good communication and great service. Just overall a really nice guy and will make sure whatever you keep parked there is safe."
  },
  {
    "author": "Allison Stokes",
    "rating": 5,
    "date": "2025-07-30T17:53:04.000Z",
    "title": null,
    "text": "Standard storage space for car while I was dealing with insurance post-accident. However, Jimmy was responsive and helpful when I needed to access the space and when I needed to have the car brought i..."
  },
  {
    "author": "Sofia",
    "rating": 5,
    "date": "2025-09-22T21:45:41.000Z",
    "title": null,
    "text": "This app worked well for me! I personally didn’t need to pay for the apps insurance is my only response, but other spots it may be a good call."
  },
  {
    "author": "Tiffany N",
    "rating": 5,
    "date": "2025-09-25T01:58:49.000Z",
    "title": null,
    "text": "Easy, quick communication from host, perfect spot to store my vehicle, well priced."
  },
  {
    "author": "DJ",
    "rating": 5,
    "date": "2025-08-15T22:49:07.000Z",
    "title": null,
    "text": "Easy transaction, good variety of places in the area that met all our needs. Seemless, stress-free long-term parking for our family vehicle."
  },
  {
    "author": "Holly",
    "rating": 5,
    "date": "2025-07-29T18:59:26.000Z",
    "title": null,
    "text": "Tisha has great rental spaces, we have had to move in and out a few times over the years and she is so nice and understanding when plans change. Always an easy move in, and move out experience"
  },
  {
    "author": "Matthew Plude",
    "rating": 5,
    "date": "2025-09-16T16:57:27.000Z",
    "title": null,
    "text": "Amazing host and beautiful property. Could not ask for a better place to store our RV. Highly recommend."
  },
  {
    "author": "Cyndi Gant",
    "rating": 4,
    "date": "2025-08-10T15:43:43.000Z",
    "title": null,
    "text": "Pretty easy to use. Messaging with potential renters is good. Only challenge I had was listing my garage. It seemed nothing met their criteria"
  },
  {
    "author": "Fatima Jones",
    "rating": 5,
    "date": "2025-08-18T13:51:29.000Z",
    "title": null,
    "text": "The space worked out for a while but then the town of where I rented from told host we would have to move our vehicle witch was fustrating"
  },
  {
    "author": "Scott Odenbrett",
    "rating": 5,
    "date": "2025-08-31T19:07:36.000Z",
    "title": null,
    "text": "I've used neighbor twice and have had great experiences both times.  It's easy to get started and when it's time to move on, it's easy to cancel."
  },
  {
    "author": "Mark Watson",
    "rating": 5,
    "date": "2025-09-04T01:27:26.000Z",
    "title": null,
    "text": "This is a great place to store a boat. It was easy access and I felt my boat was safe and secure while stored here. I stored my boat here for about 8 months and never had any issues and happily give a..."
  },
  {
    "author": "Clayton Lerch",
    "rating": 5,
    "date": "2025-09-17T19:06:55.000Z",
    "title": null,
    "text": "Great affordable rental space but i found a space a block from my house. I would recommend to anyone."
  },
  {
    "author": "Keith Stone",
    "rating": 5,
    "date": "2025-09-22T06:19:17.000Z",
    "title": null,
    "text": "Great host! Very flexible ! Awesome space, super easy  in and out! Security gate"
  },
  {
    "author": "Alex h",
    "rating": 5,
    "date": "2025-09-13T15:54:43.000Z",
    "title": null,
    "text": "Fantastic experience with Neighbor and my host. I would highly recommend and would use again in the future."
  },
  {
    "author": "Curt Wood",
    "rating": 5,
    "date": "2025-08-30T03:43:40.000Z",
    "title": null,
    "text": "Easy to access, plenty of room, clean space.  Worked out perfectly so I could store a vehicle while I needed the space in my personal garage."
  },
  {
    "author": "Michael C",
    "rating": 5,
    "date": "2025-09-26T02:41:58.000Z",
    "title": null,
    "text": "Great communication, and a nice out-of-view location with easy access.  I highly recommend Mark!"
  },
  {
    "author": "Matthew Spadoni",
    "rating": 5,
    "date": "2025-10-02T19:31:06.000Z",
    "title": null,
    "text": "Fernando was a great host. I will be back next spring when boat season resumes!"
  },
  {
    "author": "Ez",
    "rating": 5,
    "date": "2025-09-28T15:27:50.000Z",
    "title": null,
    "text": "This was much more affordable and convenient than traditional storage spaces. The host was extra communicative also."
  },
  {
    "author": "IllWill",
    "rating": 5,
    "date": "2025-10-01T14:59:44.000Z",
    "title": null,
    "text": "This helped me tremendously with my car that broke down"
  },
  {
    "author": "Tony Roberts",
    "rating": 5,
    "date": "2025-10-01T17:56:35.000Z",
    "title": null,
    "text": "Lots of space. Always accessible."
  },
  {
    "author": "Janeth Hernandez",
    "rating": 5,
    "date": "2025-09-23T14:29:47.000Z",
    "title": null,
    "text": "Jeff was great! Accommodated my needs at the last minute. Thank you Jeff!"
  },
  {
    "author": "Richard R.",
    "rating": 5,
    "date": "2025-10-01T00:53:21.000Z",
    "title": null,
    "text": "Good overall experience.  No issues. Huge and safe location."
  },
  {
    "author": "anthony",
    "rating": 5,
    "date": "2025-09-30T17:02:16.000Z",
    "title": null,
    "text": "Very responsive. Easy drop off"
  },
  {
    "author": "M Walker",
    "rating": 5,
    "date": "2025-09-26T19:01:43.000Z",
    "title": null,
    "text": "Trobi is a Great Host! Her property can host most Anything with Wheels."
  },
  {
    "author": "Jason & Stephanie Patterson",
    "rating": 5,
    "date": "2025-03-20T01:11:48.000Z",
    "title": null,
    "text": "Going on my third full year of being a host.  Had a couple of issues with renters and neighbor did as promised and rectified my issues each time.  April in the trust and safety department and Marcos t..."
  },
  {
    "author": "Becca Matta",
    "rating": 5,
    "date": "2025-05-05T22:48:25.000Z",
    "title": null,
    "text": "**Highly recommend renting this spot!** I used J's parking spot as long-term storage for my car while I traveled abroad for a few months and it was a really great experience! J was super responsive an..."
  },
  {
    "author": "Tiffany Phillips",
    "rating": 5,
    "date": "2025-04-13T12:15:24.000Z",
    "title": null,
    "text": "Kevin and Lee are phenomenal hosts. Their prompt responses helped make my mind up of which facility I chose. They are kind and professional and their facility has cameras and a swamp cooler which mad..."
  },
  {
    "author": "Ely Souza",
    "rating": 5,
    "date": "2025-08-08T10:23:10.000Z",
    "title": null,
    "text": "Great experience was able to find a place to park our trailer within just a few minutes saved us hundreds of dollars love this app"
  },
  {
    "author": "Subbu boy",
    "rating": 5,
    "date": "2025-07-26T18:42:08.000Z",
    "title": null,
    "text": "Great experience! The host was very responsive and made communication easy throughout the booking. The pickup and drop-off location was convenient and easy to find. Everything went smoothly—highly rec..."
  },
  {
    "author": "Will Mak",
    "rating": 5,
    "date": "2025-05-28T02:51:10.000Z",
    "title": null,
    "text": "⭐️⭐️⭐️⭐️⭐️ Outstanding Service – Highly Recommend!\n\nKimberly made the entire vehicle storage process incredibly smooth from start to finish. What could’ve been confusing and time-consuming turned ou..."
  },
  {
    "author": "Kimberly Thorne",
    "rating": 1,
    "date": "2021-06-25T02:03:59.000Z",
    "title": "Bad experience",
    "text": "The service seems amazing, but not my experience. The host of finally got a hold of me, I went and looked at the space and meant the host, went to get my RV and the host texted me saying their landlord wouldn't allow it and cancelled. I'm still trying to get a hold of customer service and get my money back. 😐"
  },
  {
    "author": "Andy Frederique",
    "rating": 1,
    "date": "2021-06-23T20:30:29.000Z",
    "title": "WARNING!!! TERRIBLE SITE THAT STEALS YOUR MONEY",
    "text": "I went through Neighbor.com seeking storage for my work van that was pending repair. After making the initial payment for the month and storing my vehicle, the vehicle was towed by the host just 4 days into the reservation with no reasoning and no notice. My vehicle was at a tow yard accruing fees for an entire month while it was suppose to be safely stored, which ended up costing me over $1,000. The host nor neighbor took any responsibility and have failed to respond to any of my calls or emails sent to resolve the matter. Currently in process of filing a civil suit in small claims for breach of contract agreement. STAY AWAY FROM USING THIS SITE AS YOUR ITEM WON'T BE SAFELY STORED"
  },
  {
    "author": "Julia Getz",
    "rating": 1,
    "date": "2021-06-23T18:19:29.000Z",
    "title": "Neighbor and those who use it are…",
    "text": "Neighbor and those who use it are completely unreliable. The space I rented was a fraud, and I’ve been trying to contact neighbor for 3 weeks trying to let them know to remove the fraud and provide me reimbursement. It’s been an extremely disappointing experience. I would give it 0 stars if I could."
  },
  {
    "author": "Keyvan Ashkan",
    "rating": 1,
    "date": "2021-06-22T02:36:18.000Z",
    "title": "Not satisfied",
    "text": "June 22, 2021 Unprompted review"
  },
  {
    "author": "Stephanie DiBello",
    "rating": 1,
    "date": "2021-06-21T13:32:47.000Z",
    "title": "Recurring unauthorized paments",
    "text": "Terrible! Do not book with Neighbor. They have been charging my credit card on a recurring basis for months, even though I’m no longer using the service. Neighbor support is completely unresponsive by phone and email). My host and I have contacted them at least 20 times over the past 2 months with no response. I’ve disputed the payments with my bank as unauthorized and am now hoping that I can get a refund this way. Save your time, money and energy and go elsewhere. Neighbor, if you’re reading this please do not tell me to contact support since I’ve already tried for the past two months. Just read your inbox, issue my refunds and contact me!"
  },
  {
    "author": "TR",
    "rating": 1,
    "date": "2021-06-11T20:04:51.000Z",
    "title": "Horrible company..",
    "text": "Horrible company... even worse host... do not do business with this scam joke of a website... host never responded  perhaps doesn't even exist"
  },
  {
    "author": "Terrence Arth",
    "rating": 1,
    "date": "2021-06-05T16:32:22.000Z",
    "title": "HORRIBLE EXPERIENCE",
    "text": "HORRIBLE EXPERIENCE!  You can't ask questions BEFORE making a reservation (no response from hosts) so the option is to reserve, defined as PAY.  I immediately got a reserved & paid reply.  Minutes later the host texts and says there is no space available, do not come!  No one at Neighbor answers the phone, no one at neighbor responds to emails.  The hosts are just as bad.  It was such a great idea, but the service is SOOO bad, it borders on a SCAM!"
  },
  {
    "author": "Larry C",
    "rating": 1,
    "date": "2021-06-19T18:14:45.000Z",
    "title": "Unauthorized credit card charges",
    "text": "Without my authorization they’ve charged my credit card twice, though I never agreed to rent the unit. I simply asked if it was available. This issue has been solved with the best customer service I've experienced in a long time. Thank you all!"
  },
  {
    "author": "JAY GOMEZ",
    "rating": 1,
    "date": "2021-06-03T22:46:30.000Z",
    "title": "This site is a TOTAL SCAM!!!!",
    "text": "This site is a TOTAL SCAM!!!!! PLEASE DO NOT TRANSACT WITH THIS SITE!!!!!!!"
  },
  {
    "author": "Chris Grosskoph",
    "rating": 1,
    "date": "2021-06-03T21:53:21.000Z",
    "title": "The area garage that I rented wasn't…fake and never for rent!",
    "text": "The area garage that I rented wasn't even for rent. I could never get ahold of anyone at Neighbor for over 2 weeks when they finally sent back my depots after leaving a message that I was going to calling BBB and my credit card that it was a fraud. Then they finally sent my refund. would not us ever again."
  },
  {
    "author": "Jo Jones",
    "rating": 1,
    "date": "2021-05-29T02:51:58.000Z",
    "title": "If I could leave Negative stars I would!!!",
    "text": "Do Not Use Neighbor.com!!! They have ABSOLUTELY NO Guidelines or rules as to what can be posted. Completely Illegitimate and Illegal locations being posted for locations to be rented as storage spaces. Addresses that do not exist. Public property that Can Not be be legally rented out, nor can any items be stored on public property for an extended  period  of time per city code. Yet they will happily  take your money before they will give you the location or address... That is when you find out that the address is not real or is on public property. ALSO, you will NEVER EVER, EVER, Hear from the Individual that you supposedly are renting this area from, regardless of how many times you attempt  to contact them. It is nothing more than many Headaches!!! Don't waste your time!!"
  },
  {
    "author": "Bruce Whisnant",
    "rating": 1,
    "date": "2021-05-27T16:49:15.000Z",
    "title": "Very bad experience...",
    "text": "My reservation was approved and my credit card charged. The host never got back to me with a full address, access or contact info. Two e-mails and one phone call to Neighbor.com went unanswered leaving me with the impression that the whole thing was a scam. 3 weeks wasted and I now need to contact the credit card company to report it."
  },
  {
    "author": "Nikki Laney",
    "rating": 1,
    "date": "2021-05-19T23:15:45.000Z",
    "title": "It's a month later still NO REFUND I…",
    "text": "It's a month later still NO REFUND I been going back and forth with them... NO REFUNDS!! FRAUD!!!! They do not even honor THIER OWN REFUND POLICY!!! STAY AWAY... nothing but a scam"
  },
  {
    "author": "Jeff Baxter",
    "rating": 1,
    "date": "2021-05-17T14:30:39.000Z",
    "title": "Please do not use this website",
    "text": "Please do not use this website. I booked a rental to store my car and never heard back from the host. I tried emailing and calling neighbor.com and they never got back to me or answered the phone. I ended up going to another local company on the day before I moved. Stay away from this place."
  },
  {
    "author": "Scott Levy",
    "rating": 1,
    "date": "2021-05-12T19:45:34.000Z",
    "title": "Neighbor . Com = 0 customer service",
    "text": "I contacted neighbor.com to rent out a space I don’t use I successfully signed up and immediately received possible renters contacting me.  I received an e Mail saying they rented out the spot for a certain. Dollar amount but made the deal with the renter before contacting me it would be proper to have some day as to who is renting and what they are placing in my yard and when it would happen.  It’s not the right Y to treat your users and making it worse is that after repeated attempts they have not once returned my email or repeated calls as I have made many attempts, absolutely no customer service.  Don’t even sign up for this because you have no say about what they put on your property!!!"
  },
  {
    "author": "Nikki Laney",
    "rating": 1,
    "date": "2021-05-12T17:22:47.000Z",
    "title": "FRAUD ALERT!!!!!!!!@@$$$",
    "text": "I have been going back and forth over $110 with this wicked company. They are predatory towards renters. SAVE YOUR MONEY....TIME AND EFFORT. most of these \"Hosts\" aren't even real they just want you to reserve and pay regardless if the property is available or not.... THEN.... THEY KEEP YOUR MONEY when You or the \"Host\" cancels your reservation ... this company is Devilish"
  },
  {
    "author": "Nikki Laney",
    "rating": 1,
    "date": "2021-05-08T20:35:18.000Z",
    "title": "I've been trying to get a Refund from 2…",
    "text": "I've been trying to get a Refund from 2 separate units since last month.... NEVER received a refund....nobody answers the phone, email or text but they will act concerned HERE but will do absolutely NOTHING. They take your money without any services... STAY AWAY!!!"
  },
  {
    "author": "JoAnn Schultz",
    "rating": 1,
    "date": "2021-05-01T01:49:55.000Z",
    "title": "Abandoned house & zero response",
    "text": "I contacted my host 24 hours in advance to coordinate a move in time. No response. I left a voicemail and sent an email to customer service. No response. So I went to the hosts address on move-in day. No one was there. The house looked abandoned. I sent more emails and voicemails to customer service. No response. If they took my deposit, then I want it back. Worst service ever. Buyer beware."
  },
  {
    "author": "T E",
    "rating": 1,
    "date": "2021-04-26T14:25:06.000Z",
    "title": "Just Terrible",
    "text": "I signed up for storage on Neighbors.  It was even a \"Instantly Verified Guaranteed\" listing.  I was 100%  depending on this storage as I am new to the area and have more vehicles than can be stored on my property.  After paying and not hearing from the owner I asked a real neighbor if I could use their driveway as an emergency.  I waited for my rented space owner to contact me and was not contacted an messages ignored.  I then messaged that I was going to move something to my spot and sure enough the owner then quickly replied but claimed he did not \"finish\" signing up to rent the space through Neighbors and he did not know how Neighbors got his info.  Likely story.  Meanwhile you CANNOT CONTACT LIVE SUPPORT ON NEIGHBORS.  Their customer service number drops your call and makes you email them, when you email them they take forever to reply, not the same day.  So I was left with no answers, no support, my boat in someone else's driveway with no place to store it.  On the Gulf of Mexico where there not no affordable options.  When Neighbors support finally replied they were useless and offered no explanation or support."
  },
  {
    "author": "Nikki Laney",
    "rating": 1,
    "date": "2021-04-21T17:32:40.000Z",
    "title": "Outdated listing....they will take your…",
    "text": "Outdated listing....they will take your money with a receipt and then the host will tell you it's no longer available"
  },
  {
    "author": "David Blake",
    "rating": 5,
    "date": "2025-10-03T01:29:27.000Z",
    "title": null,
    "text": "My classic '74 MGB roadster was kept dry and in fine shape for nearly two years during my house remodel.  When I drove it home, it started right up and Shalbindra filled the tires to the proper pressu..."
  },
  {
    "author": "Charles Christiansen",
    "rating": 5,
    "date": "2025-09-23T21:16:57.000Z",
    "title": null,
    "text": "Ease of use of the app, money saving over traditional storage facilities. Have used this app for two different reservations over the last couple years and have found everything to be above board would..."
  },
  {
    "author": "CHARLES H",
    "rating": 4,
    "date": "2025-09-17T07:45:13.000Z",
    "title": null,
    "text": "Finding a parking spot for our RV was easy with Neighbor. Martin helped locate the location and helped me with the process. Jason, the host, was easy to work with and easy to communicate with as well...."
  },
  {
    "author": "Fabio",
    "rating": 5,
    "date": "2025-08-11T18:52:33.000Z",
    "title": null,
    "text": "I needed a long term parking spot and aside from having multiple options right off the bat all within 2 miles of my house, I got put in contact with the host within hours and I had secure the spot by..."
  },
  {
    "author": "Janet Desmarais",
    "rating": 5,
    "date": "2025-10-03T21:57:36.000Z",
    "title": null,
    "text": "Best safe space ever. Extended stay. Lighted gated area. Great communication. Would highly recommend."
  },
  {
    "author": "Paul",
    "rating": 5,
    "date": "2025-08-24T00:03:38.000Z",
    "title": null,
    "text": "Great experience, highly secure note on site security with multiple gated locks.  Location is in the mangroves so buggy at times bed price around. I will use this facility again next year."
  },
  {
    "author": "Elise",
    "rating": 5,
    "date": "2025-10-02T20:30:12.000Z",
    "title": null,
    "text": "The space is very private behind a fence. It is easy to access, and the host is quick to respond when coordinating drop off and pick up."
  },
  {
    "author": "William Wallace",
    "rating": 3,
    "date": "2025-09-18T01:19:02.000Z",
    "title": null,
    "text": "For the most part its been good, once its up and running it takes very little maintenance.  However some new options have led to issues, for example rhe automatic approval feature. Renter had a 40 foo..."
  },
  {
    "author": "Tommy Shields",
    "rating": 5,
    "date": "2025-07-17T21:56:54.000Z",
    "title": null,
    "text": "The place is setup rather well. Easy to pull in and maneuver your camper into its assigned parking spot. Location is very convenient from 275. The owner was on top of setting me up with access and liv..."
  },
  {
    "author": "DD",
    "rating": 4,
    "date": "2024-11-04T21:08:00.000Z",
    "title": null,
    "text": "Neighbor was GREAT income, I'm going to begin using it again soon! THE customer services really protected me when a fraudulent client wanted to get $ out of me to pay for towing fees for a vehicle t..."
  },
  {
    "author": "Irene Glazer",
    "rating": 3,
    "date": "2025-09-15T06:40:09.000Z",
    "title": null,
    "text": "Would be much better if you prorated the service as I ended up spending more than I needed to because I didn’t need the whole rest of the month."
  },
  {
    "author": "Diane B",
    "rating": 5,
    "date": "2025-06-02T04:10:18.000Z",
    "title": null,
    "text": "Neighbor was an excellent company to deal with. They were very professional, honest, and trustworthy! There were no hidden fees, the host I eventually chose is amazing. Both the company, and the host,..."
  },
  {
    "author": "Mari",
    "rating": 5,
    "date": "2024-11-04T23:17:15.000Z",
    "title": null,
    "text": "The renter I have now is GREAT. Very nice guy. Very respectful. I would definitely recommend the app. Just make sure you do not give out your number. Better to keep any convo in the app because honest..."
  },
  {
    "author": "Deana A.",
    "rating": 5,
    "date": "2025-07-17T22:39:24.000Z",
    "title": null,
    "text": "Neighbor was such a great help to our family when we needed emergency storage fast!  We rented from Mr. Raghav who replied quickly and allowed us to rent his space.  No problems and he even allowed us..."
  },
  {
    "author": "Parke Blair",
    "rating": 5,
    "date": "2025-07-04T06:24:46.000Z",
    "title": null,
    "text": "I have several Cars, including an incredibly rare BMW Convertible that I needed a place to park in between moves/Homes while staying at AIRBNB's in between.\nIncredibly reasonable price, close proximi..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-05T23:23:08.000Z",
    "title": null,
    "text": "Neighbor offered options outside the standard mass storage facilities, and though hesitant at first, everything has gone smoothly and I was able to find a fantastic host in a good, safe and close-by l..."
  },
  {
    "author": "Red Dog",
    "rating": 5,
    "date": "2025-08-11T19:48:57.000Z",
    "title": null,
    "text": "We needed 2 53’ trailer spots immediately. Neighbor had the ideal location and at a very good price.  We were booked within minutes and the spaces were immediately available.  It’s hard to find places..."
  },
  {
    "author": "jen faux",
    "rating": 5,
    "date": "2025-06-13T21:26:22.000Z",
    "title": null,
    "text": "I had reached out to Bryce, last minute, and he was very accommodating. He also provided any and all pertinent information necessary to store our trailer. The lot itself is quite sizable with plenty o..."
  },
  {
    "author": "Randy",
    "rating": 5,
    "date": "2025-08-10T19:47:40.000Z",
    "title": null,
    "text": "Jenna's spot was perfect for my temporary needs; easy access, decent price, and she kept an eye on things. I would recommend her for your outdoor vehicle storage needs. Thanks!"
  },
  {
    "author": "Matt Passios",
    "rating": 5,
    "date": "2025-09-21T23:37:31.000Z",
    "title": null,
    "text": "Good communication and great service. Just overall a really nice guy and will make sure whatever you keep parked there is safe."
  },
  {
    "author": "Allison Stokes",
    "rating": 5,
    "date": "2025-07-30T17:53:04.000Z",
    "title": null,
    "text": "Standard storage space for car while I was dealing with insurance post-accident. However, Jimmy was responsive and helpful when I needed to access the space and when I needed to have the car brought i..."
  },
  {
    "author": "Sofia",
    "rating": 5,
    "date": "2025-09-22T21:45:41.000Z",
    "title": null,
    "text": "This app worked well for me! I personally didn’t need to pay for the apps insurance is my only response, but other spots it may be a good call."
  },
  {
    "author": "Tiffany N",
    "rating": 5,
    "date": "2025-09-25T01:58:49.000Z",
    "title": null,
    "text": "Easy, quick communication from host, perfect spot to store my vehicle, well priced."
  },
  {
    "author": "DJ",
    "rating": 5,
    "date": "2025-08-15T22:49:07.000Z",
    "title": null,
    "text": "Easy transaction, good variety of places in the area that met all our needs. Seemless, stress-free long-term parking for our family vehicle."
  },
  {
    "author": "Holly",
    "rating": 5,
    "date": "2025-07-29T18:59:26.000Z",
    "title": null,
    "text": "Tisha has great rental spaces, we have had to move in and out a few times over the years and she is so nice and understanding when plans change. Always an easy move in, and move out experience"
  },
  {
    "author": "Matthew Plude",
    "rating": 5,
    "date": "2025-09-16T16:57:27.000Z",
    "title": null,
    "text": "Amazing host and beautiful property. Could not ask for a better place to store our RV. Highly recommend."
  },
  {
    "author": "Cyndi Gant",
    "rating": 4,
    "date": "2025-08-10T15:43:43.000Z",
    "title": null,
    "text": "Pretty easy to use. Messaging with potential renters is good. Only challenge I had was listing my garage. It seemed nothing met their criteria"
  },
  {
    "author": "Fatima Jones",
    "rating": 5,
    "date": "2025-08-18T13:51:29.000Z",
    "title": null,
    "text": "The space worked out for a while but then the town of where I rented from told host we would have to move our vehicle witch was fustrating"
  },
  {
    "author": "Scott Odenbrett",
    "rating": 5,
    "date": "2025-08-31T19:07:36.000Z",
    "title": null,
    "text": "I've used neighbor twice and have had great experiences both times.  It's easy to get started and when it's time to move on, it's easy to cancel."
  },
  {
    "author": "Mark Watson",
    "rating": 5,
    "date": "2025-09-04T01:27:26.000Z",
    "title": null,
    "text": "This is a great place to store a boat. It was easy access and I felt my boat was safe and secure while stored here. I stored my boat here for about 8 months and never had any issues and happily give a..."
  },
  {
    "author": "Clayton Lerch",
    "rating": 5,
    "date": "2025-09-17T19:06:55.000Z",
    "title": null,
    "text": "Great affordable rental space but i found a space a block from my house. I would recommend to anyone."
  },
  {
    "author": "Keith Stone",
    "rating": 5,
    "date": "2025-09-22T06:19:17.000Z",
    "title": null,
    "text": "Great host! Very flexible ! Awesome space, super easy  in and out! Security gate"
  },
  {
    "author": "Alex h",
    "rating": 5,
    "date": "2025-09-13T15:54:43.000Z",
    "title": null,
    "text": "Fantastic experience with Neighbor and my host. I would highly recommend and would use again in the future."
  },
  {
    "author": "Curt Wood",
    "rating": 5,
    "date": "2025-08-30T03:43:40.000Z",
    "title": null,
    "text": "Easy to access, plenty of room, clean space.  Worked out perfectly so I could store a vehicle while I needed the space in my personal garage."
  },
  {
    "author": "Michael C",
    "rating": 5,
    "date": "2025-09-26T02:41:58.000Z",
    "title": null,
    "text": "Great communication, and a nice out-of-view location with easy access.  I highly recommend Mark!"
  },
  {
    "author": "Matthew Spadoni",
    "rating": 5,
    "date": "2025-10-02T19:31:06.000Z",
    "title": null,
    "text": "Fernando was a great host. I will be back next spring when boat season resumes!"
  },
  {
    "author": "Ez",
    "rating": 5,
    "date": "2025-09-28T15:27:50.000Z",
    "title": null,
    "text": "This was much more affordable and convenient than traditional storage spaces. The host was extra communicative also."
  },
  {
    "author": "IllWill",
    "rating": 5,
    "date": "2025-10-01T14:59:44.000Z",
    "title": null,
    "text": "This helped me tremendously with my car that broke down"
  },
  {
    "author": "Tony Roberts",
    "rating": 5,
    "date": "2025-10-01T17:56:35.000Z",
    "title": null,
    "text": "Lots of space. Always accessible."
  },
  {
    "author": "Janeth Hernandez",
    "rating": 5,
    "date": "2025-09-23T14:29:47.000Z",
    "title": null,
    "text": "Jeff was great! Accommodated my needs at the last minute. Thank you Jeff!"
  },
  {
    "author": "Richard R.",
    "rating": 5,
    "date": "2025-10-01T00:53:21.000Z",
    "title": null,
    "text": "Good overall experience.  No issues. Huge and safe location."
  },
  {
    "author": "anthony",
    "rating": 5,
    "date": "2025-09-30T17:02:16.000Z",
    "title": null,
    "text": "Very responsive. Easy drop off"
  },
  {
    "author": "M Walker",
    "rating": 5,
    "date": "2025-09-26T19:01:43.000Z",
    "title": null,
    "text": "Trobi is a Great Host! Her property can host most Anything with Wheels."
  },
  {
    "author": "Jason & Stephanie Patterson",
    "rating": 5,
    "date": "2025-03-20T01:11:48.000Z",
    "title": null,
    "text": "Going on my third full year of being a host.  Had a couple of issues with renters and neighbor did as promised and rectified my issues each time.  April in the trust and safety department and Marcos t..."
  },
  {
    "author": "Becca Matta",
    "rating": 5,
    "date": "2025-05-05T22:48:25.000Z",
    "title": null,
    "text": "**Highly recommend renting this spot!** I used J's parking spot as long-term storage for my car while I traveled abroad for a few months and it was a really great experience! J was super responsive an..."
  },
  {
    "author": "Tiffany Phillips",
    "rating": 5,
    "date": "2025-04-13T12:15:24.000Z",
    "title": null,
    "text": "Kevin and Lee are phenomenal hosts. Their prompt responses helped make my mind up of which facility I chose. They are kind and professional and their facility has cameras and a swamp cooler which mad..."
  },
  {
    "author": "Ely Souza",
    "rating": 5,
    "date": "2025-08-08T10:23:10.000Z",
    "title": null,
    "text": "Great experience was able to find a place to park our trailer within just a few minutes saved us hundreds of dollars love this app"
  },
  {
    "author": "Subbu boy",
    "rating": 5,
    "date": "2025-07-26T18:42:08.000Z",
    "title": null,
    "text": "Great experience! The host was very responsive and made communication easy throughout the booking. The pickup and drop-off location was convenient and easy to find. Everything went smoothly—highly rec..."
  },
  {
    "author": "Will Mak",
    "rating": 5,
    "date": "2025-05-28T02:51:10.000Z",
    "title": null,
    "text": "⭐️⭐️⭐️⭐️⭐️ Outstanding Service – Highly Recommend!\n\nKimberly made the entire vehicle storage process incredibly smooth from start to finish. What could’ve been confusing and time-consuming turned ou..."
  },
  {
    "author": "Don Summers",
    "rating": 1,
    "date": "2021-04-18T14:13:34.000Z",
    "title": "A totally useless app!!!",
    "text": "I tried 4 times to rent a space in Phoenix, AZ to store a car, all 4 were unresponsive after 36 hours! I understand people are busy but if you sign up to provide service then provide those services or delete your ad. I would give zero stars if possible, I tried to call neighbor.com and after 5 minutes on hold, they tell me there is no one to answer my call( it done during their listed business hours , mid day). A completely useless app!!!"
  },
  {
    "author": "Jacob",
    "rating": 1,
    "date": "2021-05-06T04:11:45.000Z",
    "title": "It was fraud!!!",
    "text": "It was fraud! Someone just posted an address on Neighbor so I could store my rv. Once I pulled up totally different people asked me to move because they had never heard of neighbor. And besides the AUTOREPLIES from neighbor support I've heard nothing. I would be very surprised if I am remitted the first month deposit. EDIT: After this review I was refunded my deposit very quickly by Neighbor.com."
  },
  {
    "author": "Josy",
    "rating": 1,
    "date": "2021-03-30T20:37:15.000Z",
    "title": "YOU DO NOT REALLY HAVE A RESERVATION IT IS A LIE.",
    "text": "Neighbor charged my credit card, the host message that my space was confirmed... THEN I get text from Karen F. in Salt Lake City, that my reservation is cancelled.  Neighbor said  and I quote \"Host has the right to cancel anytime before you show up\"  This is not a sustainable business model.  Rent a hotel room, and show up to sleep in it and they can cancel room one minute before you arrive if they get better offer?   BEWARE YOU ARE RESERVING NOTHING!!!!!!!"
  },
  {
    "author": "Lisa B.",
    "rating": 1,
    "date": "2021-03-26T23:45:46.000Z",
    "title": "Scammed and can't get in touch with chat",
    "text": "My experience with neighbor.com has been a nightmare!! I was so excited to use the storage. I was buying the trailer of my dreams. The day before I bought it I made a storage reservation and got confirmation. The next day I still hadn't received an address. I waited the 24 hours it says the host can respond. Still nothing, I called and got the nobody is available to take your call please try back. I did that about 5 times, then emailed. Still NOTHING. The host put that I moved in. I have not! In fact because of the lack of follow up on neighbor.com my trailer was towed last night. I had to pay to get it out all because I didn't have the storage I paid for. When I look at my reservation it only gives a zip code for the address, something the site should have caught. Very disappointed."
  },
  {
    "author": "Michael Batista",
    "rating": 1,
    "date": "2021-03-26T17:12:59.000Z",
    "title": "AWFUL EXPERIENCE - READ TO BELIEVE!",
    "text": "The experience has been absolutely awful, and I blame it almost entirely on Neighbor.com.  The reason I booked on this app is because I was looking for a more affordable long term parking solution because I am traveling outside of the country for 90 days.  The person, Josh Johnson, whom of which I left my vehicle in care of orchestrated a plot to become a Level 4 superhost with absolutely no reviews or prior bookings (how could that possibly be?) and then stole my vehicle. The vehicle was recovered after a thorough investigation. The host has disappeared and fled the area. My vehicle was deemed a total loss. I am now required to pay my deductible, take a total loss hit on my insurance, and will be required to pay a higher insurance premium for 7 years because of this. All because of Neighbor.com allowing this user to become a Superhost level 4 without having ANY bookings or ANY reviews - fact of the matter I find this out after the entire incident. This entire issue would have been avoided if Neighbor.com did proper due diligence on their hosts. A representative from my car insurance states they did a background check on my host and said that they wouldn't have lent him a pair of socks. Literally the worst experience of my life. I am so disappointed and in disbelief how something like this could have happened to begin with."
  },
  {
    "author": "William McC",
    "rating": 1,
    "date": "2021-03-23T14:41:17.000Z",
    "title": "Two negative experiences with Neighbor",
    "text": "Two negative experiences with Neighbor. First time I put a deposit on a garage space, the owner ghosted me. Eventually I asked fir a refund and got it days later. The second experience, the garage owner requested a deposit via Zelle. I complied, and Neighbor blocked my account from access, and the garage owner turned out to not own or have rights to the space Neighbors offered to me. Neighbors is a good idea, but poorly executed. My recourse with Neighbors is limited to FAQ, and nothing else save this request for reviews!"
  },
  {
    "author": "Ron C",
    "rating": 1,
    "date": "2021-03-20T17:54:33.000Z",
    "title": "They take your money and don’t respond…",
    "text": "They take your money and don’t respond to any of your questions or requests. Very unprofessional and unorganized. I tried multiple times over 3 days and got frustrated and canceled my reservation."
  },
  {
    "author": "Wayne Skalka",
    "rating": 1,
    "date": "2021-03-10T00:50:05.000Z",
    "title": "Ask to see before you rent they will not refund you if it not as advertised!",
    "text": "I used neighbor for to store a camper the description said it was a locked gate for the storage when i went to go move in found there is no gate and no lock you basically were parking on the street.  I cancelled the reservation but they still charged me and wont refund my money.  I suggest you stay away from this app its bad news and you will be out money."
  },
  {
    "author": "Norah O",
    "rating": 1,
    "date": "2021-01-13T00:54:44.000Z",
    "title": "Avoid! Forced to vacate mid-rental while out-of-state.",
    "text": "Avoid using this service - no guarantees! You may need to suddenly remove your belongings - even if you have paid. If you're not local at that moment, you need to hire movers or risk losing your items. I rented a space and outlined my timeline. The storage owner used shipping containers on his property, but apparently he shouldn't have been doing this because the city asked him to remove the containers. I was 6 months into my rental, the owner told me I had 30 days to move. Note - I always paid on time. I explained that I was out-of-state for a few months, which I had communicated this in the beginning. So now I need to spend hundreds of dollars to have movers come and move my belongings elsewhere. I should have just used a traditional storage unit provider rather than trying to support a local person. I spent $300+ to have people unlock my storage unit and move to another. At least with a typical storage unit provider, your items are safe and no one is going to ask you to move your things while you're 3,000 miles away."
  },
  {
    "author": "Mike F",
    "rating": 1,
    "date": "2020-12-14T21:16:02.000Z",
    "title": "Neighbor.com $1M Host Guarantee not cover theft by renter",
    "text": "Neighbor.com $1M Host Guarantee not cover theft by renter. Neighbor.com does not respect and take user complaints seriously and should not be awarded an IPO to enrich themselves with billions of undeserved dollars.  I advertised garage space on the Neighbor.com  platform and instead user resorts to name calling and other abuses.  Many scams exhibit poor English and this user had all the red flags including claiming to be a Software Engineer.  Neighbor dismissed my complaint: 'After reviewing this case with our Trust and Safety team, we do not have any reason to believe --- has any nefarious intentions.  She is simply trying to store her vehicle.' Furthermore,  their $1M Host guarantee does not cover if renter steals equipment from landlord's garage claiming 'The Guarantee is not a replacement for the law and we would assist authorities with their investigation if this situation were to arise.' Ever try recovery from police in USA?  Neighbor refuses to provide renter's full name, address and phone depriving landlord to sue in court and collections to recover from renter stealing garage equipment and tools in the thousands of dollars. Neighbor.com is no AirBnB.  Don't waste your time with Neighbor.com and risk your garage and property."
  },
  {
    "author": "suzy",
    "rating": 1,
    "date": "2020-11-10T18:07:26.000Z",
    "title": "The website scanned my card but could…",
    "text": "The website scanned my card but could not pick up the CR-V and did not tell me where to put it I hope they didn't charge my card I could not contact anyone very bad service website not working"
  },
  {
    "author": "John A",
    "rating": 1,
    "date": "2020-08-18T20:10:33.000Z",
    "title": "Do not trust this site",
    "text": "Do not trust this site. They claim there is no charge until you are approved and the host contacts you. No one ever contacted me and they charged my card immediately. Unresponsive and not at all concerned about keeping their word. It is a scam. Don't fall for it."
  },
  {
    "author": "Cameron",
    "rating": 1,
    "date": "2020-07-14T21:17:53.000Z",
    "title": "Charged without even using the space",
    "text": "Horrible experience with Neighbor. You have to make a reservation before being able to see the space to rent. They then charge you for the space even after you finally see it and decide it doesn’t fit your needs. When you contact them about a refund they say you agreed to their terms upon making a reservation and it’s out of their hands. Bad customer service. UPDATE: turns out Neighbor charged me $69 a month after I cancelled the reservation. Not only did they charge me before even seeing the spot, they also charged me another month’s rent at a place I cancelled and never even used."
  },
  {
    "author": "Brenda Williams",
    "rating": 1,
    "date": "2020-03-20T18:22:20.000Z",
    "title": "ZERO STARS",
    "text": "ZERO STARS. Neighbor charge me an extra month for the storage unit. Neither neighbor and the storage unit were able to solve my problem and refund my money. Neighbor said that they paid the storage, so they should take care of the refund. On the other hand, the storage unit said that they never got the money. I wouldn’t recommend any of these business. And if you need a storage unit, reach them out directly, so you don’t have the same headache I had! EDIT: BUT the problem is that the storage said that they never got the money. Someone is lying in this whole story."
  },
  {
    "author": "Valerie Ma",
    "rating": 1,
    "date": "2020-01-16T06:10:03.000Z",
    "title": "Took our money/no service...is this legal???",
    "text": "I'm sorry to hear about Cleo's experience.  We were scheduled to store our van in an attached garage in Wichita at the home of Justin B for at least 6 months, starting in August 2019. At the last minute, Justin B said we would have to leave our van \"outside\" for him to park in the garage because he had forgotten it was full of his mom's stuff which he needed to clean out. We immediately replied thanks but no thanks and found another storage. In November, we noticed monthly charges to our credit card for the full amount we would have paid had Justin B actually had the garage available at agreed upon time.  I immediately called neighbor.com customer service and spoke to Katherine, who cancelled future automatic payments, but REFUSED TO ISSUE A REFUND TO US for the $226.76 they took out of our credit card on the grounds that they had already paid Justin B with our money.  The fact that it was not our fault meant nothing. She merely said we needed to chase down Justin B and convince him to give it back to us...REALLY??? What kind of business would do that to their customers? Is that even legal???  With no other option, we reached out to Justin B who promptly replied that he had, in fact, received the money.  He said he \"just noticed that!\" and said he would pay it back right away via a payment app. Days went by and no money came through. I checked with him again in November and then again in December.  By the last contact, he indicated he needed that money and would try to pay it back in a week.  That was 24 days ago and to date, we have not received a dime."
  },
  {
    "author": "cleo",
    "rating": 1,
    "date": "2020-01-11T22:49:20.000Z",
    "title": "renters beware....irresponsible and ungrateful",
    "text": "i found a storage rental place for my oversize vehicle via Neighbor.com, by which i was ripped off $140 of my last month rent with the help of neighbor.com via their misleading information/impression about THEIR onsite host (as representing Neighbor.com) that was stealing customers from them by telling customers to cancel payment ($86.72) made on neighbor.com but pay him, the onsite host, cash, directly and also the storage rental owner cash directly monthly, instead of making their monthly payment via neighbor.com like they were supposed to, which was supposed to give customers insurance for their properties stored.  the piece of misleading info & impression given  by neighbor.com caused my trust misplaced with two untrustworthy people that ended up ripping me off $140 cash. (one of which happened to appear to represent neighbor.com)  while it was advertised on neighbor.com as having 24/7 access, the storage owner made me wait five hours before i could get my vehicle off his lot.  by the time i got there, my vehicle remained in the same spot unmoved with a bunch of other vehicles blocking it, gate locked, bull dog running loose on the lot.  i barely got my vehicle out of the lot.  neighbor.com refused to take any responsibility at all for this. this is how they thanked me for helping them stop one of their onsite hosts from stealing customers from them.  i'm yet to receive my $86.72 refund from them. renters beware...their onsite host can screw u over and doesn't work for them, thereby, neighbor.com will not be responsible if u ever get ripped off believing that u were following the instructions of neighbor.com even when neighbor.com aided in the misleading info that gave out a false sense of security for doing business with storage owners found on neighbor.com.  you're at the mercy of the storage owner and the mercy of THEIR onsite hosts.  just hope and pray that they don't rip u off like the ones that did to me. and be sure that u get in writing everything promised before u pay anything to anyone.  i think that b/c of my brain injury and my PTSD besides having a widow's brain, i got duped, left my vehicle with them with no proper paperwork stating the nature of my vehicle on the lot but a piece of paperwork for auto repair stating the monthly charge but not a receipt for the $140 the storage owner received. as a response to your response underneath, u guys could have done more, i.e. giving me the $140 storage owner owes me b/c your onsite host was the reason why i trusted storage owner  b/c your onsite host worked for u, at least that was the impression i was given.  but u guys refused to take responsibility for helping  storage owner in his scam of ripping me off.  i just looked at the piece of paperwork he gave me.  it said nothing about receiving any money from me but the fact that it's a $150 a per month rental.  got duped big time.  perhaps next time u guys should make it loud and clear that YOUR onsite host really doesn't work for u and u got nothing to do with whatever your onsite host's actions or inactions. in addition, by reporting those two fraudsters, i have helped neighbor.com stop that onsite host's stealing customers from neighbor.com.  where is the gratitude in this?  the decent thing to do is to at least reimburse me for the funds i lost b/c of your help in facilitating their duping me by misrepresenting your onsite host as someone trustworthy working for neighbor.com.  btw, till this moment, i still don't even have any notification of a refund coming to me or a refund being issued notice. they took it out of my bank account and still no refund back in yet. UPDATE: finally got my refund from neighbor.com.  still yet to see my $140 from the storage owner.  do not expect the grateful neighbor.com site owner to help in this matter even though his/her employees have misrepresented THEIR onsite host to have caused me to trust the storage owner and then ended up giving him $140.  while there was never any contract signed, THEIR wonderful onsite host told me the cash was nonrefundable after i asked for my $140 being in the storage for less than 24 hours willfully."
  }
]