[
  {
    "author": "AV",
    "rating": 1,
    "date": "2025-09-30T01:14:24.000Z",
    "title": null,
    "text": "This platform is biased and makes it a habit of silencing conservative views. My response post (ie. I didn't start the conversation) was an equal response to the original, opposing comment. However, I..."
  },
  {
    "author": "Kathryn Rubenstein",
    "rating": 1,
    "date": "2025-09-29T03:09:54.000Z",
    "title": null,
    "text": "NEXTDOOR is the worst online experience I’ve ever had. It’s biased against Democrats and has been infiltrated by MAGA. They post inflammatory political posts, which is not allowed, and the moderators..."
  },
  {
    "author": "Charles Hunter",
    "rating": 1,
    "date": "2025-09-21T16:45:07.000Z",
    "title": null,
    "text": "Please , please, if you value any semblance of privacy, DO NOT!! I repeat DO NOT!! sign up with this highly intrusive supposed neighborhood app! There is absolutely no way that I’ve found to unsubscri..."
  },
  {
    "author": "Niel Flamm",
    "rating": 1,
    "date": "2025-09-20T12:06:04.000Z",
    "title": null,
    "text": "I used to enjoy the app in the city of Henderson,NV the Inspirada Neighborhood. I had no problems with the moderators. In the city of Mount Pleasant, South Carolina I'm on my 5th Suspension. I believe..."
  },
  {
    "author": "Dana R.",
    "rating": 1,
    "date": "2025-09-10T11:20:45.000Z",
    "title": null,
    "text": "Horrible app! Since their \"revamp\" my 7 year old acct was suspended pending name verification. They then DELETED almost 200 items I had listed in the Buy and Sell section. When my acct was reactivated..."
  },
  {
    "author": "Jess Foster",
    "rating": 1,
    "date": "2025-09-21T22:46:04.000Z",
    "title": null,
    "text": "Terrible. Most biased platform I have ever used, saturated with backyard animal breeders and those seeking any kind of job they can get or money out of desperation. I don’t recommend."
  },
  {
    "author": "Zan Mayo Glodich",
    "rating": 1,
    "date": "2025-09-29T20:18:56.000Z",
    "title": null,
    "text": "My opinion about a local restaurant was posted in response to an inquiry.  It turned out that the original poster was the owner of the restaurant but he had not identified himself as such.  There was..."
  },
  {
    "author": "Cheryl",
    "rating": 1,
    "date": "2025-08-26T03:44:40.000Z",
    "title": null,
    "text": "I'd give NextDoor.com ZERO stars if I could. They deactivated my account saying my name wasn't verifiable. And I'm not giving them a copy of my ID or some other private document just so I can read abo..."
  },
  {
    "author": "Kathleen Casey",
    "rating": 1,
    "date": "2025-09-03T20:57:13.000Z",
    "title": null,
    "text": "I have had NextDoor for years, never have I been suspended but today I am.  I replied to two different hateful and racist comments on my post and I am suspended.  All over a boy who is using the girls..."
  },
  {
    "author": "Unhappy",
    "rating": 1,
    "date": "2025-08-23T22:05:13.000Z",
    "title": null,
    "text": "There isn't a minus zero star? There should be. This is a playground for  high school girls given the title of moderator. They have no clue that that are being used by corporate for financial profit,..."
  },
  {
    "author": "A Rising Virgo",
    "rating": 1,
    "date": "2025-09-28T20:38:47.000Z",
    "title": null,
    "text": "this app is literally filled with nazis, racist, bigoted people who claim to be good neighbors. This app breeds misinformation and those who created the app are also racist and responsible for this be..."
  },
  {
    "author": "Mrz DeeDee",
    "rating": 1,
    "date": "2025-09-28T05:53:23.000Z",
    "title": null,
    "text": "Unfortunately, this app fosters a mob mentality and a mean-girl high school vibe. If you write something that the neighbors disagree with, the entire neighborhood comes for you. There is no moderator..."
  },
  {
    "author": "Sue M",
    "rating": 1,
    "date": "2025-09-19T19:19:46.000Z",
    "title": null,
    "text": "It's changed and all ads now. Repeating ads and rhe hide feature doesnt work.  They always say they will let the developers know when you email them. The developers dont do anything,obviously.  Look a..."
  },
  {
    "author": "Aletheos Oratos",
    "rating": 1,
    "date": "2025-06-28T14:22:47.000Z",
    "title": null,
    "text": "Heavy censorship. Massive bias against conservatives. FAKE players in groups who patrol and dog pile you if you criticize democrat policy. The instant you criticize their toxic behavior, you get banne..."
  },
  {
    "author": "Jim A",
    "rating": 1,
    "date": "2025-08-20T20:34:37.000Z",
    "title": null,
    "text": "It's just a social media site now. Neighbors complaining about neighbors, political fights, public shaming of people you don't like. Like X the rude and hateful have taken over. There must be someplac..."
  },
  {
    "author": "Nicola Carr",
    "rating": 1,
    "date": "2025-06-09T20:22:49.000Z",
    "title": null,
    "text": "Increasingly prejudice vigilante type people on ND. People getting away with showing video footage of supposed dodgy people. It's curtain twitchers heaven ,throw in xenophobia,racist,classist content..."
  },
  {
    "author": "Kristina",
    "rating": 1,
    "date": "2025-05-21T22:49:49.000Z",
    "title": null,
    "text": "Avoid using it, it’s a trash you can’t post anything, there will be always someone reporting constantly local users to be banned for all daft reasons. I was using it I got banned because someone repor..."
  },
  {
    "author": "C Cruvineli Agnes",
    "rating": 1,
    "date": "2025-05-29T00:07:40.000Z",
    "title": null,
    "text": "THESE XENOFOBICS LUNATICS LEFTISTS. I reported a post who's guy is calling the President Trump corrupt and other bad words and provoked conflicts between the neighbors. The moderators and the rules sa..."
  },
  {
    "author": "miguel banda",
    "rating": 1,
    "date": "2025-05-18T19:09:25.000Z",
    "title": null,
    "text": "You get censored or banned for anything on this lame app. It's worse than facebook during the Biden years with the North Korea censorship, and even worse, they don't apply their rules evenly. They'll..."
  },
  {
    "author": "Ken C",
    "rating": 1,
    "date": "2025-09-13T06:02:57.000Z",
    "title": null,
    "text": "This is my 10th time + unsubscribing to Nextdoor. They keep sending me unsolicited emails. They are one of the worst offenders. Can’t trust a company that keeps violating settings."
  },
  {
    "author": "J-CAT",
    "rating": 1,
    "date": "2025-08-02T05:39:55.000Z",
    "title": null,
    "text": "Aggravating to say the least! I've been kicked off twice simply for disagreeing with all the Sitanic Left wing nut jobs! I NEVER cursed or said anything disrespectful (even though THEY did!) One perso..."
  },
  {
    "author": "douglas strand",
    "rating": 1,
    "date": "2025-05-13T16:00:56.000Z",
    "title": null,
    "text": "As an ex moderator reporting insulting/ rude/agresive behaviour \ntoo many times 'those above me' deemed the reports ill founded \neven when some posters were openly breaking UK laws\n.\nthen one..."
  },
  {
    "author": "Angela Read-Meshil",
    "rating": 1,
    "date": "2025-05-18T18:15:59.000Z",
    "title": null,
    "text": "It’s a shockingly poorly moderated platform. It houses a bed of ignorant racists who are allowed to insult moderately minded people. They openly allow right-wing and fascist ideology pedalled by obvio..."
  },
  {
    "author": "Bellflower",
    "rating": 1,
    "date": "2025-09-16T07:02:11.000Z",
    "title": null,
    "text": "Moderators are r acist.  They're perfectly fine allowing people to be  r acist but ones we stand up for ourselves,  we get suspended"
  },
  {
    "author": "Mark Eckelkamp",
    "rating": 1,
    "date": "2025-07-01T08:43:00.000Z",
    "title": null,
    "text": "Remove user moderators and leads.  They band together to control their ideology and views. Nextdoor has a poorly AI based system that is horribly corrupted and flawed. Allow individual users to block..."
  },
  {
    "author": "J B",
    "rating": 1,
    "date": "2025-04-07T15:17:02.000Z",
    "title": null,
    "text": "Nextdoor continues to break their own rules and allows Trump/Musk protest propaganda to be posted on the main feed. Would they allow Trump/Musk rallies to be posted on the main feed? Highly unlikely a..."
  },
  {
    "author": "CAROL SHORE",
    "rating": 1,
    "date": "2025-04-07T10:11:00.000Z",
    "title": null,
    "text": "This site should put in its guidelines \"we support Trump and thats it\"I was upset that he played golf instead of meeting the plane carrying 4 dead soldiers who died in Lithuania and said so.I was susp..."
  },
  {
    "author": "Debbie",
    "rating": 1,
    "date": "2025-08-07T22:46:40.000Z",
    "title": null,
    "text": "If your comments are in the least middle of the road to right leaning you get banned from the app.  This app is not neutral.  It is a left wing propaganda app.  I never posted anything , I just respon..."
  },
  {
    "author": "Peach Rose",
    "rating": 1,
    "date": "2025-09-15T03:39:51.000Z",
    "title": null,
    "text": "I’ve been on Nextdoor for nearly a decade, and it’s disheartening to see how much it’s changed. What once felt like a friendly, casual place for neighbors to share information has turned into a..."
  },
  {
    "author": "Alice",
    "rating": 1,
    "date": "2025-07-10T23:32:46.000Z",
    "title": null,
    "text": "Nextdoor is a platform is run by true fascists, enemies of free speech. There's heavy censorship. They removed my post, where I stated a historical fact, labeling it as 'discrimination', while allowin..."
  },
  {
    "author": "Ron Hammelman",
    "rating": 1,
    "date": "2025-05-08T22:29:17.000Z",
    "title": null,
    "text": "Well the ND moderators did it to me again, suspension for 1 month because I dared to speak what was on my mind responding to insulting or rude comments.  Reason this time was Non-Local Political issue..."
  },
  {
    "author": "Laurence",
    "rating": 1,
    "date": "2025-05-23T23:22:40.000Z",
    "title": null,
    "text": "It is a haven for racists. The moderation is appalling and there is a pronounced bias for racism and parties on the far right. I tested my theory by using the exact same wording used by supporters of..."
  },
  {
    "author": "Rachel Wonos",
    "rating": 1,
    "date": "2025-05-18T16:15:00.000Z",
    "title": null,
    "text": "I’d give zero stars if possible! Disgusting site run by TDS liberals who don’t even hide their bias! Conservatives who express support for Pres Trump get suspended for no reason, while liberals who po..."
  },
  {
    "author": "Darhlene Zeanwick",
    "rating": 1,
    "date": "2025-06-23T10:30:18.000Z",
    "title": null,
    "text": "NextDoor - The Place for NonThinkers - Heavy on the ads. Heavy on the censorship. Users access only to report on neighbors. Watched by LEOs. They send letters to neighbors with your name inviting them..."
  },
  {
    "author": "R Tims",
    "rating": 1,
    "date": "2025-08-16T23:48:07.000Z",
    "title": null,
    "text": "Biased hacks censoring civil debate. When you’re in groups among people who politically battle they will only block and remove the people who they don’t politically align with. What a stupid app ran b..."
  },
  {
    "author": "Sandy Miller",
    "rating": 1,
    "date": "2025-07-21T12:36:56.000Z",
    "title": null,
    "text": "Hired a workman from this Nextdoor website who took photos of our property without our knowledge. He then used these photo to advertise his work which clearly is a breach of our privacy. We infor..."
  },
  {
    "author": "CJ",
    "rating": 1,
    "date": "2025-07-17T16:44:24.000Z",
    "title": null,
    "text": "I was selling an item for Sale under the \"For Sale\" section of Nextdoor.  I did delete it and repost it the next day with changes that needed to be made.\nApparently, Nextdoor see this as a \"Do Not..."
  },
  {
    "author": "Bryan K",
    "rating": 1,
    "date": "2025-06-15T03:19:10.000Z",
    "title": null,
    "text": "In Plano, TX the posting management is terribly biased.  Someone can post, as an example, that Trump takes bribes and pockets the money.  If corrected, politely, to such an absurd statement and correc..."
  },
  {
    "author": "Mike White",
    "rating": 1,
    "date": "2025-09-14T02:51:23.000Z",
    "title": null,
    "text": "Very biased in favor of leftists. They delete truthful comments all the time. If it does not comply with leftist ideals it will get deleted."
  },
  {
    "author": "Bob Tinker",
    "rating": 1,
    "date": "2025-07-15T01:12:57.000Z",
    "title": null,
    "text": "Constant censorship, if they don’t agree with your view, they remove even when you’re in the right. Pro American,Gun,Fireworks,Free Speech, Republican, this is NOT the place for you"
  },
  {
    "author": "Gunter Kruger",
    "rating": 1,
    "date": "2025-07-31T09:19:00.000Z",
    "title": null,
    "text": "My account was suspended for a photo of a corn dog and a carrot. Both looked too sexual. The platform doesn't have a lot of traction, and the administrators are probably a hundred years old or sexuall..."
  },
  {
    "author": "La Tonya",
    "rating": 1,
    "date": "2025-08-19T21:07:51.000Z",
    "title": null,
    "text": "I started using Nextdoor when I lived in the UK & was over the moon having found a community based app which was extremely helpful because I travel a lot & posted frequently. It was brilliant & helpfu..."
  },
  {
    "author": "CustomerAJ",
    "rating": 1,
    "date": "2025-08-06T00:37:27.000Z",
    "title": null,
    "text": "Due to an unknown amount of people false reporting my account, I was suspended and asked to verify my address. I sent pictures of my mail. The agent I spoke with said the name on my mail does not..."
  },
  {
    "author": "Marcus",
    "rating": 1,
    "date": "2025-09-17T16:24:36.000Z",
    "title": null,
    "text": "Nextdoor makes it extremely easy to charge my credit card for their Ads/Pro service, but nearly impossible to cancel the plan, remove my payment information, or speak to a live repre..."
  },
  {
    "author": "Sierra Frost",
    "rating": 1,
    "date": "2025-05-26T15:15:36.000Z",
    "title": null,
    "text": "Ableist bigots. \nSupport and allow doxxing.\nAid in targeting community members and even support law enforcement and elected officials to target them, making life incredibly dangerous for vulnera..."
  },
  {
    "author": "JAMES CAMPBELL",
    "rating": 1,
    "date": "2025-05-16T14:45:35.000Z",
    "title": null,
    "text": "The people running this app in the ANTIOCH TN area are terrible people. They remove protest they don't agree with and keep what they do, they will have your whole page deleted if you start gaining to..."
  },
  {
    "author": "Queen Riser",
    "rating": 1,
    "date": "2025-09-05T01:06:48.000Z",
    "title": null,
    "text": "This organisation has breached the Privacy and Electronics Communications Regulations.\nThey have been sending me their newsletter and other marketing correspondence that I had not..."
  },
  {
    "author": "Tom Mendez",
    "rating": 1,
    "date": "2025-05-23T15:07:15.000Z",
    "title": null,
    "text": "I’ve had the same negative experience as others. There is no appropriate process in place to stop your competitors from complaining—falsely—about your posts/ads. The only action that Nextdoor takes to..."
  },
  {
    "author": "davfit",
    "rating": 1,
    "date": "2025-10-04T20:17:58.000Z",
    "title": "creepy..",
    "text": "creepy... lets scammers pop on and off then you try to protect yourself then they block you."
  },
  {
    "author": "AV",
    "rating": 1,
    "date": "2025-09-30T01:14:24.000Z",
    "title": "This platform censors speech and is left biased.",
    "text": "This platform is biased and makes it a habit of silencing conservative views. My response post (ie. I didn't start the conversation) was an equal response to the original, opposing comment. However, I got suspended. Nextdoor shows their true colors. I would steer clear of it."
  },
  {
    "author": "Zan Mayo Glodich",
    "rating": 1,
    "date": "2025-09-29T20:18:56.000Z",
    "title": "Unfair Censorship",
    "text": "My opinion about a local restaurant was posted in response to an inquiry.  It turned out that the original poster was the owner of the restaurant but he had not identified himself as such.  There was nothing profane or insulting about my response, only a description of my experience, but the original poster/restaurant owner was able to have my post deleted.  I received no notification or reason.  It is misleading to allow a business to retain only positive posts."
  },
  {
    "author": "Kathryn Rubenstein",
    "rating": 1,
    "date": "2025-09-29T03:09:54.000Z",
    "title": "NEXTDOOR is the worst online experience…",
    "text": "NEXTDOOR is the worst online experience I’ve ever had. It’s biased against Democrats and has been infiltrated by MAGA. They post inflammatory political posts, which is not allowed, and the moderators suspend people that complain about the discrimination. Reported to Better Business Bureau and there were only 1-star reviews on the BBB. Goodbye Nextdoor forever."
  },
  {
    "author": "A Rising Virgo",
    "rating": 1,
    "date": "2025-09-28T20:38:47.000Z",
    "title": "this app is literally filled with…",
    "text": "this app is literally filled with nazis, racist, bigoted people who claim to be good neighbors. This app breeds misinformation and those who created the app are also racist and responsible for this behavior."
  },
  {
    "author": "Mrz DeeDee",
    "rating": 1,
    "date": "2025-09-28T05:53:23.000Z",
    "title": "No accountability for ridding toxic posts",
    "text": "Unfortunately, this app fosters a mob mentality and a mean-girl high school vibe. If you write something that the neighbors disagree with, the entire neighborhood comes for you. There is no moderator or reviewer because they also engage in disrespectful trolling behavior.  This could be an excellent forum for neighbors if there were more accountability in moderating and eliminating destructive behaviors, such as name-calling, public shaming, and trolling, along with misinformation. When you hit the button to report, nothing happens. There are zillions of business ads, but also subjective views of those businesses."
  },
  {
    "author": "Sharon Tabbert",
    "rating": 1,
    "date": "2025-09-22T02:14:01.000Z",
    "title": "Very biased app",
    "text": "Very biased app.  Feed is unorganized."
  },
  {
    "author": "Jess Foster",
    "rating": 1,
    "date": "2025-09-21T22:46:04.000Z",
    "title": "Terrible",
    "text": "Terrible. Most biased platform I have ever used, saturated with backyard animal breeders and those seeking any kind of job they can get or money out of desperation. I don’t recommend."
  },
  {
    "author": "Charles Hunter",
    "rating": 1,
    "date": "2025-09-21T16:45:07.000Z",
    "title": "Please subscriber Beware",
    "text": "Please , please, if you value any semblance of privacy, DO NOT!! I repeat DO NOT!! sign up with this highly intrusive supposed neighborhood app! There is absolutely no way that I’ve found to unsubscribe. Mistakenly think I’ve successfully unsubscribed and are done with them, then 30-60 days later , their Neighborhood news will evilly sneak into my mail.  This scary app is not worth any benefits you might derive. 😳 Wtf. Run .. do not walk away from this stoopid app. I repeat STOOPID APP"
  },
  {
    "author": "Niel Flamm",
    "rating": 1,
    "date": "2025-09-20T12:06:04.000Z",
    "title": "I Hope it Fails",
    "text": "I used to enjoy the app in the city of Henderson,NV the Inspirada Neighborhood. I had no problems with the moderators. In the city of Mount Pleasant, South Carolina I'm on my 5th Suspension. I believe there is one moderator with HER radar on me, and swinging her rent a cop stick for all to feel. I've asked each time for feedback to get info on what I'm doing to break the rules, I get nothing. My hope fo not r this app is that it fails soon as it seems it won't take suggestions to improve."
  },
  {
    "author": "Sue M",
    "rating": 1,
    "date": "2025-09-19T19:19:46.000Z",
    "title": "It's changed and all ads now",
    "text": "It's changed and all ads now. Repeating ads and rhe hide feature doesnt work.  They always say they will let the developers know when you email them. The developers dont do anything,obviously.  Look at the review scores.  Won't last long with the ads taking over and they dont care"
  },
  {
    "author": "Marcus",
    "rating": 1,
    "date": "2025-09-17T16:24:36.000Z",
    "title": "Nextdoor makes it extremely easy to…",
    "text": "Nextdoor makes it extremely easy to charge my credit card for their Ads/Pro service, but nearly impossible to cancel the plan, remove my payment information, or speak to a live representative. I attempted multiple times to cancel my subscription and remove my card through their website, but the options are either hidden or unavailable. There is no clear “Cancel Subscription” button, and no reliable customer service phone number. I had to escalate the issue to my bank (Chase), who ultimately removed my card to stop future charges. This practice feels predatory and misleading. Customers should not have to go through their bank just to stop recurring charges. The company should provide: A clear, accessible way to cancel subscriptions online. The ability to remove payment methods without replacing them. A direct way to contact a live customer service representative. Desired Outcome: Immediate cancellation of my account. Written confirmation that no further charges will occur. Assurance that Nextdoor will make subscription cancellation and payment removal more transparent for future customers."
  },
  {
    "author": "Bellflower",
    "rating": 1,
    "date": "2025-09-16T07:02:11.000Z",
    "title": "Moderators are r acist",
    "text": "Moderators are r acist.  They're perfectly fine allowing people to be  r acist but ones we stand up for ourselves,  we get suspended"
  },
  {
    "author": "Peach Rose",
    "rating": 1,
    "date": "2025-09-15T03:39:51.000Z",
    "title": "Promotes stockers and harassers.",
    "text": "I’ve been on Nextdoor for nearly a decade, and it’s disheartening to see how much it’s changed. What once felt like a friendly, casual place for neighbors to share information has turned into a feed filled with ads and sponsored content—sometimes appearing every few posts. The types of posts have also shifted. Lost pets, neighborhood safety concerns, and community disagreements now mix with satire or joke posts that can make the platform feel less constructive. Moderation has also become far stricter. Posts with even a slight political tone seem to disappear immediately, and the current approach feels far more heavy-handed than in the past. Earlier moderators allowed open discussion as long as rules weren’t broken; now, it often feels like decisions are made unilaterally, which has changed the tone of the community. Unfortunately, it’s also become harder to engage without risking harassment. After my first account was compromised, I had to start over, and I’m not willing to go through that a third time. I’ve tried to update my location and maintain my account, but it hasn’t worked smoothly. At this point, it feels like I’m speaking into the void. The sense of community that drew me here has eroded, and the tone of interactions has shifted dramatically. For my own peace of mind, I’m stepping away from Nextdoor and removing it from my routine."
  },
  {
    "author": "Mike White",
    "rating": 1,
    "date": "2025-09-14T02:51:23.000Z",
    "title": "Very biased in favor of leftists",
    "text": "Very biased in favor of leftists. They delete truthful comments all the time. If it does not comply with leftist ideals it will get deleted."
  },
  {
    "author": "Ken C",
    "rating": 1,
    "date": "2025-09-13T06:02:57.000Z",
    "title": "This is my 10th time + unsubscribing to…",
    "text": "This is my 10th time + unsubscribing to Nextdoor. They keep sending me unsolicited emails. They are one of the worst offenders. Can’t trust a company that keeps violating settings."
  },
  {
    "author": "Dana R.",
    "rating": 1,
    "date": "2025-09-10T11:20:45.000Z",
    "title": "Horrible app",
    "text": "Horrible app! Since their \"revamp\" my 7 year old acct was suspended pending name verification. They then DELETED almost 200 items I had listed in the Buy and Sell section. When my acct was reactivated, they apologized and said I would have to manually recreate each listing! I started doing so, and after recreating about 15 of the 200 household items for sale listings, Nextdoor then RE-suspended my acct claiming \"spam\" infractions. They then denied my appeal! Garbage app. Waste of time. Nothing on my \"news\" feed but left leaning, toxic political garbage and people dumping their pets. Im done😡"
  },
  {
    "author": "Queen Riser",
    "rating": 1,
    "date": "2025-09-05T01:06:48.000Z",
    "title": "Breach of Privacy and Electronic Communications Regulations",
    "text": "This organisation has breached the Privacy and Electronics Communications Regulations. They have been sending me their newsletter and other marketing correspondence that I had not given my expressed permission or consent to receive. I received an email from next door at 23:06 yesterday and responded by requesting that they refrain from contacting me. The below is the response I received at 00:06 this morning. Apologies for the inconvenience this may have caused you. Before taking action on this, I'll need to verify your identity for security reasons. Please reply to this email confirming that you sent the request. This allows us to confirm that you are the owner on the account. We appreciate your understanding and look forward to your reply. If you need anything else, we'll be here to support you, or you can visit our Help Center for instant answers anytime. I responded by stating that I was not an account holder and emphasized that I wanted any details concerning my email address removed from their records. I have tonight been woken from my sleep again with the same message asking me to verify that I am the account holder. This is despite making very clear that I do not hold an account with them. I will be submitting a formal complaint to the requisite body about the matter to ensure that my privacy and choices are taken seriously. NEXT DOOR YOU ARE NOT THE CONTROLLER OF WHAT KIND OF MARKETING CORRESPONDENCE THAT I CHOOSE TO RECEIVE. STOP HARASSING ME AS I DO NOT APPRECIATE  IT. YOU DESERVE ZERO RATING."
  },
  {
    "author": "Pat",
    "rating": 1,
    "date": "2025-09-04T15:25:05.000Z",
    "title": "This website is extremely liberal…",
    "text": "This website is extremely liberal biased and will let liberal users bash and insult anything remotely conservative and then turn around and suspend the accounts of even semi-conservative members for not goosestepping to their liberal viewpoints."
  },
  {
    "author": "Kathleen Casey",
    "rating": 1,
    "date": "2025-09-03T20:57:13.000Z",
    "title": "Nextdoor is a liberal site",
    "text": "I have had NextDoor for years, never have I been suspended but today I am.  I replied to two different hateful and racist comments on my post and I am suspended.  All over a boy who is using the girls locker loom in our middle school which has national attention and protests. NextDoor is a hotbed for liberal fanatics and the moderators slant left.  I am permanently deleting my account.  Thank God for Elon Musk and X.  No censoring there no matter what your politics are.  NextDoor is a social media left wing site full of crazy liberal hacks and people rehoming their dogs."
  },
  {
    "author": "AV",
    "rating": 1,
    "date": "2025-09-30T01:14:24.000Z",
    "title": null,
    "text": "This platform is biased and makes it a habit of silencing conservative views. My response post (ie. I didn't start the conversation) was an equal response to the original, opposing comment. However, I..."
  },
  {
    "author": "Kathryn Rubenstein",
    "rating": 1,
    "date": "2025-09-29T03:09:54.000Z",
    "title": null,
    "text": "NEXTDOOR is the worst online experience I’ve ever had. It’s biased against Democrats and has been infiltrated by MAGA. They post inflammatory political posts, which is not allowed, and the moderators..."
  },
  {
    "author": "Charles Hunter",
    "rating": 1,
    "date": "2025-09-21T16:45:07.000Z",
    "title": null,
    "text": "Please , please, if you value any semblance of privacy, DO NOT!! I repeat DO NOT!! sign up with this highly intrusive supposed neighborhood app! There is absolutely no way that I’ve found to unsubscri..."
  },
  {
    "author": "Niel Flamm",
    "rating": 1,
    "date": "2025-09-20T12:06:04.000Z",
    "title": null,
    "text": "I used to enjoy the app in the city of Henderson,NV the Inspirada Neighborhood. I had no problems with the moderators. In the city of Mount Pleasant, South Carolina I'm on my 5th Suspension. I believe..."
  },
  {
    "author": "Dana R.",
    "rating": 1,
    "date": "2025-09-10T11:20:45.000Z",
    "title": null,
    "text": "Horrible app! Since their \"revamp\" my 7 year old acct was suspended pending name verification. They then DELETED almost 200 items I had listed in the Buy and Sell section. When my acct was reactivated..."
  },
  {
    "author": "Jess Foster",
    "rating": 1,
    "date": "2025-09-21T22:46:04.000Z",
    "title": null,
    "text": "Terrible. Most biased platform I have ever used, saturated with backyard animal breeders and those seeking any kind of job they can get or money out of desperation. I don’t recommend."
  },
  {
    "author": "Zan Mayo Glodich",
    "rating": 1,
    "date": "2025-09-29T20:18:56.000Z",
    "title": null,
    "text": "My opinion about a local restaurant was posted in response to an inquiry.  It turned out that the original poster was the owner of the restaurant but he had not identified himself as such.  There was..."
  },
  {
    "author": "Cheryl",
    "rating": 1,
    "date": "2025-08-26T03:44:40.000Z",
    "title": null,
    "text": "I'd give NextDoor.com ZERO stars if I could. They deactivated my account saying my name wasn't verifiable. And I'm not giving them a copy of my ID or some other private document just so I can read abo..."
  },
  {
    "author": "Kathleen Casey",
    "rating": 1,
    "date": "2025-09-03T20:57:13.000Z",
    "title": null,
    "text": "I have had NextDoor for years, never have I been suspended but today I am.  I replied to two different hateful and racist comments on my post and I am suspended.  All over a boy who is using the girls..."
  },
  {
    "author": "Unhappy",
    "rating": 1,
    "date": "2025-08-23T22:05:13.000Z",
    "title": null,
    "text": "There isn't a minus zero star? There should be. This is a playground for  high school girls given the title of moderator. They have no clue that that are being used by corporate for financial profit,..."
  },
  {
    "author": "A Rising Virgo",
    "rating": 1,
    "date": "2025-09-28T20:38:47.000Z",
    "title": null,
    "text": "this app is literally filled with nazis, racist, bigoted people who claim to be good neighbors. This app breeds misinformation and those who created the app are also racist and responsible for this be..."
  },
  {
    "author": "Mrz DeeDee",
    "rating": 1,
    "date": "2025-09-28T05:53:23.000Z",
    "title": null,
    "text": "Unfortunately, this app fosters a mob mentality and a mean-girl high school vibe. If you write something that the neighbors disagree with, the entire neighborhood comes for you. There is no moderator..."
  },
  {
    "author": "Sue M",
    "rating": 1,
    "date": "2025-09-19T19:19:46.000Z",
    "title": null,
    "text": "It's changed and all ads now. Repeating ads and rhe hide feature doesnt work.  They always say they will let the developers know when you email them. The developers dont do anything,obviously.  Look a..."
  },
  {
    "author": "Aletheos Oratos",
    "rating": 1,
    "date": "2025-06-28T14:22:47.000Z",
    "title": null,
    "text": "Heavy censorship. Massive bias against conservatives. FAKE players in groups who patrol and dog pile you if you criticize democrat policy. The instant you criticize their toxic behavior, you get banne..."
  },
  {
    "author": "Jim A",
    "rating": 1,
    "date": "2025-08-20T20:34:37.000Z",
    "title": null,
    "text": "It's just a social media site now. Neighbors complaining about neighbors, political fights, public shaming of people you don't like. Like X the rude and hateful have taken over. There must be someplac..."
  },
  {
    "author": "Nicola Carr",
    "rating": 1,
    "date": "2025-06-09T20:22:49.000Z",
    "title": null,
    "text": "Increasingly prejudice vigilante type people on ND. People getting away with showing video footage of supposed dodgy people. It's curtain twitchers heaven ,throw in xenophobia,racist,classist content..."
  },
  {
    "author": "Kristina",
    "rating": 1,
    "date": "2025-05-21T22:49:49.000Z",
    "title": null,
    "text": "Avoid using it, it’s a trash you can’t post anything, there will be always someone reporting constantly local users to be banned for all daft reasons. I was using it I got banned because someone repor..."
  },
  {
    "author": "C Cruvineli Agnes",
    "rating": 1,
    "date": "2025-05-29T00:07:40.000Z",
    "title": null,
    "text": "THESE XENOFOBICS LUNATICS LEFTISTS. I reported a post who's guy is calling the President Trump corrupt and other bad words and provoked conflicts between the neighbors. The moderators and the rules sa..."
  },
  {
    "author": "miguel banda",
    "rating": 1,
    "date": "2025-05-18T19:09:25.000Z",
    "title": null,
    "text": "You get censored or banned for anything on this lame app. It's worse than facebook during the Biden years with the North Korea censorship, and even worse, they don't apply their rules evenly. They'll..."
  },
  {
    "author": "Ken C",
    "rating": 1,
    "date": "2025-09-13T06:02:57.000Z",
    "title": null,
    "text": "This is my 10th time + unsubscribing to Nextdoor. They keep sending me unsolicited emails. They are one of the worst offenders. Can’t trust a company that keeps violating settings."
  },
  {
    "author": "J-CAT",
    "rating": 1,
    "date": "2025-08-02T05:39:55.000Z",
    "title": null,
    "text": "Aggravating to say the least! I've been kicked off twice simply for disagreeing with all the Sitanic Left wing nut jobs! I NEVER cursed or said anything disrespectful (even though THEY did!) One perso..."
  },
  {
    "author": "douglas strand",
    "rating": 1,
    "date": "2025-05-13T16:00:56.000Z",
    "title": null,
    "text": "As an ex moderator reporting insulting/ rude/agresive behaviour \ntoo many times 'those above me' deemed the reports ill founded \neven when some posters were openly breaking UK laws\n.\nthen one..."
  },
  {
    "author": "Angela Read-Meshil",
    "rating": 1,
    "date": "2025-05-18T18:15:59.000Z",
    "title": null,
    "text": "It’s a shockingly poorly moderated platform. It houses a bed of ignorant racists who are allowed to insult moderately minded people. They openly allow right-wing and fascist ideology pedalled by obvio..."
  },
  {
    "author": "Bellflower",
    "rating": 1,
    "date": "2025-09-16T07:02:11.000Z",
    "title": null,
    "text": "Moderators are r acist.  They're perfectly fine allowing people to be  r acist but ones we stand up for ourselves,  we get suspended"
  },
  {
    "author": "Mark Eckelkamp",
    "rating": 1,
    "date": "2025-07-01T08:43:00.000Z",
    "title": null,
    "text": "Remove user moderators and leads.  They band together to control their ideology and views. Nextdoor has a poorly AI based system that is horribly corrupted and flawed. Allow individual users to block..."
  },
  {
    "author": "J B",
    "rating": 1,
    "date": "2025-04-07T15:17:02.000Z",
    "title": null,
    "text": "Nextdoor continues to break their own rules and allows Trump/Musk protest propaganda to be posted on the main feed. Would they allow Trump/Musk rallies to be posted on the main feed? Highly unlikely a..."
  },
  {
    "author": "CAROL SHORE",
    "rating": 1,
    "date": "2025-04-07T10:11:00.000Z",
    "title": null,
    "text": "This site should put in its guidelines \"we support Trump and thats it\"I was upset that he played golf instead of meeting the plane carrying 4 dead soldiers who died in Lithuania and said so.I was susp..."
  },
  {
    "author": "Debbie",
    "rating": 1,
    "date": "2025-08-07T22:46:40.000Z",
    "title": null,
    "text": "If your comments are in the least middle of the road to right leaning you get banned from the app.  This app is not neutral.  It is a left wing propaganda app.  I never posted anything , I just respon..."
  },
  {
    "author": "Peach Rose",
    "rating": 1,
    "date": "2025-09-15T03:39:51.000Z",
    "title": null,
    "text": "I’ve been on Nextdoor for nearly a decade, and it’s disheartening to see how much it’s changed. What once felt like a friendly, casual place for neighbors to share information has turned into a..."
  },
  {
    "author": "Alice",
    "rating": 1,
    "date": "2025-07-10T23:32:46.000Z",
    "title": null,
    "text": "Nextdoor is a platform is run by true fascists, enemies of free speech. There's heavy censorship. They removed my post, where I stated a historical fact, labeling it as 'discrimination', while allowin..."
  },
  {
    "author": "Ron Hammelman",
    "rating": 1,
    "date": "2025-05-08T22:29:17.000Z",
    "title": null,
    "text": "Well the ND moderators did it to me again, suspension for 1 month because I dared to speak what was on my mind responding to insulting or rude comments.  Reason this time was Non-Local Political issue..."
  },
  {
    "author": "Laurence",
    "rating": 1,
    "date": "2025-05-23T23:22:40.000Z",
    "title": null,
    "text": "It is a haven for racists. The moderation is appalling and there is a pronounced bias for racism and parties on the far right. I tested my theory by using the exact same wording used by supporters of..."
  },
  {
    "author": "Rachel Wonos",
    "rating": 1,
    "date": "2025-05-18T16:15:00.000Z",
    "title": null,
    "text": "I’d give zero stars if possible! Disgusting site run by TDS liberals who don’t even hide their bias! Conservatives who express support for Pres Trump get suspended for no reason, while liberals who po..."
  },
  {
    "author": "Darhlene Zeanwick",
    "rating": 1,
    "date": "2025-06-23T10:30:18.000Z",
    "title": null,
    "text": "NextDoor - The Place for NonThinkers - Heavy on the ads. Heavy on the censorship. Users access only to report on neighbors. Watched by LEOs. They send letters to neighbors with your name inviting them..."
  },
  {
    "author": "R Tims",
    "rating": 1,
    "date": "2025-08-16T23:48:07.000Z",
    "title": null,
    "text": "Biased hacks censoring civil debate. When you’re in groups among people who politically battle they will only block and remove the people who they don’t politically align with. What a stupid app ran b..."
  },
  {
    "author": "Sandy Miller",
    "rating": 1,
    "date": "2025-07-21T12:36:56.000Z",
    "title": null,
    "text": "Hired a workman from this Nextdoor website who took photos of our property without our knowledge. He then used these photo to advertise his work which clearly is a breach of our privacy. We infor..."
  },
  {
    "author": "CJ",
    "rating": 1,
    "date": "2025-07-17T16:44:24.000Z",
    "title": null,
    "text": "I was selling an item for Sale under the \"For Sale\" section of Nextdoor.  I did delete it and repost it the next day with changes that needed to be made.\nApparently, Nextdoor see this as a \"Do Not..."
  },
  {
    "author": "Bryan K",
    "rating": 1,
    "date": "2025-06-15T03:19:10.000Z",
    "title": null,
    "text": "In Plano, TX the posting management is terribly biased.  Someone can post, as an example, that Trump takes bribes and pockets the money.  If corrected, politely, to such an absurd statement and correc..."
  },
  {
    "author": "Mike White",
    "rating": 1,
    "date": "2025-09-14T02:51:23.000Z",
    "title": null,
    "text": "Very biased in favor of leftists. They delete truthful comments all the time. If it does not comply with leftist ideals it will get deleted."
  },
  {
    "author": "Bob Tinker",
    "rating": 1,
    "date": "2025-07-15T01:12:57.000Z",
    "title": null,
    "text": "Constant censorship, if they don’t agree with your view, they remove even when you’re in the right. Pro American,Gun,Fireworks,Free Speech, Republican, this is NOT the place for you"
  },
  {
    "author": "Gunter Kruger",
    "rating": 1,
    "date": "2025-07-31T09:19:00.000Z",
    "title": null,
    "text": "My account was suspended for a photo of a corn dog and a carrot. Both looked too sexual. The platform doesn't have a lot of traction, and the administrators are probably a hundred years old or sexuall..."
  },
  {
    "author": "La Tonya",
    "rating": 1,
    "date": "2025-08-19T21:07:51.000Z",
    "title": null,
    "text": "I started using Nextdoor when I lived in the UK & was over the moon having found a community based app which was extremely helpful because I travel a lot & posted frequently. It was brilliant & helpfu..."
  },
  {
    "author": "CustomerAJ",
    "rating": 1,
    "date": "2025-08-06T00:37:27.000Z",
    "title": null,
    "text": "Due to an unknown amount of people false reporting my account, I was suspended and asked to verify my address. I sent pictures of my mail. The agent I spoke with said the name on my mail does not..."
  },
  {
    "author": "Marcus",
    "rating": 1,
    "date": "2025-09-17T16:24:36.000Z",
    "title": null,
    "text": "Nextdoor makes it extremely easy to charge my credit card for their Ads/Pro service, but nearly impossible to cancel the plan, remove my payment information, or speak to a live repre..."
  },
  {
    "author": "Sierra Frost",
    "rating": 1,
    "date": "2025-05-26T15:15:36.000Z",
    "title": null,
    "text": "Ableist bigots. \nSupport and allow doxxing.\nAid in targeting community members and even support law enforcement and elected officials to target them, making life incredibly dangerous for vulnera..."
  },
  {
    "author": "JAMES CAMPBELL",
    "rating": 1,
    "date": "2025-05-16T14:45:35.000Z",
    "title": null,
    "text": "The people running this app in the ANTIOCH TN area are terrible people. They remove protest they don't agree with and keep what they do, they will have your whole page deleted if you start gaining to..."
  },
  {
    "author": "Queen Riser",
    "rating": 1,
    "date": "2025-09-05T01:06:48.000Z",
    "title": null,
    "text": "This organisation has breached the Privacy and Electronics Communications Regulations.\nThey have been sending me their newsletter and other marketing correspondence that I had not..."
  },
  {
    "author": "Tom Mendez",
    "rating": 1,
    "date": "2025-05-23T15:07:15.000Z",
    "title": null,
    "text": "I’ve had the same negative experience as others. There is no appropriate process in place to stop your competitors from complaining—falsely—about your posts/ads. The only action that Nextdoor takes to..."
  },
  {
    "author": "Steve T",
    "rating": 1,
    "date": "2025-08-26T17:47:49.000Z",
    "title": "Nextdoor is biased and Desriminatory",
    "text": "My experience with is that the moderators are extremely biased and the minute they don't agree with a statement they will begin to pick on you and remove almost everything you post very discriminatory practices I have cases open with customer service and they don't want to address the issues they just giving the same old Democratic bait and switch runaround I would not recommend this app to anyone that likes truth or honesty or clear communication it is a Karen based liberal judge all site to limit people's free speech and Fourth amendment right"
  },
  {
    "author": "Cheryl",
    "rating": 1,
    "date": "2025-08-26T03:44:40.000Z",
    "title": "NextDoor.com - ZERO STARS",
    "text": "I'd give NextDoor.com ZERO stars if I could. They deactivated my account saying my name wasn't verifiable. And I'm not giving them a copy of my ID or some other private document just so I can read about dog poop left in someone's yard or someone wondering if a firework was a gun shot (eye roll). Then they said I violated privacy rules when I posted a driver's license plate. License plates are all around us on PUBLIC streets. Literally cars and their plates are in the public. The NextDoor moderators are inconsistent, biased, often censoring, and give vague reasons for their decisions as well. It's a clown site, don't bother."
  },
  {
    "author": "Kylie Clifton",
    "rating": 1,
    "date": "2025-08-25T00:23:17.000Z",
    "title": "Avoid",
    "text": "Avoid, with a capital 'A'."
  },
  {
    "author": "Unhappy",
    "rating": 1,
    "date": "2025-08-23T22:05:13.000Z",
    "title": "There isn't a minus zero star",
    "text": "There isn't a minus zero star? There should be. This is a playground for  high school girls given the title of moderator. They have no clue that that are being used by corporate for financial profit, and if they did,they wouldn't care. Ignorance breeds more ignorance. This app is is a toxic cesspool for the emotionally insecure. Some of the users, that's another story, but the unpaid, untrained, unqualified leaders and moderators, now that's an unheathier group. Shame on this for profit corporation for using and shaming it's users."
  },
  {
    "author": "Frank Gleason",
    "rating": 1,
    "date": "2025-08-23T03:27:25.000Z",
    "title": "Thieves",
    "text": "Thieves, do not work with them no costomer serviece money grab"
  },
  {
    "author": "Jim A",
    "rating": 1,
    "date": "2025-08-20T20:34:37.000Z",
    "title": "It's just a Hateful social media site now",
    "text": "It's just a social media site now. Neighbors complaining about neighbors, political fights, public shaming of people you don't like. Like X the rude and hateful have taken over. There must be someplace to go to just be a community and share what's good about your neighborhood, but Next Door isn't it."
  },
  {
    "author": "La Tonya",
    "rating": 1,
    "date": "2025-08-19T21:07:51.000Z",
    "title": "Nextdoor, a major disappointment on a EPIC SCALE!",
    "text": "I started using Nextdoor when I lived in the UK & was over the moon having found a community based app which was extremely helpful because I travel a lot & posted frequently. It was brilliant & helpful in finding someone to look after my flat whilst traveling or visiting my family in the US. In 2019 my dad suffered a health crisis & I returned to the US to take care of him & signed up for Nextdoor in the NC area which was great at first Unfortunately, over time the post from users became increasingly rude, threatening, disrespectful & down right nasty & spiteful. Recently I chimed in on an ongoing thread from a neighbour who lives in Carolina Trace in NC & was told to mind my business & then received a DM saying Animal Control was coming for me. I was literally dumbfounded & highly offended. But what was more disturbing was Nextdoor continued to allow this person to continue his tirade of abuse & disrespect on an app that is meant to bring communities together….so I deactivated my account & will never reactivate it again. What a shame & definitely shame on Nextdoor."
  },
  {
    "author": "R Tims",
    "rating": 1,
    "date": "2025-08-16T23:48:07.000Z",
    "title": "Biased hacks censoring civil debate",
    "text": "Biased hacks censoring civil debate. When you’re in groups among people who politically battle they will only block and remove the people who they don’t politically align with. What a stupid app ran by the most ignorant people. Trash"
  },
  {
    "author": "Shawn",
    "rating": 1,
    "date": "2025-08-13T18:59:39.000Z",
    "title": "TitlePlatform Suppression, No Support Response",
    "text": "Title: Platform Suppression, No Support Response, Documented Harm to Registered Business Review: As the owner/operator of a registered LLC providing grooming services and civic satire, I relied on Nextdoor for local outreach and community engagement. After posting content that challenged local norms—within legal bounds and platform guidelines—my account was abruptly flagged and suppressed without warning or explanation. I submitted a formal demand for reinstatement and itemized restitution, citing business harm and expressive obstruction. To date, I have received no response from support, despite multiple follow-ups. This silence has directly impacted my ability to operate, advertise, and maintain client relationships. Nextdoor’s lack of transparency, failure to honor basic support protocols, and disregard for small business users raise serious concerns. Their moderation practices appear arbitrary and unaccountable, with no clear path for remedy or appeal. I am documenting this for potential arbitration and public disclosure. I urge other small business owners and civic voices to proceed with caution when relying on this platform for outreach."
  },
  {
    "author": "CHILL",
    "rating": 1,
    "date": "2025-08-13T17:29:36.000Z",
    "title": "Racist Criminial Administrators",
    "text": "Nextdoor is managed by a bunch of racist criminal’s whose main goals are protecting other racist criminals."
  },
  {
    "author": "Debbie",
    "rating": 1,
    "date": "2025-08-07T22:46:40.000Z",
    "title": "Next door is a left -wing propaganda app",
    "text": "If your comments are in the least middle of the road to right leaning you get banned from the app.  This app is not neutral.  It is a left wing propaganda app.  I never posted anything , I just responded to left wing propaganda that has been proven to be wrong.  Because I gave actual proof in my comments I was blocked from that conversation and then eventually banned.  Unless you agree with everything these radicals believe you are kicked off the app."
  },
  {
    "author": "CustomerAJ",
    "rating": 1,
    "date": "2025-08-06T00:37:27.000Z",
    "title": "Brigading and False Reporting Welcome",
    "text": "Due to an unknown amount of people false reporting my account, I was suspended and asked to verify my address. I sent pictures of my mail. The agent I spoke with said the name on my mail does not match the name on my account (I used a different spelling of my last name). I let him know I'm using a different spelling for safety reasons as I am currently in the process of filing a restraining order for someone that's stalking me. The stalker has made credible threats against me (I will ruin you), has attempted to blackmail me, and has contacted my friends and family in order to discredit me. This agent himself (Jeremy) decided to re-report my already suspended account for not using my legal name. And now this agent demands I send him a picture of my ID (which I had already provided at this point). I'm not sure why the agent is being like this, but it essentially makes it look like he's part of the brigade mob. So basically they will tolerate users filing blatantly false reports, and make the victim jump through a ridiculous amount of hoops just to try to get access to their account back. All while providing zero repercussions for the people falsely accusing"
  },
  {
    "author": "Ben L",
    "rating": 1,
    "date": "2025-08-05T06:05:10.000Z",
    "title": "Nextdoor-no longer a platform for civil dialogue",
    "text": "Nextdoor is no longer a platform for civil dialogue — it’s being used as a tool of political suppression, especially in places like Spokane Valley. As a long-time resident and civic advocate, I’ve had multiple First Amendment-protected City Council speeches removed — even after I followed Nextdoor Support’s own instructions. Meanwhile, known supporters of a banned public official (CM Al Merkel) continue to post coordinated attacks, false claims, and targeted harassment — including content that constitutes libel under civil law — with no action taken against them. Nextdoor claims to support “respectful, local conversation,” but their system rewards group flagging, insider moderation, and silencing of dissent. They ignore clear violations of their own Community Guidelines while punishing whistleblowers for telling the truth. What happened to transparency? Fairness? Accountability? If you value your voice, don’t rely on Nextdoor. It’s no longer a neutral community platform — it’s a rigged, politically manipulated echo chamber. Shame on Nextdoor for allowing it."
  },
  {
    "author": "J-CAT",
    "rating": 1,
    "date": "2025-08-02T05:39:55.000Z",
    "title": "Aggravating to say the least",
    "text": "Aggravating to say the least! I've been kicked off twice simply for disagreeing with all the Sitanic Left wing nut jobs! I NEVER cursed or said anything disrespectful (even though THEY did!) One person said they would \"pray\" for someone who was completely irate & full of hate and the evil nut job responded with \"please don't\" and expressed over several comments that they worship the devil and are happy doing so, etc. So my comment was simply \"don't waste your prayers on someone like that\" and I was banned for life from the app!!! WTH?? I'm sorry but screw this app!"
  },
  {
    "author": "customer",
    "rating": 1,
    "date": "2025-08-01T21:50:43.000Z",
    "title": "Biased",
    "text": "Biased, Discriminatory, and Dangerous Nextdoor pretends to be a neutral neighborhood forum, but instead it operates as a politically slanted platform that routinely censors conservative viewpoints while shielding progressive content from punishment. •\tI was repeatedly suspended, including for using the term “illegal alien” in response to a post encouraging interference with ICE agents conducting official duties. That post remained live—mine was removed.  I was next suspended for responding to a left wing political post not only bashing the federal government, but included inflammatory antisemitic comments and gross misinformation.  Despite reporting it, Nextdoor allowed the comment to stand while suspending me for my response. •\tThese suspensions resulted in over $5,000 in lost business, disrupted critical network connections, and interrupted my pro bono animal rescue efforts likely resulting in priceless loss of animal life due to delayed placements. •\tNextdoor’s behavior misrepresents itself as a neutral public square while enforcing a progressive viewpoint, which is arguably deceptive under FTC Act Section 5 and violates consumer protection laws. I’ve already escalated this matter to the FTC, FCC, and BBB, and I encourage others who have experienced similar censorship to do the same."
  },
  {
    "author": "Gunter Kruger",
    "rating": 1,
    "date": "2025-07-31T09:19:00.000Z",
    "title": "1 month ban for corndog and carrot",
    "text": "My account was suspended for a photo of a corn dog and a carrot. Both looked too sexual. The platform doesn't have a lot of traction, and the administrators are probably a hundred years old or sexually frustrated."
  },
  {
    "author": "Eileen Cohen",
    "rating": 1,
    "date": "2025-07-29T01:14:15.000Z",
    "title": "The review team needs to be fired.",
    "text": "The review team needs to be fired."
  },
  {
    "author": "CJ",
    "rating": 1,
    "date": "2025-07-17T16:44:24.000Z",
    "title": "I was selling an item for Sale under…",
    "text": "I was selling an item for Sale under the \"For Sale\" section of Nextdoor.  I did delete it and repost it the next day with changes that needed to be made. Apparently, Nextdoor see this as a \"Do Not Engage in Harmful Activities.\"  I didn't know listing a bedromm suite was harmful to the community. So, I was temporaily banned due to the supposed \"violation.\" I will say Nextdoor is good for the community, but bad when you need to make a change that has nothing to due with nothing in their policy."
  },
  {
    "author": "customer",
    "rating": 1,
    "date": "2025-07-16T03:35:17.000Z",
    "title": "I had Been a member since 2023 then out…",
    "text": "I had Been a member since 2023 then out of the blue my account was suspended it said another member of the team said I was using a false name took me around 45 mins to send copy of my driving licence and libary card u was very offended by this allegation  then I was put in to a security check where you verify squares with Buses/bikes/traffic lights it went in for more this 10 mins I thought I had sent items but never got verification so had to go through the whole thing again I did this again up to 45 mins They didn’t even acknowledge my reply sent so I said this was very rude they also changed from member report to from time to time we check but to date I still have not received a response I find this poor practise and bad manners I was born in Hammersmith I have lived in Hammersmith since 92 I B am very offended and to make such akkergations then not not good buisness practices beware app is also very very slow !!!as well"
  },
  {
    "author": "JOE BLACK",
    "rating": 1,
    "date": "2025-07-15T23:56:53.000Z",
    "title": "Their so-called “community guidelines”…",
    "text": "Their so-called “community guidelines” are subjective according to the leftist weenies on the app. If you state a fact that some weenie doesn’t like, the suspend your account.  I was suspended for stating the fact that my rights exist bc I and an American citizen and that due process is reserved for citizens not illegal immigrants. Of course that is offensive to those that agree with open borders and that the taxpayers are obligated to pay their way.  But, it’s not discriminatory and more that a speed limit sign is to someone speeding excessively.   The guidelines, as they are, actually are to mold your opinions, and the facts, to theirs. And, it’s becoming nothing but a classified listing posing as neighborhood posts and fake reviews.  Occasionally, you can get some good information, but even that is disappearing."
  },
  {
    "author": "AV",
    "rating": 1,
    "date": "2025-09-30T01:14:24.000Z",
    "title": null,
    "text": "This platform is biased and makes it a habit of silencing conservative views. My response post (ie. I didn't start the conversation) was an equal response to the original, opposing comment. However, I..."
  },
  {
    "author": "Kathryn Rubenstein",
    "rating": 1,
    "date": "2025-09-29T03:09:54.000Z",
    "title": null,
    "text": "NEXTDOOR is the worst online experience I’ve ever had. It’s biased against Democrats and has been infiltrated by MAGA. They post inflammatory political posts, which is not allowed, and the moderators..."
  },
  {
    "author": "Charles Hunter",
    "rating": 1,
    "date": "2025-09-21T16:45:07.000Z",
    "title": null,
    "text": "Please , please, if you value any semblance of privacy, DO NOT!! I repeat DO NOT!! sign up with this highly intrusive supposed neighborhood app! There is absolutely no way that I’ve found to unsubscri..."
  },
  {
    "author": "Niel Flamm",
    "rating": 1,
    "date": "2025-09-20T12:06:04.000Z",
    "title": null,
    "text": "I used to enjoy the app in the city of Henderson,NV the Inspirada Neighborhood. I had no problems with the moderators. In the city of Mount Pleasant, South Carolina I'm on my 5th Suspension. I believe..."
  },
  {
    "author": "Dana R.",
    "rating": 1,
    "date": "2025-09-10T11:20:45.000Z",
    "title": null,
    "text": "Horrible app! Since their \"revamp\" my 7 year old acct was suspended pending name verification. They then DELETED almost 200 items I had listed in the Buy and Sell section. When my acct was reactivated..."
  },
  {
    "author": "Jess Foster",
    "rating": 1,
    "date": "2025-09-21T22:46:04.000Z",
    "title": null,
    "text": "Terrible. Most biased platform I have ever used, saturated with backyard animal breeders and those seeking any kind of job they can get or money out of desperation. I don’t recommend."
  },
  {
    "author": "Zan Mayo Glodich",
    "rating": 1,
    "date": "2025-09-29T20:18:56.000Z",
    "title": null,
    "text": "My opinion about a local restaurant was posted in response to an inquiry.  It turned out that the original poster was the owner of the restaurant but he had not identified himself as such.  There was..."
  },
  {
    "author": "Cheryl",
    "rating": 1,
    "date": "2025-08-26T03:44:40.000Z",
    "title": null,
    "text": "I'd give NextDoor.com ZERO stars if I could. They deactivated my account saying my name wasn't verifiable. And I'm not giving them a copy of my ID or some other private document just so I can read abo..."
  },
  {
    "author": "Kathleen Casey",
    "rating": 1,
    "date": "2025-09-03T20:57:13.000Z",
    "title": null,
    "text": "I have had NextDoor for years, never have I been suspended but today I am.  I replied to two different hateful and racist comments on my post and I am suspended.  All over a boy who is using the girls..."
  },
  {
    "author": "Unhappy",
    "rating": 1,
    "date": "2025-08-23T22:05:13.000Z",
    "title": null,
    "text": "There isn't a minus zero star? There should be. This is a playground for  high school girls given the title of moderator. They have no clue that that are being used by corporate for financial profit,..."
  },
  {
    "author": "A Rising Virgo",
    "rating": 1,
    "date": "2025-09-28T20:38:47.000Z",
    "title": null,
    "text": "this app is literally filled with nazis, racist, bigoted people who claim to be good neighbors. This app breeds misinformation and those who created the app are also racist and responsible for this be..."
  },
  {
    "author": "Mrz DeeDee",
    "rating": 1,
    "date": "2025-09-28T05:53:23.000Z",
    "title": null,
    "text": "Unfortunately, this app fosters a mob mentality and a mean-girl high school vibe. If you write something that the neighbors disagree with, the entire neighborhood comes for you. There is no moderator..."
  },
  {
    "author": "Sue M",
    "rating": 1,
    "date": "2025-09-19T19:19:46.000Z",
    "title": null,
    "text": "It's changed and all ads now. Repeating ads and rhe hide feature doesnt work.  They always say they will let the developers know when you email them. The developers dont do anything,obviously.  Look a..."
  },
  {
    "author": "Aletheos Oratos",
    "rating": 1,
    "date": "2025-06-28T14:22:47.000Z",
    "title": null,
    "text": "Heavy censorship. Massive bias against conservatives. FAKE players in groups who patrol and dog pile you if you criticize democrat policy. The instant you criticize their toxic behavior, you get banne..."
  },
  {
    "author": "Jim A",
    "rating": 1,
    "date": "2025-08-20T20:34:37.000Z",
    "title": null,
    "text": "It's just a social media site now. Neighbors complaining about neighbors, political fights, public shaming of people you don't like. Like X the rude and hateful have taken over. There must be someplac..."
  },
  {
    "author": "Nicola Carr",
    "rating": 1,
    "date": "2025-06-09T20:22:49.000Z",
    "title": null,
    "text": "Increasingly prejudice vigilante type people on ND. People getting away with showing video footage of supposed dodgy people. It's curtain twitchers heaven ,throw in xenophobia,racist,classist content..."
  },
  {
    "author": "Kristina",
    "rating": 1,
    "date": "2025-05-21T22:49:49.000Z",
    "title": null,
    "text": "Avoid using it, it’s a trash you can’t post anything, there will be always someone reporting constantly local users to be banned for all daft reasons. I was using it I got banned because someone repor..."
  },
  {
    "author": "C Cruvineli Agnes",
    "rating": 1,
    "date": "2025-05-29T00:07:40.000Z",
    "title": null,
    "text": "THESE XENOFOBICS LUNATICS LEFTISTS. I reported a post who's guy is calling the President Trump corrupt and other bad words and provoked conflicts between the neighbors. The moderators and the rules sa..."
  },
  {
    "author": "miguel banda",
    "rating": 1,
    "date": "2025-05-18T19:09:25.000Z",
    "title": null,
    "text": "You get censored or banned for anything on this lame app. It's worse than facebook during the Biden years with the North Korea censorship, and even worse, they don't apply their rules evenly. They'll..."
  },
  {
    "author": "Ken C",
    "rating": 1,
    "date": "2025-09-13T06:02:57.000Z",
    "title": null,
    "text": "This is my 10th time + unsubscribing to Nextdoor. They keep sending me unsolicited emails. They are one of the worst offenders. Can’t trust a company that keeps violating settings."
  },
  {
    "author": "J-CAT",
    "rating": 1,
    "date": "2025-08-02T05:39:55.000Z",
    "title": null,
    "text": "Aggravating to say the least! I've been kicked off twice simply for disagreeing with all the Sitanic Left wing nut jobs! I NEVER cursed or said anything disrespectful (even though THEY did!) One perso..."
  },
  {
    "author": "douglas strand",
    "rating": 1,
    "date": "2025-05-13T16:00:56.000Z",
    "title": null,
    "text": "As an ex moderator reporting insulting/ rude/agresive behaviour \ntoo many times 'those above me' deemed the reports ill founded \neven when some posters were openly breaking UK laws\n.\nthen one..."
  },
  {
    "author": "Angela Read-Meshil",
    "rating": 1,
    "date": "2025-05-18T18:15:59.000Z",
    "title": null,
    "text": "It’s a shockingly poorly moderated platform. It houses a bed of ignorant racists who are allowed to insult moderately minded people. They openly allow right-wing and fascist ideology pedalled by obvio..."
  },
  {
    "author": "Bellflower",
    "rating": 1,
    "date": "2025-09-16T07:02:11.000Z",
    "title": null,
    "text": "Moderators are r acist.  They're perfectly fine allowing people to be  r acist but ones we stand up for ourselves,  we get suspended"
  },
  {
    "author": "Mark Eckelkamp",
    "rating": 1,
    "date": "2025-07-01T08:43:00.000Z",
    "title": null,
    "text": "Remove user moderators and leads.  They band together to control their ideology and views. Nextdoor has a poorly AI based system that is horribly corrupted and flawed. Allow individual users to block..."
  },
  {
    "author": "J B",
    "rating": 1,
    "date": "2025-04-07T15:17:02.000Z",
    "title": null,
    "text": "Nextdoor continues to break their own rules and allows Trump/Musk protest propaganda to be posted on the main feed. Would they allow Trump/Musk rallies to be posted on the main feed? Highly unlikely a..."
  },
  {
    "author": "CAROL SHORE",
    "rating": 1,
    "date": "2025-04-07T10:11:00.000Z",
    "title": null,
    "text": "This site should put in its guidelines \"we support Trump and thats it\"I was upset that he played golf instead of meeting the plane carrying 4 dead soldiers who died in Lithuania and said so.I was susp..."
  },
  {
    "author": "Debbie",
    "rating": 1,
    "date": "2025-08-07T22:46:40.000Z",
    "title": null,
    "text": "If your comments are in the least middle of the road to right leaning you get banned from the app.  This app is not neutral.  It is a left wing propaganda app.  I never posted anything , I just respon..."
  },
  {
    "author": "Peach Rose",
    "rating": 1,
    "date": "2025-09-15T03:39:51.000Z",
    "title": null,
    "text": "I’ve been on Nextdoor for nearly a decade, and it’s disheartening to see how much it’s changed. What once felt like a friendly, casual place for neighbors to share information has turned into a..."
  },
  {
    "author": "Alice",
    "rating": 1,
    "date": "2025-07-10T23:32:46.000Z",
    "title": null,
    "text": "Nextdoor is a platform is run by true fascists, enemies of free speech. There's heavy censorship. They removed my post, where I stated a historical fact, labeling it as 'discrimination', while allowin..."
  },
  {
    "author": "Ron Hammelman",
    "rating": 1,
    "date": "2025-05-08T22:29:17.000Z",
    "title": null,
    "text": "Well the ND moderators did it to me again, suspension for 1 month because I dared to speak what was on my mind responding to insulting or rude comments.  Reason this time was Non-Local Political issue..."
  },
  {
    "author": "Laurence",
    "rating": 1,
    "date": "2025-05-23T23:22:40.000Z",
    "title": null,
    "text": "It is a haven for racists. The moderation is appalling and there is a pronounced bias for racism and parties on the far right. I tested my theory by using the exact same wording used by supporters of..."
  },
  {
    "author": "Rachel Wonos",
    "rating": 1,
    "date": "2025-05-18T16:15:00.000Z",
    "title": null,
    "text": "I’d give zero stars if possible! Disgusting site run by TDS liberals who don’t even hide their bias! Conservatives who express support for Pres Trump get suspended for no reason, while liberals who po..."
  },
  {
    "author": "Darhlene Zeanwick",
    "rating": 1,
    "date": "2025-06-23T10:30:18.000Z",
    "title": null,
    "text": "NextDoor - The Place for NonThinkers - Heavy on the ads. Heavy on the censorship. Users access only to report on neighbors. Watched by LEOs. They send letters to neighbors with your name inviting them..."
  },
  {
    "author": "R Tims",
    "rating": 1,
    "date": "2025-08-16T23:48:07.000Z",
    "title": null,
    "text": "Biased hacks censoring civil debate. When you’re in groups among people who politically battle they will only block and remove the people who they don’t politically align with. What a stupid app ran b..."
  },
  {
    "author": "Sandy Miller",
    "rating": 1,
    "date": "2025-07-21T12:36:56.000Z",
    "title": null,
    "text": "Hired a workman from this Nextdoor website who took photos of our property without our knowledge. He then used these photo to advertise his work which clearly is a breach of our privacy. We infor..."
  },
  {
    "author": "CJ",
    "rating": 1,
    "date": "2025-07-17T16:44:24.000Z",
    "title": null,
    "text": "I was selling an item for Sale under the \"For Sale\" section of Nextdoor.  I did delete it and repost it the next day with changes that needed to be made.\nApparently, Nextdoor see this as a \"Do Not..."
  },
  {
    "author": "Bryan K",
    "rating": 1,
    "date": "2025-06-15T03:19:10.000Z",
    "title": null,
    "text": "In Plano, TX the posting management is terribly biased.  Someone can post, as an example, that Trump takes bribes and pockets the money.  If corrected, politely, to such an absurd statement and correc..."
  },
  {
    "author": "Mike White",
    "rating": 1,
    "date": "2025-09-14T02:51:23.000Z",
    "title": null,
    "text": "Very biased in favor of leftists. They delete truthful comments all the time. If it does not comply with leftist ideals it will get deleted."
  },
  {
    "author": "Bob Tinker",
    "rating": 1,
    "date": "2025-07-15T01:12:57.000Z",
    "title": null,
    "text": "Constant censorship, if they don’t agree with your view, they remove even when you’re in the right. Pro American,Gun,Fireworks,Free Speech, Republican, this is NOT the place for you"
  },
  {
    "author": "Gunter Kruger",
    "rating": 1,
    "date": "2025-07-31T09:19:00.000Z",
    "title": null,
    "text": "My account was suspended for a photo of a corn dog and a carrot. Both looked too sexual. The platform doesn't have a lot of traction, and the administrators are probably a hundred years old or sexuall..."
  },
  {
    "author": "La Tonya",
    "rating": 1,
    "date": "2025-08-19T21:07:51.000Z",
    "title": null,
    "text": "I started using Nextdoor when I lived in the UK & was over the moon having found a community based app which was extremely helpful because I travel a lot & posted frequently. It was brilliant & helpfu..."
  },
  {
    "author": "CustomerAJ",
    "rating": 1,
    "date": "2025-08-06T00:37:27.000Z",
    "title": null,
    "text": "Due to an unknown amount of people false reporting my account, I was suspended and asked to verify my address. I sent pictures of my mail. The agent I spoke with said the name on my mail does not..."
  },
  {
    "author": "Marcus",
    "rating": 1,
    "date": "2025-09-17T16:24:36.000Z",
    "title": null,
    "text": "Nextdoor makes it extremely easy to charge my credit card for their Ads/Pro service, but nearly impossible to cancel the plan, remove my payment information, or speak to a live repre..."
  },
  {
    "author": "Sierra Frost",
    "rating": 1,
    "date": "2025-05-26T15:15:36.000Z",
    "title": null,
    "text": "Ableist bigots. \nSupport and allow doxxing.\nAid in targeting community members and even support law enforcement and elected officials to target them, making life incredibly dangerous for vulnera..."
  },
  {
    "author": "JAMES CAMPBELL",
    "rating": 1,
    "date": "2025-05-16T14:45:35.000Z",
    "title": null,
    "text": "The people running this app in the ANTIOCH TN area are terrible people. They remove protest they don't agree with and keep what they do, they will have your whole page deleted if you start gaining to..."
  },
  {
    "author": "Queen Riser",
    "rating": 1,
    "date": "2025-09-05T01:06:48.000Z",
    "title": null,
    "text": "This organisation has breached the Privacy and Electronics Communications Regulations.\nThey have been sending me their newsletter and other marketing correspondence that I had not..."
  },
  {
    "author": "Tom Mendez",
    "rating": 1,
    "date": "2025-05-23T15:07:15.000Z",
    "title": null,
    "text": "I’ve had the same negative experience as others. There is no appropriate process in place to stop your competitors from complaining—falsely—about your posts/ads. The only action that Nextdoor takes to..."
  },
  {
    "author": "Bob Tinker",
    "rating": 1,
    "date": "2025-07-15T01:12:57.000Z",
    "title": "Constant censorship, hate to Conservatives",
    "text": "Constant censorship, if they don’t agree with your view, they remove even when you’re in the right. Pro American,Gun,Fireworks,Free Speech, Republican, this is NOT the place for you"
  },
  {
    "author": "GES",
    "rating": 1,
    "date": "2025-07-12T01:02:07.000Z",
    "title": "Horrible!!",
    "text": "Horrible!! Can’t stand how woke they are!!"
  },
  {
    "author": "Alice",
    "rating": 1,
    "date": "2025-07-10T23:32:46.000Z",
    "title": "Extreme FAR LEFT FASCISTS platform",
    "text": "Nextdoor is a platform is run by true fascists, enemies of free speech. There's heavy censorship. They removed my post, where I stated a historical fact, labeling it as 'discrimination', while allowing a far-left fascist to post insults and express hatred toward white people.  Do not trust these people, they are harmful and destructive to society, they are the cancer of this world."
  },
  {
    "author": "MIH",
    "rating": 1,
    "date": "2025-07-10T20:52:05.000Z",
    "title": "Nextdoor Silences Users Without Due Process",
    "text": "I recently had my Nextdoor account suspended without warning after a post I shared was removed for allegedly being \"non-local\". My post was respectful and intended to engage the community on a topic I care about. It was not divisive, harmful, or offensive. What's frustrating is that I received no real explanation or chance to clarify before being completely locked out of my account. I was given an option to appeal, but the system feels automated and dismissive. Platforms like Nextdoor claim to build community, but in my experience, they suppress open dialogue, especially when a post doesn’t conform to vague or inconsistently enforced guidelines. There seems to be no accountability, transparency, or real human review. If you're considering joining Nextdoor, know that your account can be restricted without fair notice. Content moderation lacks consistency, and respectful opinions can be taken down arbitrarily. This is especially disappointing for people who genuinely want to engage locally but also care about broader issues that affect us all. I hope Nextdoor re-evaluates how it handles moderation and appeals. Real community isn’t built by silencing voices—it’s built through honest, respectful dialogue."
  },
  {
    "author": "Rannee Collins",
    "rating": 1,
    "date": "2025-07-09T18:13:04.000Z",
    "title": "Nextdoor has really gone down hill over…",
    "text": "Nextdoor has really gone down hill over the years. It use to be proactive community now it's nothing but stockers, people posting about thefts, mods that freely take down what ever the hell they please, some mods just take down random posts without a thought, my next door has become very political one way or the other depending on the group of people, my nextdoor encourages in-person harassing and stocking if a post goes viral and no one being likes yelled at for speaking common courtesy, many posts are about missing animals, ours started getting spammed with business trying to cull the neighborhood for business some good but a lot scams, a lot of people posting images of crimes being committed but doing nothing to really denture it, hoa's becoming bullies to neighbors about rules and yelling at neighbors on social media to \"end this\", to this site being one big ad, I see a lot of theft sales on the market place and the mods don't take any of it down.... If T. didn't politicalize masks and wearing of it'd be nice to post the courtesy of mask wearing. If you're going to chin wear it just take it off you look foolish and does you zero good. This website does more harm than good. I am careful what I post and reply to not identify my self but some how people figured it out and I had to terminate one account and sign up again. I hate how difficult it is to sign up and they only allow so many uses of the same number. I had to get a couple google voice numbers to compensate this bs. Next door didn't use to use 2 step and it's a pain to swap neighborhoods. One account got  frozen and never got an update so I had to generate a new one under my address. This site does not like it when you use a business. Many times I've been in transition or did not feel comfortable giving this place all my personal info and challenged me a few times. I have one for work and one locally and the system hates this. I've stopped using nextdoor to the degree I use to. Just like reddit people want to hear what they want to hear and don't like it when they have to accept \"reality\" or the \"rules of reality\". It's sad how far this site has fallen."
  },
  {
    "author": "Sandy Miller",
    "rating": 1,
    "date": "2025-07-21T12:36:56.000Z",
    "title": "Hired a workman from this Nextdoor…",
    "text": "Hired a workman from this Nextdoor website who took photos of our property without our knowledge. He then used these photo to advertise his work which clearly is a breach of our privacy. We informed next-door Head Office numerous times who have done nothing to remove the photo. We also flagged it up with their internal complaints procedure and emailed their DPO department yet the photo is still up being used to advertise this persons work. Our home is clearly abled to be identified from this unauthorised photo which leaves us compromised and vulnerable, but the next-door moderators do not appear to care. So Be warned. We are now forced to live in constant fear of burglary. This website has made us an easy target. We do not recommend and will be deleting our account with them if this photo remains. Update 21/07/25 Photo still remains. Total abuse of my privacy and safety approved by Nextdoor. Avoid!"
  },
  {
    "author": "Mark Eckelkamp",
    "rating": 1,
    "date": "2025-07-01T08:43:00.000Z",
    "title": "Remove user moderators and leads",
    "text": "Remove user moderators and leads.  They band together to control their ideology and views. Nextdoor has a poorly AI based system that is horribly corrupted and flawed. Allow individual users to block keywords they find offensive. If a user does not want to see anything politically based then grant the user to block the word. If a user does not want to see anything based on sexual orientation allow them to filter and prevent the view. It’s simple. Give more control to the user. This would help prevent someone from being offended if they don’t like the word MAGA, POTUS, Biden or Christian. Simple. If they don’t want to see it then that is their right to."
  },
  {
    "author": "Steve",
    "rating": 1,
    "date": "2025-06-29T04:04:10.000Z",
    "title": "EXTERM FAR LEFT IDEOLOGICAL PLATFORM",
    "text": "EXTERM FAR LEFT IDEOLOGICAL PLATFORM.  They censor all non fat left thoughts while leaving up ALL fascist comments"
  },
  {
    "author": "Kevin",
    "rating": 1,
    "date": "2025-06-28T14:59:39.000Z",
    "title": "Avoid Brody HVAC",
    "text": "I wanted readers to be aware of the unpleasant experience with Brody HVAC.  I had two vents with no air coming out of them. The Brody tech came and determined I needed to replace a damper.  The price was reasonable although I was surprised that the service charge was not going to the cost of repairs.  So be prepared to pay $85 more than most competing companies.  Brody came to make the repairs and when they finished three vents had no air coming out of them.  I pointed this out to the repair person.  Unfortunately, I had to leave so I told the tech that they would have to return to fix the problem and I’d pay at that time.  The next day I was told someone was on their way to my house. To my surprise it was the owner of the company.  Rather than taking a “how can we make this right” approach to the situation, he had a confrontational demeaner and took the attitude that the damper that was not working was old and probably stopped working while the tech was there.  I said I felt this was too much of a coincidence to be the case.  Rather than arranging for a return trip from one of their repair people, he said I would have to pay the service fee and it would be waived if they were actually at fault.  I encouraged him to at least look at the control panel to see if any wires were dislodged, he showed me that there were two loose wires, but in his opinion, they may have been there from some previous repair and probably did nothing.  Since these wires were the source of the problem, my only assumption is that the owner does not understand how these multi-zoned control boards work, otherwise he would have seen that this was the problem and corrected it.  I went ahead and set up an appointment for a tech to come to the house and while on the way over the owner called me to tell me that the tech would not come unless I immediately paid the invoice.  I told him I planned to pay while he was at my house.  He obviously didn’t trust me and demanded payment.  I felt over a barrel and paid as demanded.  Unsurprisingly the tech came and quickly realized that the first tech that came to the house had disconnected the damper (hence the two unattached wires at the control panel that the owner noticed) and all that needed to be done was reconnect them.  Guess what?  All three vents now worked fine.  My point is that if you believe you should pay for a service whether it is done correctly or not, then Brody is your kind of company.  However, if you think the service should be paid for only if you are satisfied with the results then I would recommend you look elsewhere.  If you withhold payment due to poor service, be warned that you will receive a visit from the owner of the company who will demand payment before doing anything to address your complaints.  His tech people are fantastic, The owner, not so much.  He needs to concentrate on customer satisfaction rather than play the part of a collection agency.  He also needs to get some basic training from his techs on how to make repairs to a multi-zoned control panel!!"
  },
  {
    "author": "Aletheos Oratos",
    "rating": 1,
    "date": "2025-06-28T14:22:47.000Z",
    "title": "Heavy censorship",
    "text": "Heavy censorship. Massive bias against conservatives. FAKE players in groups who patrol and dog pile you if you criticize democrat policy. The instant you criticize their toxic behavior, you get banned. They want ID to join but require none if you parrot the democrat party line. The owners are all Leftwing nut jobs and budding tyrants."
  },
  {
    "author": "Smarty Pants",
    "rating": 1,
    "date": "2025-06-25T01:53:32.000Z",
    "title": "Nextdoor is weird.",
    "text": "The people running the show are weird. They let you join without a problem then a couple of months later they suspended indefinitely for my profile name and never was I asked for my birth name. I tried to get back in but they want copies of my driver's license and so hell no they are getting to personal. Just so I can see what is going on in the neighborhood. I see people using nicknames all over. Hmm. But they are making it impossible to delete my account as well. Millions of zero stars for nextdoor."
  },
  {
    "author": "Darhlene Zeanwick",
    "rating": 1,
    "date": "2025-06-23T10:30:18.000Z",
    "title": "NextDoor - The Place for Poorly Educated",
    "text": "NextDoor - The Place for NonThinkers - Heavy on the ads. Heavy on the censorship. Users access only to report on neighbors. Watched by LEOs. They send letters to neighbors with your name inviting them to NextDoor without your authorization. I'd rather use X."
  },
  {
    "author": "Steve Sho",
    "rating": 1,
    "date": "2025-06-19T04:43:58.000Z",
    "title": "The local \"reviewers\" are completely…",
    "text": "The local \"reviewers\" are completely biased and vindictive. Liberals are allowed to post all kinds of ToS violations and conservatives are banned due to hurt feeling. I very trashy site."
  },
  {
    "author": "John Hoolko",
    "rating": 1,
    "date": "2025-06-19T01:55:57.000Z",
    "title": "Terrible left wing site releasing…",
    "text": "Terrible left wing site releasing personal info very dangerous"
  },
  {
    "author": "Bob C",
    "rating": 1,
    "date": "2025-06-19T00:29:51.000Z",
    "title": "Nextdoor Sucks",
    "text": "In New Jersey, you can post endless tiktok videos bashing the president if you respond with any kind of defense your comment is removed (Non-local topic outside a group) 3 day - 30 day ban.  The self policing doesn’t work with radical left TDS sufferers acting as moderators."
  },
  {
    "author": "Bryan K",
    "rating": 1,
    "date": "2025-06-15T03:19:10.000Z",
    "title": "In Plano",
    "text": "In Plano, TX the posting management is terribly biased.  Someone can post, as an example, that Trump takes bribes and pockets the money.  If corrected, politely, to such an absurd statement and correct the person who posted it, you are cut off from communication. Terribly dishonest management."
  },
  {
    "author": "Gary Boisvert",
    "rating": 1,
    "date": "2025-06-14T17:37:13.000Z",
    "title": "There is a mob mentality against any…",
    "text": "There is a mob mentality against any slight bit conservative view on this app.  The moderators are out of control in Western Massachusetts.  If you are a liberal, then you will love this app because you will be part of the mob and be protected and supported by the moderators.  If you you are independent or conservative then I highly recommend not using this app unless you want to constantly fight for almost every post or comment to stay up in the feed and be attacked by the mob.  Let liberals stay in their little bubble or \"safe space\"  they cannot handle the truth unless it agrees with their ideology.  I've contacted support and the CEO about this and sent many examples/screenshots and because of that, they banned my account again.  It's crazy, so save yourself the migranes independents and conservatives...TRUST ME!"
  },
  {
    "author": "Manda Mar",
    "rating": 1,
    "date": "2025-06-13T15:56:37.000Z",
    "title": "Whoever runs this disgusting company…",
    "text": "Whoever runs this disgusting company clearly hates God or anything that eludes to him such as prayer. I posted ONE post since I'd been on there about hearing gun shots late at night (I'd think a community would want to know if there were gun shots right?) Guess not. I said I PRAY everything is ok. Then I receive a snarky comment from some lady saying \"you know who could help with that? The police\" I said \"yes... obviously they were the first in mind but secondly I wanted to warn the community... is that wrong? If I'm mistaken and people don't want to be made aware of a possible shooting I'll take my post down?\" I wake up the next morning to see my account suspended indefinitely. There's something extremely shady going on with this business and I'm not sticking around to find out what it is. Horrible people."
  },
  {
    "author": "Donovan Turner",
    "rating": 1,
    "date": "2025-06-13T09:58:02.000Z",
    "title": "Nextdoor lawsuit",
    "text": "I’m in the process of filing a lawsuit against Nextdoor because they discriminated against me for being gay. I posted a picture of a guy in a jockstrap and they flagged my post. I was bullied for disagreeing with the community guidelines and I cussed at this woman for trying to bully me for speaking my mind. This company is racist. I have my demand letter ready to send to them."
  },
  {
    "author": "Dale Van Witzenberg",
    "rating": 1,
    "date": "2025-06-12T21:49:48.000Z",
    "title": "Prayer is not allowed",
    "text": "It's a shame that you get banned or suspended for asking for prayer. They say some like religion,  some don't,  so they dont allow any. Meaning they take a side against religion. Yet,  they tell you , talk to the people on ND, as if you were face to face with them. All the moderators are very liberal, and you get suspended if you disagree with someone. They can say what they want, but than report you."
  },
  {
    "author": "AV",
    "rating": 1,
    "date": "2025-09-30T01:14:24.000Z",
    "title": null,
    "text": "This platform is biased and makes it a habit of silencing conservative views. My response post (ie. I didn't start the conversation) was an equal response to the original, opposing comment. However, I..."
  },
  {
    "author": "Kathryn Rubenstein",
    "rating": 1,
    "date": "2025-09-29T03:09:54.000Z",
    "title": null,
    "text": "NEXTDOOR is the worst online experience I’ve ever had. It’s biased against Democrats and has been infiltrated by MAGA. They post inflammatory political posts, which is not allowed, and the moderators..."
  },
  {
    "author": "Charles Hunter",
    "rating": 1,
    "date": "2025-09-21T16:45:07.000Z",
    "title": null,
    "text": "Please , please, if you value any semblance of privacy, DO NOT!! I repeat DO NOT!! sign up with this highly intrusive supposed neighborhood app! There is absolutely no way that I’ve found to unsubscri..."
  },
  {
    "author": "Niel Flamm",
    "rating": 1,
    "date": "2025-09-20T12:06:04.000Z",
    "title": null,
    "text": "I used to enjoy the app in the city of Henderson,NV the Inspirada Neighborhood. I had no problems with the moderators. In the city of Mount Pleasant, South Carolina I'm on my 5th Suspension. I believe..."
  },
  {
    "author": "Dana R.",
    "rating": 1,
    "date": "2025-09-10T11:20:45.000Z",
    "title": null,
    "text": "Horrible app! Since their \"revamp\" my 7 year old acct was suspended pending name verification. They then DELETED almost 200 items I had listed in the Buy and Sell section. When my acct was reactivated..."
  },
  {
    "author": "Jess Foster",
    "rating": 1,
    "date": "2025-09-21T22:46:04.000Z",
    "title": null,
    "text": "Terrible. Most biased platform I have ever used, saturated with backyard animal breeders and those seeking any kind of job they can get or money out of desperation. I don’t recommend."
  },
  {
    "author": "Zan Mayo Glodich",
    "rating": 1,
    "date": "2025-09-29T20:18:56.000Z",
    "title": null,
    "text": "My opinion about a local restaurant was posted in response to an inquiry.  It turned out that the original poster was the owner of the restaurant but he had not identified himself as such.  There was..."
  },
  {
    "author": "Cheryl",
    "rating": 1,
    "date": "2025-08-26T03:44:40.000Z",
    "title": null,
    "text": "I'd give NextDoor.com ZERO stars if I could. They deactivated my account saying my name wasn't verifiable. And I'm not giving them a copy of my ID or some other private document just so I can read abo..."
  },
  {
    "author": "Kathleen Casey",
    "rating": 1,
    "date": "2025-09-03T20:57:13.000Z",
    "title": null,
    "text": "I have had NextDoor for years, never have I been suspended but today I am.  I replied to two different hateful and racist comments on my post and I am suspended.  All over a boy who is using the girls..."
  },
  {
    "author": "Unhappy",
    "rating": 1,
    "date": "2025-08-23T22:05:13.000Z",
    "title": null,
    "text": "There isn't a minus zero star? There should be. This is a playground for  high school girls given the title of moderator. They have no clue that that are being used by corporate for financial profit,..."
  },
  {
    "author": "A Rising Virgo",
    "rating": 1,
    "date": "2025-09-28T20:38:47.000Z",
    "title": null,
    "text": "this app is literally filled with nazis, racist, bigoted people who claim to be good neighbors. This app breeds misinformation and those who created the app are also racist and responsible for this be..."
  },
  {
    "author": "Mrz DeeDee",
    "rating": 1,
    "date": "2025-09-28T05:53:23.000Z",
    "title": null,
    "text": "Unfortunately, this app fosters a mob mentality and a mean-girl high school vibe. If you write something that the neighbors disagree with, the entire neighborhood comes for you. There is no moderator..."
  },
  {
    "author": "Sue M",
    "rating": 1,
    "date": "2025-09-19T19:19:46.000Z",
    "title": null,
    "text": "It's changed and all ads now. Repeating ads and rhe hide feature doesnt work.  They always say they will let the developers know when you email them. The developers dont do anything,obviously.  Look a..."
  },
  {
    "author": "Aletheos Oratos",
    "rating": 1,
    "date": "2025-06-28T14:22:47.000Z",
    "title": null,
    "text": "Heavy censorship. Massive bias against conservatives. FAKE players in groups who patrol and dog pile you if you criticize democrat policy. The instant you criticize their toxic behavior, you get banne..."
  },
  {
    "author": "Jim A",
    "rating": 1,
    "date": "2025-08-20T20:34:37.000Z",
    "title": null,
    "text": "It's just a social media site now. Neighbors complaining about neighbors, political fights, public shaming of people you don't like. Like X the rude and hateful have taken over. There must be someplac..."
  },
  {
    "author": "Nicola Carr",
    "rating": 1,
    "date": "2025-06-09T20:22:49.000Z",
    "title": null,
    "text": "Increasingly prejudice vigilante type people on ND. People getting away with showing video footage of supposed dodgy people. It's curtain twitchers heaven ,throw in xenophobia,racist,classist content..."
  },
  {
    "author": "Kristina",
    "rating": 1,
    "date": "2025-05-21T22:49:49.000Z",
    "title": null,
    "text": "Avoid using it, it’s a trash you can’t post anything, there will be always someone reporting constantly local users to be banned for all daft reasons. I was using it I got banned because someone repor..."
  },
  {
    "author": "C Cruvineli Agnes",
    "rating": 1,
    "date": "2025-05-29T00:07:40.000Z",
    "title": null,
    "text": "THESE XENOFOBICS LUNATICS LEFTISTS. I reported a post who's guy is calling the President Trump corrupt and other bad words and provoked conflicts between the neighbors. The moderators and the rules sa..."
  },
  {
    "author": "miguel banda",
    "rating": 1,
    "date": "2025-05-18T19:09:25.000Z",
    "title": null,
    "text": "You get censored or banned for anything on this lame app. It's worse than facebook during the Biden years with the North Korea censorship, and even worse, they don't apply their rules evenly. They'll..."
  },
  {
    "author": "Ken C",
    "rating": 1,
    "date": "2025-09-13T06:02:57.000Z",
    "title": null,
    "text": "This is my 10th time + unsubscribing to Nextdoor. They keep sending me unsolicited emails. They are one of the worst offenders. Can’t trust a company that keeps violating settings."
  },
  {
    "author": "J-CAT",
    "rating": 1,
    "date": "2025-08-02T05:39:55.000Z",
    "title": null,
    "text": "Aggravating to say the least! I've been kicked off twice simply for disagreeing with all the Sitanic Left wing nut jobs! I NEVER cursed or said anything disrespectful (even though THEY did!) One perso..."
  },
  {
    "author": "douglas strand",
    "rating": 1,
    "date": "2025-05-13T16:00:56.000Z",
    "title": null,
    "text": "As an ex moderator reporting insulting/ rude/agresive behaviour \ntoo many times 'those above me' deemed the reports ill founded \neven when some posters were openly breaking UK laws\n.\nthen one..."
  },
  {
    "author": "Angela Read-Meshil",
    "rating": 1,
    "date": "2025-05-18T18:15:59.000Z",
    "title": null,
    "text": "It’s a shockingly poorly moderated platform. It houses a bed of ignorant racists who are allowed to insult moderately minded people. They openly allow right-wing and fascist ideology pedalled by obvio..."
  },
  {
    "author": "Bellflower",
    "rating": 1,
    "date": "2025-09-16T07:02:11.000Z",
    "title": null,
    "text": "Moderators are r acist.  They're perfectly fine allowing people to be  r acist but ones we stand up for ourselves,  we get suspended"
  },
  {
    "author": "Mark Eckelkamp",
    "rating": 1,
    "date": "2025-07-01T08:43:00.000Z",
    "title": null,
    "text": "Remove user moderators and leads.  They band together to control their ideology and views. Nextdoor has a poorly AI based system that is horribly corrupted and flawed. Allow individual users to block..."
  },
  {
    "author": "J B",
    "rating": 1,
    "date": "2025-04-07T15:17:02.000Z",
    "title": null,
    "text": "Nextdoor continues to break their own rules and allows Trump/Musk protest propaganda to be posted on the main feed. Would they allow Trump/Musk rallies to be posted on the main feed? Highly unlikely a..."
  },
  {
    "author": "CAROL SHORE",
    "rating": 1,
    "date": "2025-04-07T10:11:00.000Z",
    "title": null,
    "text": "This site should put in its guidelines \"we support Trump and thats it\"I was upset that he played golf instead of meeting the plane carrying 4 dead soldiers who died in Lithuania and said so.I was susp..."
  },
  {
    "author": "Debbie",
    "rating": 1,
    "date": "2025-08-07T22:46:40.000Z",
    "title": null,
    "text": "If your comments are in the least middle of the road to right leaning you get banned from the app.  This app is not neutral.  It is a left wing propaganda app.  I never posted anything , I just respon..."
  },
  {
    "author": "Peach Rose",
    "rating": 1,
    "date": "2025-09-15T03:39:51.000Z",
    "title": null,
    "text": "I’ve been on Nextdoor for nearly a decade, and it’s disheartening to see how much it’s changed. What once felt like a friendly, casual place for neighbors to share information has turned into a..."
  },
  {
    "author": "Alice",
    "rating": 1,
    "date": "2025-07-10T23:32:46.000Z",
    "title": null,
    "text": "Nextdoor is a platform is run by true fascists, enemies of free speech. There's heavy censorship. They removed my post, where I stated a historical fact, labeling it as 'discrimination', while allowin..."
  },
  {
    "author": "Ron Hammelman",
    "rating": 1,
    "date": "2025-05-08T22:29:17.000Z",
    "title": null,
    "text": "Well the ND moderators did it to me again, suspension for 1 month because I dared to speak what was on my mind responding to insulting or rude comments.  Reason this time was Non-Local Political issue..."
  },
  {
    "author": "Laurence",
    "rating": 1,
    "date": "2025-05-23T23:22:40.000Z",
    "title": null,
    "text": "It is a haven for racists. The moderation is appalling and there is a pronounced bias for racism and parties on the far right. I tested my theory by using the exact same wording used by supporters of..."
  },
  {
    "author": "Rachel Wonos",
    "rating": 1,
    "date": "2025-05-18T16:15:00.000Z",
    "title": null,
    "text": "I’d give zero stars if possible! Disgusting site run by TDS liberals who don’t even hide their bias! Conservatives who express support for Pres Trump get suspended for no reason, while liberals who po..."
  },
  {
    "author": "Darhlene Zeanwick",
    "rating": 1,
    "date": "2025-06-23T10:30:18.000Z",
    "title": null,
    "text": "NextDoor - The Place for NonThinkers - Heavy on the ads. Heavy on the censorship. Users access only to report on neighbors. Watched by LEOs. They send letters to neighbors with your name inviting them..."
  },
  {
    "author": "R Tims",
    "rating": 1,
    "date": "2025-08-16T23:48:07.000Z",
    "title": null,
    "text": "Biased hacks censoring civil debate. When you’re in groups among people who politically battle they will only block and remove the people who they don’t politically align with. What a stupid app ran b..."
  },
  {
    "author": "Sandy Miller",
    "rating": 1,
    "date": "2025-07-21T12:36:56.000Z",
    "title": null,
    "text": "Hired a workman from this Nextdoor website who took photos of our property without our knowledge. He then used these photo to advertise his work which clearly is a breach of our privacy. We infor..."
  },
  {
    "author": "CJ",
    "rating": 1,
    "date": "2025-07-17T16:44:24.000Z",
    "title": null,
    "text": "I was selling an item for Sale under the \"For Sale\" section of Nextdoor.  I did delete it and repost it the next day with changes that needed to be made.\nApparently, Nextdoor see this as a \"Do Not..."
  },
  {
    "author": "Bryan K",
    "rating": 1,
    "date": "2025-06-15T03:19:10.000Z",
    "title": null,
    "text": "In Plano, TX the posting management is terribly biased.  Someone can post, as an example, that Trump takes bribes and pockets the money.  If corrected, politely, to such an absurd statement and correc..."
  },
  {
    "author": "Mike White",
    "rating": 1,
    "date": "2025-09-14T02:51:23.000Z",
    "title": null,
    "text": "Very biased in favor of leftists. They delete truthful comments all the time. If it does not comply with leftist ideals it will get deleted."
  },
  {
    "author": "Bob Tinker",
    "rating": 1,
    "date": "2025-07-15T01:12:57.000Z",
    "title": null,
    "text": "Constant censorship, if they don’t agree with your view, they remove even when you’re in the right. Pro American,Gun,Fireworks,Free Speech, Republican, this is NOT the place for you"
  },
  {
    "author": "Gunter Kruger",
    "rating": 1,
    "date": "2025-07-31T09:19:00.000Z",
    "title": null,
    "text": "My account was suspended for a photo of a corn dog and a carrot. Both looked too sexual. The platform doesn't have a lot of traction, and the administrators are probably a hundred years old or sexuall..."
  },
  {
    "author": "La Tonya",
    "rating": 1,
    "date": "2025-08-19T21:07:51.000Z",
    "title": null,
    "text": "I started using Nextdoor when I lived in the UK & was over the moon having found a community based app which was extremely helpful because I travel a lot & posted frequently. It was brilliant & helpfu..."
  },
  {
    "author": "CustomerAJ",
    "rating": 1,
    "date": "2025-08-06T00:37:27.000Z",
    "title": null,
    "text": "Due to an unknown amount of people false reporting my account, I was suspended and asked to verify my address. I sent pictures of my mail. The agent I spoke with said the name on my mail does not..."
  },
  {
    "author": "Marcus",
    "rating": 1,
    "date": "2025-09-17T16:24:36.000Z",
    "title": null,
    "text": "Nextdoor makes it extremely easy to charge my credit card for their Ads/Pro service, but nearly impossible to cancel the plan, remove my payment information, or speak to a live repre..."
  },
  {
    "author": "Sierra Frost",
    "rating": 1,
    "date": "2025-05-26T15:15:36.000Z",
    "title": null,
    "text": "Ableist bigots. \nSupport and allow doxxing.\nAid in targeting community members and even support law enforcement and elected officials to target them, making life incredibly dangerous for vulnera..."
  },
  {
    "author": "JAMES CAMPBELL",
    "rating": 1,
    "date": "2025-05-16T14:45:35.000Z",
    "title": null,
    "text": "The people running this app in the ANTIOCH TN area are terrible people. They remove protest they don't agree with and keep what they do, they will have your whole page deleted if you start gaining to..."
  },
  {
    "author": "Queen Riser",
    "rating": 1,
    "date": "2025-09-05T01:06:48.000Z",
    "title": null,
    "text": "This organisation has breached the Privacy and Electronics Communications Regulations.\nThey have been sending me their newsletter and other marketing correspondence that I had not..."
  },
  {
    "author": "Tom Mendez",
    "rating": 1,
    "date": "2025-05-23T15:07:15.000Z",
    "title": null,
    "text": "I’ve had the same negative experience as others. There is no appropriate process in place to stop your competitors from complaining—falsely—about your posts/ads. The only action that Nextdoor takes to..."
  },
  {
    "author": "Nicola Carr",
    "rating": 1,
    "date": "2025-06-09T20:22:49.000Z",
    "title": "Vigilante bigots",
    "text": "Increasingly prejudice vigilante type people on ND. People getting away with showing video footage of supposed dodgy people. It's curtain twitchers heaven ,throw in xenophobia,racist,classist content and you have Nextdoor. Admin are useless. US reviews saying ND is liberal is definitely not the case in the UK. Mind you the US idea of liberal is probably not the same as normal countries!"
  },
  {
    "author": "Donovan Turner",
    "rating": 1,
    "date": "2025-06-06T21:13:21.000Z",
    "title": "Delete my phone number",
    "text": "For the last 4 years I have been contacting Nextdoor to delete my phone number because my account was hacked in 2021. I have emailed them and sent them messages through twitter and they say they will get back to me and never do. I’m really angry with this company."
  },
  {
    "author": "Carol Wood",
    "rating": 1,
    "date": "2025-06-05T17:39:57.000Z",
    "title": "Nextdoor App is very liberal",
    "text": "Nextdoor App is very liberal.  They don't respect the conservative view on any topic.  Many of the recommendations for contractors are garbage."
  },
  {
    "author": "Randy Ferguson",
    "rating": 1,
    "date": "2025-06-02T15:56:43.000Z",
    "title": "You can never read the posts",
    "text": "You can never read the posts.  You have to have a computer degree to figure out how to read someone's post. Totally worthless."
  },
  {
    "author": "Tom Cross",
    "rating": 1,
    "date": "2025-06-01T12:30:41.000Z",
    "title": "The platform has been taken to a dark",
    "text": "The platform has been taken to a dark, foolish place where people can get suspended for being “rude”, there’s no recourse or proper oversight, no decision is taken with the full information or context of any conversation/conduct so someone standing up to an online stalker who is homophobic, is punished for unsavoury language the same as someone who uses the f or r slurs or makes racist remarks for exclusive reasons of humiliating publicly. In other words, this is a joke. Small business owners also team together to silence concerned customer voices, so there is no open, honest communication, its filtered, distilled, self adulation. But customers are being harmed by malpractice in some local businesses, and they should be brought out into the open.. businesses like Stockfam, run by Ben Stockbridge, that own and operate 4 or 5 mcdonald’s locations, engaging in shoddy work practices. I provide a recount of what i have seen and heard out of concern for the customers, and get a pile on from a few blokey small business owner allies from the small business council or whichever college boy’s club they attended together, then attack and denigrate me and my motives and have me threatened by the hierarchy within maccas. So there is a toxic element to Nextdoor with real time implications that needs to change, at the moment every perspective and background is not welcome, business owners and neighbours are not both equal. The master-servant mentality has made its way onto this platform and it will take a monster effort of an uprising to change it."
  },
  {
    "author": "Tony 1",
    "rating": 1,
    "date": "2025-05-30T13:39:19.000Z",
    "title": "VERY Annoying keep receiving emails…",
    "text": "VERY Annoying keep receiving emails from them when i haven't requested . AVOID THEM VERY SPAM"
  },
  {
    "author": "J G",
    "rating": 1,
    "date": "2025-05-29T18:03:24.000Z",
    "title": "Rude members and Extreme Rude Comments",
    "text": "Since I have joined this website for years I have received rude mean threatening comments on every one of my posts no matter what I post topic about.   From total strangers I get railed every time just like facebook.com and instagram.com."
  },
  {
    "author": "Samantha S",
    "rating": 1,
    "date": "2025-05-29T10:17:41.000Z",
    "title": "BS closure",
    "text": "Like so many my account was suspended because of .... I don't even know. It is ridiculous.  Another piece of s*** social media cesspool for bullies."
  },
  {
    "author": "C Cruvineli Agnes",
    "rating": 1,
    "date": "2025-05-29T00:07:40.000Z",
    "title": "BANNED FOR REPORT",
    "text": "THESE XENOFOBICS LUNATICS LEFTISTS. I reported a post who's guy is calling the President Trump corrupt and other bad words and provoked conflicts between the neighbors. The moderators and the rules said to AVOID POLITICAL posts but they allowed when it is against Trump. These morons banned me without any explanation  maybe because Im latina..DONT SIGN TO THIS LUNATICS..is nothing good there!"
  },
  {
    "author": "Sierra Frost",
    "rating": 1,
    "date": "2025-05-26T15:15:36.000Z",
    "title": "Ableist bigots",
    "text": "Ableist bigots. Support and allow doxxing. Aid in targeting community members and even support law enforcement and elected officials to target them, making life incredibly dangerous for vulnerable people. They do not care that they do this. They will do absolutely nothing about it no matter how unsafe they have made the neighborhood. There are zero real people working for them, they refuse to have accessible communication. That's all there is to say to know they are bigots."
  },
  {
    "author": "Laurence",
    "rating": 1,
    "date": "2025-05-23T23:22:40.000Z",
    "title": "It is a haven for racists",
    "text": "It is a haven for racists. The moderation is appalling and there is a pronounced bias for racism and parties on the far right. I tested my theory by using the exact same wording used by supporters of Reform to attack other parties and was suspended....and no action was taken against the original posters despite reports. some of the posts I have seen on Nextdoor are appalling but if you have a particular political affiliation (i.e. far right) no action will be taken. I reported a poster last year for some appalling comments. he was suspended and just returned to continue his shocking abuse. It really is the new Facebook. Vile."
  },
  {
    "author": "Tom Mendez",
    "rating": 1,
    "date": "2025-05-23T15:07:15.000Z",
    "title": "A Waste of Time and Money",
    "text": "I’ve had the same negative experience as others. There is no appropriate process in place to stop your competitors from complaining—falsely—about your posts/ads. The only action that Nextdoor takes to this action is to delete your account. Nextdoor gives four rules that cannot be broken. I didn’t break them but my account was still deleted for an unstated reason. Stay away!!! Your money—and more importantly—your time is better spent on other tools!"
  },
  {
    "author": "Kristina",
    "rating": 1,
    "date": "2025-05-21T22:49:49.000Z",
    "title": "The last place on Earth you want to be",
    "text": "Avoid using it, it’s a trash you can’t post anything, there will be always someone reporting constantly local users to be banned for all daft reasons. I was using it I got banned because someone reported my name. It’s happened to other users who’s been suspended for a while have to send passport or any ID to prove. Nasty, bully comments from random angry people who’s got no life or job sitting reporting posts. There good local neighbour’s but the rest sit in shadows doing nothing but stalking people."
  },
  {
    "author": "Jocelyn Bullock",
    "rating": 1,
    "date": "2025-05-21T06:18:47.000Z",
    "title": "I posted pictures of my drawing in…",
    "text": "I posted pictures of my drawing in progress. I get a lot of likes but then it got flagged. I assume some moderator reported it for no reason. Then I posted a pic of me next to a drawing my daughter did because it was a cool drawing and a John F. was grilling me about why I posted it. I was targeted for no reason. I assume he’s a moderator but I should not have to explain a post. I’m going to delete the app. People post pictures of of people they think are criminals all day long but pick on whoever they feel like harassing for any reason. It’s a hostile environment under a veneer of nieghborlyness."
  },
  {
    "author": "kevin mcbride",
    "rating": 1,
    "date": "2025-05-20T08:47:19.000Z",
    "title": "complete trash",
    "text": "complete trash, my account got banned because I posted too much, and at their tos there was nothing in my posts that would lead to phishing or spam"
  },
  {
    "author": "Thea Arnold Oya Obinidodo",
    "rating": 1,
    "date": "2025-05-20T01:43:31.000Z",
    "title": "My experience with nextdoor was horrible",
    "text": "My experience with nextdoor was horrible. It started off okay, then there were bullies that started flagging all of my posts for no reason so I decided to deactivate my account. I then contacted Nextdoor and asked them to delete the entire account."
  },
  {
    "author": "miguel banda",
    "rating": 1,
    "date": "2025-05-18T19:09:25.000Z",
    "title": "You get censored or banned for anything…",
    "text": "You get censored or banned for anything on this lame app. It's worse than facebook during the Biden years with the North Korea censorship, and even worse, they don't apply their rules evenly. They'll ban or censor you for offenses many others are committing in the same discussion. #NeverNextdoor"
  },
  {
    "author": "Angela Read-Meshil",
    "rating": 1,
    "date": "2025-05-18T18:15:59.000Z",
    "title": "It’s a shockingly poorly moderated…",
    "text": "It’s a shockingly poorly moderated platform. It houses a bed of ignorant racists who are allowed to insult moderately minded people. They openly allow right-wing and fascist ideology pedalled by obviously ill-informed buffoons who constantly try to generate slanging matches by posting very political right-wing and racist comments. There are a lot of posts on missing and dead cats too!"
  },
  {
    "author": "CK Cox",
    "rating": 1,
    "date": "2025-05-17T02:28:03.000Z",
    "title": "Its totally sucks- Lost dogs are the…",
    "text": "Its totally sucks- Lost dogs are the only acceptable topic of discussion"
  },
  {
    "author": "JAMES CAMPBELL",
    "rating": 1,
    "date": "2025-05-16T14:45:35.000Z",
    "title": "James Campbell",
    "text": "The people running this app in the ANTIOCH TN area are terrible people. They remove protest they don't agree with and keep what they do, they will have your whole page deleted if you start gaining to much support. MY protest post had 40-60 likes each and people were supporting me. However, the people that run the app had everything removed and then began trolling me every comment saying things like \"in one ear and out the other\" One was named Linda and one was Named Karah or Karen one or the other but there disgusting people."
  },
  {
    "author": "AV",
    "rating": 1,
    "date": "2025-09-30T01:14:24.000Z",
    "title": null,
    "text": "This platform is biased and makes it a habit of silencing conservative views. My response post (ie. I didn't start the conversation) was an equal response to the original, opposing comment. However, I..."
  },
  {
    "author": "Kathryn Rubenstein",
    "rating": 1,
    "date": "2025-09-29T03:09:54.000Z",
    "title": null,
    "text": "NEXTDOOR is the worst online experience I’ve ever had. It’s biased against Democrats and has been infiltrated by MAGA. They post inflammatory political posts, which is not allowed, and the moderators..."
  },
  {
    "author": "Charles Hunter",
    "rating": 1,
    "date": "2025-09-21T16:45:07.000Z",
    "title": null,
    "text": "Please , please, if you value any semblance of privacy, DO NOT!! I repeat DO NOT!! sign up with this highly intrusive supposed neighborhood app! There is absolutely no way that I’ve found to unsubscri..."
  },
  {
    "author": "Niel Flamm",
    "rating": 1,
    "date": "2025-09-20T12:06:04.000Z",
    "title": null,
    "text": "I used to enjoy the app in the city of Henderson,NV the Inspirada Neighborhood. I had no problems with the moderators. In the city of Mount Pleasant, South Carolina I'm on my 5th Suspension. I believe..."
  },
  {
    "author": "Dana R.",
    "rating": 1,
    "date": "2025-09-10T11:20:45.000Z",
    "title": null,
    "text": "Horrible app! Since their \"revamp\" my 7 year old acct was suspended pending name verification. They then DELETED almost 200 items I had listed in the Buy and Sell section. When my acct was reactivated..."
  },
  {
    "author": "Jess Foster",
    "rating": 1,
    "date": "2025-09-21T22:46:04.000Z",
    "title": null,
    "text": "Terrible. Most biased platform I have ever used, saturated with backyard animal breeders and those seeking any kind of job they can get or money out of desperation. I don’t recommend."
  },
  {
    "author": "Zan Mayo Glodich",
    "rating": 1,
    "date": "2025-09-29T20:18:56.000Z",
    "title": null,
    "text": "My opinion about a local restaurant was posted in response to an inquiry.  It turned out that the original poster was the owner of the restaurant but he had not identified himself as such.  There was..."
  },
  {
    "author": "Cheryl",
    "rating": 1,
    "date": "2025-08-26T03:44:40.000Z",
    "title": null,
    "text": "I'd give NextDoor.com ZERO stars if I could. They deactivated my account saying my name wasn't verifiable. And I'm not giving them a copy of my ID or some other private document just so I can read abo..."
  },
  {
    "author": "Kathleen Casey",
    "rating": 1,
    "date": "2025-09-03T20:57:13.000Z",
    "title": null,
    "text": "I have had NextDoor for years, never have I been suspended but today I am.  I replied to two different hateful and racist comments on my post and I am suspended.  All over a boy who is using the girls..."
  },
  {
    "author": "Unhappy",
    "rating": 1,
    "date": "2025-08-23T22:05:13.000Z",
    "title": null,
    "text": "There isn't a minus zero star? There should be. This is a playground for  high school girls given the title of moderator. They have no clue that that are being used by corporate for financial profit,..."
  },
  {
    "author": "A Rising Virgo",
    "rating": 1,
    "date": "2025-09-28T20:38:47.000Z",
    "title": null,
    "text": "this app is literally filled with nazis, racist, bigoted people who claim to be good neighbors. This app breeds misinformation and those who created the app are also racist and responsible for this be..."
  },
  {
    "author": "Mrz DeeDee",
    "rating": 1,
    "date": "2025-09-28T05:53:23.000Z",
    "title": null,
    "text": "Unfortunately, this app fosters a mob mentality and a mean-girl high school vibe. If you write something that the neighbors disagree with, the entire neighborhood comes for you. There is no moderator..."
  },
  {
    "author": "Sue M",
    "rating": 1,
    "date": "2025-09-19T19:19:46.000Z",
    "title": null,
    "text": "It's changed and all ads now. Repeating ads and rhe hide feature doesnt work.  They always say they will let the developers know when you email them. The developers dont do anything,obviously.  Look a..."
  },
  {
    "author": "Aletheos Oratos",
    "rating": 1,
    "date": "2025-06-28T14:22:47.000Z",
    "title": null,
    "text": "Heavy censorship. Massive bias against conservatives. FAKE players in groups who patrol and dog pile you if you criticize democrat policy. The instant you criticize their toxic behavior, you get banne..."
  },
  {
    "author": "Jim A",
    "rating": 1,
    "date": "2025-08-20T20:34:37.000Z",
    "title": null,
    "text": "It's just a social media site now. Neighbors complaining about neighbors, political fights, public shaming of people you don't like. Like X the rude and hateful have taken over. There must be someplac..."
  },
  {
    "author": "Nicola Carr",
    "rating": 1,
    "date": "2025-06-09T20:22:49.000Z",
    "title": null,
    "text": "Increasingly prejudice vigilante type people on ND. People getting away with showing video footage of supposed dodgy people. It's curtain twitchers heaven ,throw in xenophobia,racist,classist content..."
  },
  {
    "author": "Kristina",
    "rating": 1,
    "date": "2025-05-21T22:49:49.000Z",
    "title": null,
    "text": "Avoid using it, it’s a trash you can’t post anything, there will be always someone reporting constantly local users to be banned for all daft reasons. I was using it I got banned because someone repor..."
  },
  {
    "author": "C Cruvineli Agnes",
    "rating": 1,
    "date": "2025-05-29T00:07:40.000Z",
    "title": null,
    "text": "THESE XENOFOBICS LUNATICS LEFTISTS. I reported a post who's guy is calling the President Trump corrupt and other bad words and provoked conflicts between the neighbors. The moderators and the rules sa..."
  },
  {
    "author": "miguel banda",
    "rating": 1,
    "date": "2025-05-18T19:09:25.000Z",
    "title": null,
    "text": "You get censored or banned for anything on this lame app. It's worse than facebook during the Biden years with the North Korea censorship, and even worse, they don't apply their rules evenly. They'll..."
  },
  {
    "author": "Ken C",
    "rating": 1,
    "date": "2025-09-13T06:02:57.000Z",
    "title": null,
    "text": "This is my 10th time + unsubscribing to Nextdoor. They keep sending me unsolicited emails. They are one of the worst offenders. Can’t trust a company that keeps violating settings."
  },
  {
    "author": "J-CAT",
    "rating": 1,
    "date": "2025-08-02T05:39:55.000Z",
    "title": null,
    "text": "Aggravating to say the least! I've been kicked off twice simply for disagreeing with all the Sitanic Left wing nut jobs! I NEVER cursed or said anything disrespectful (even though THEY did!) One perso..."
  },
  {
    "author": "douglas strand",
    "rating": 1,
    "date": "2025-05-13T16:00:56.000Z",
    "title": null,
    "text": "As an ex moderator reporting insulting/ rude/agresive behaviour \ntoo many times 'those above me' deemed the reports ill founded \neven when some posters were openly breaking UK laws\n.\nthen one..."
  },
  {
    "author": "Angela Read-Meshil",
    "rating": 1,
    "date": "2025-05-18T18:15:59.000Z",
    "title": null,
    "text": "It’s a shockingly poorly moderated platform. It houses a bed of ignorant racists who are allowed to insult moderately minded people. They openly allow right-wing and fascist ideology pedalled by obvio..."
  },
  {
    "author": "Bellflower",
    "rating": 1,
    "date": "2025-09-16T07:02:11.000Z",
    "title": null,
    "text": "Moderators are r acist.  They're perfectly fine allowing people to be  r acist but ones we stand up for ourselves,  we get suspended"
  },
  {
    "author": "Mark Eckelkamp",
    "rating": 1,
    "date": "2025-07-01T08:43:00.000Z",
    "title": null,
    "text": "Remove user moderators and leads.  They band together to control their ideology and views. Nextdoor has a poorly AI based system that is horribly corrupted and flawed. Allow individual users to block..."
  },
  {
    "author": "J B",
    "rating": 1,
    "date": "2025-04-07T15:17:02.000Z",
    "title": null,
    "text": "Nextdoor continues to break their own rules and allows Trump/Musk protest propaganda to be posted on the main feed. Would they allow Trump/Musk rallies to be posted on the main feed? Highly unlikely a..."
  },
  {
    "author": "CAROL SHORE",
    "rating": 1,
    "date": "2025-04-07T10:11:00.000Z",
    "title": null,
    "text": "This site should put in its guidelines \"we support Trump and thats it\"I was upset that he played golf instead of meeting the plane carrying 4 dead soldiers who died in Lithuania and said so.I was susp..."
  },
  {
    "author": "Debbie",
    "rating": 1,
    "date": "2025-08-07T22:46:40.000Z",
    "title": null,
    "text": "If your comments are in the least middle of the road to right leaning you get banned from the app.  This app is not neutral.  It is a left wing propaganda app.  I never posted anything , I just respon..."
  },
  {
    "author": "Peach Rose",
    "rating": 1,
    "date": "2025-09-15T03:39:51.000Z",
    "title": null,
    "text": "I’ve been on Nextdoor for nearly a decade, and it’s disheartening to see how much it’s changed. What once felt like a friendly, casual place for neighbors to share information has turned into a..."
  },
  {
    "author": "Alice",
    "rating": 1,
    "date": "2025-07-10T23:32:46.000Z",
    "title": null,
    "text": "Nextdoor is a platform is run by true fascists, enemies of free speech. There's heavy censorship. They removed my post, where I stated a historical fact, labeling it as 'discrimination', while allowin..."
  },
  {
    "author": "Ron Hammelman",
    "rating": 1,
    "date": "2025-05-08T22:29:17.000Z",
    "title": null,
    "text": "Well the ND moderators did it to me again, suspension for 1 month because I dared to speak what was on my mind responding to insulting or rude comments.  Reason this time was Non-Local Political issue..."
  },
  {
    "author": "Laurence",
    "rating": 1,
    "date": "2025-05-23T23:22:40.000Z",
    "title": null,
    "text": "It is a haven for racists. The moderation is appalling and there is a pronounced bias for racism and parties on the far right. I tested my theory by using the exact same wording used by supporters of..."
  },
  {
    "author": "Rachel Wonos",
    "rating": 1,
    "date": "2025-05-18T16:15:00.000Z",
    "title": null,
    "text": "I’d give zero stars if possible! Disgusting site run by TDS liberals who don’t even hide their bias! Conservatives who express support for Pres Trump get suspended for no reason, while liberals who po..."
  },
  {
    "author": "Darhlene Zeanwick",
    "rating": 1,
    "date": "2025-06-23T10:30:18.000Z",
    "title": null,
    "text": "NextDoor - The Place for NonThinkers - Heavy on the ads. Heavy on the censorship. Users access only to report on neighbors. Watched by LEOs. They send letters to neighbors with your name inviting them..."
  },
  {
    "author": "R Tims",
    "rating": 1,
    "date": "2025-08-16T23:48:07.000Z",
    "title": null,
    "text": "Biased hacks censoring civil debate. When you’re in groups among people who politically battle they will only block and remove the people who they don’t politically align with. What a stupid app ran b..."
  },
  {
    "author": "Sandy Miller",
    "rating": 1,
    "date": "2025-07-21T12:36:56.000Z",
    "title": null,
    "text": "Hired a workman from this Nextdoor website who took photos of our property without our knowledge. He then used these photo to advertise his work which clearly is a breach of our privacy. We infor..."
  },
  {
    "author": "CJ",
    "rating": 1,
    "date": "2025-07-17T16:44:24.000Z",
    "title": null,
    "text": "I was selling an item for Sale under the \"For Sale\" section of Nextdoor.  I did delete it and repost it the next day with changes that needed to be made.\nApparently, Nextdoor see this as a \"Do Not..."
  },
  {
    "author": "Bryan K",
    "rating": 1,
    "date": "2025-06-15T03:19:10.000Z",
    "title": null,
    "text": "In Plano, TX the posting management is terribly biased.  Someone can post, as an example, that Trump takes bribes and pockets the money.  If corrected, politely, to such an absurd statement and correc..."
  },
  {
    "author": "Mike White",
    "rating": 1,
    "date": "2025-09-14T02:51:23.000Z",
    "title": null,
    "text": "Very biased in favor of leftists. They delete truthful comments all the time. If it does not comply with leftist ideals it will get deleted."
  },
  {
    "author": "Bob Tinker",
    "rating": 1,
    "date": "2025-07-15T01:12:57.000Z",
    "title": null,
    "text": "Constant censorship, if they don’t agree with your view, they remove even when you’re in the right. Pro American,Gun,Fireworks,Free Speech, Republican, this is NOT the place for you"
  },
  {
    "author": "Gunter Kruger",
    "rating": 1,
    "date": "2025-07-31T09:19:00.000Z",
    "title": null,
    "text": "My account was suspended for a photo of a corn dog and a carrot. Both looked too sexual. The platform doesn't have a lot of traction, and the administrators are probably a hundred years old or sexuall..."
  },
  {
    "author": "La Tonya",
    "rating": 1,
    "date": "2025-08-19T21:07:51.000Z",
    "title": null,
    "text": "I started using Nextdoor when I lived in the UK & was over the moon having found a community based app which was extremely helpful because I travel a lot & posted frequently. It was brilliant & helpfu..."
  },
  {
    "author": "CustomerAJ",
    "rating": 1,
    "date": "2025-08-06T00:37:27.000Z",
    "title": null,
    "text": "Due to an unknown amount of people false reporting my account, I was suspended and asked to verify my address. I sent pictures of my mail. The agent I spoke with said the name on my mail does not..."
  },
  {
    "author": "Marcus",
    "rating": 1,
    "date": "2025-09-17T16:24:36.000Z",
    "title": null,
    "text": "Nextdoor makes it extremely easy to charge my credit card for their Ads/Pro service, but nearly impossible to cancel the plan, remove my payment information, or speak to a live repre..."
  },
  {
    "author": "Sierra Frost",
    "rating": 1,
    "date": "2025-05-26T15:15:36.000Z",
    "title": null,
    "text": "Ableist bigots. \nSupport and allow doxxing.\nAid in targeting community members and even support law enforcement and elected officials to target them, making life incredibly dangerous for vulnera..."
  },
  {
    "author": "JAMES CAMPBELL",
    "rating": 1,
    "date": "2025-05-16T14:45:35.000Z",
    "title": null,
    "text": "The people running this app in the ANTIOCH TN area are terrible people. They remove protest they don't agree with and keep what they do, they will have your whole page deleted if you start gaining to..."
  },
  {
    "author": "Queen Riser",
    "rating": 1,
    "date": "2025-09-05T01:06:48.000Z",
    "title": null,
    "text": "This organisation has breached the Privacy and Electronics Communications Regulations.\nThey have been sending me their newsletter and other marketing correspondence that I had not..."
  },
  {
    "author": "Tom Mendez",
    "rating": 1,
    "date": "2025-05-23T15:07:15.000Z",
    "title": null,
    "text": "I’ve had the same negative experience as others. There is no appropriate process in place to stop your competitors from complaining—falsely—about your posts/ads. The only action that Nextdoor takes to..."
  },
  {
    "author": "Wayne Samuel",
    "rating": 1,
    "date": "2025-05-15T02:59:24.000Z",
    "title": "What a joke of a site",
    "text": "What a joke of a site. Second suspension. First about politics. The second about two posts. One about a Irish woman with a green card being detained for deportation after living in California for 30 years after visiting her dad with dementia in Ireland. It happened in California but many people in NYC got green cards. My point was to make people aware this can happen to them. The second one was also California where a delivery driver relieved herself on the front yard of the people she delivered a package to. My point is we have delivery drivers here too and it's better to look out for  them if they need a restroom. I've helped out people from Verizon before. It's not easy finding a restroom. Anyway they are idiots for suspending me. I deleted their app from my smartphone and I removed the password to my account off my computer. They used to praise me and ask what will I write next. Well too bad they won't be making any more money off of me. They're a bunch of snub losers!"
  },
  {
    "author": "Brian Litton",
    "rating": 1,
    "date": "2025-05-14T01:01:49.000Z",
    "title": "Liberals Suppressing Conservatives Voices",
    "text": "Updated Review May 8, 2025 Nextdoor send me a developer response so l contacted them but they still never answered my questions then quit responding again. This is the worst social media platforms. Just pushing their progressive agenda with no room for an opposing opinion. Not even worth one star. Original Review For the fourth time, I have been suspended for 30 days. This one started when support overturned, a censored post saying that the moderators had misapplied the rules. Since the post was over a week old, I simply reposted it and the local moderators flagged it and removed it again. I contacted support and asked them who was in charge, but I got no response. I even emailed corporate and no one replied. They completely ghosted me. I am not the only conservative in my neighborhood who has had this experience. I am waiting for someone to open a class action lawsuit for viewpoint, discrimination, and when they do, I have my documentation ready to join."
  },
  {
    "author": "wayne wilson",
    "rating": 1,
    "date": "2025-05-13T23:17:14.000Z",
    "title": "I enjoy ND",
    "text": "I enjoy ND, but with so many, day after day of missing pets, cats lost,found,fostering, adopting, selling it is just to much. Set up a category just for this. Next, stop all the free loaders from handyman to superman, sponsored  members only."
  },
  {
    "author": "douglas strand",
    "rating": 1,
    "date": "2025-05-13T16:00:56.000Z",
    "title": "As an ex moderator reporting insulting/…",
    "text": "As an ex moderator reporting insulting/ rude/agresive behaviour too many times 'those above me' deemed the reports ill founded even when some posters were openly breaking UK laws . then one poster laying isult after insult to od was deemed ok i walked away from the site Don't need the negitivity of that kind of site in my life"
  },
  {
    "author": "David Hall",
    "rating": 1,
    "date": "2025-05-12T01:50:04.000Z",
    "title": "Absolutely appalling site.",
    "text": "Absolutely appalling site. The moderation is a joke. They will let users post hate comments about Reform UK, and people who vote Reform UK, that's OK.  As soon as you retaliate by challenging them, their reviewers ban you. What's worse is that the reviewers don't even bother with the guidelines.  You just get banned for having a different opinion. The reviewers, in many situations, actually break the sites guidelines in their response to you, which makes them hypocrites.  I had a reviewer reply to me who broke more guidelines in their response to me, than I broke when I made my comment.  However, it is possible to report reviewers to Nextdoor admin staff for having a history of making biased moderation decisions. These reviewers are trying to control every aspect of Nextdoor, because they all have the same political beliefs, I.E. they are all left wing.  What they are trying to do is control the content on the site by banning anyone who opposes the left.  Community guidelines don't matter.  If your not a left wing voter, you will get banned, while those who are left wing, are allowed to continue making their politically motivated hate post's I have seen users bully and harass both Nigel Farrage and Donald Trump.  When I have reported them, nothing happens.  The post isn't even taken down.  However, when I tell them that they are making hate posts, that they have no right to tell people who to vote for, I get banned for 12 days.  The same thing happens if you criticise Labour.  You absolutely cannot criticise Labour, under any circumstances, without either the post being taken down, or your account being banned.  However, criticise Reform UK, and the post stays there forever. I have no problem with someone voting for whomever they decide to vote for, but when I am openly criticised and then banned, because I openly say that I am a reform voter, then there's a problem.  When someone says that I am a low intelligence Deform PLC voter, because Reform UK are who I CHOOSE to vote for, then there's a problem.  It would be a start, if those people, making those comment's were also banned, but they never are. If it were anyone else, or any other site, site's with proper moderator's, it would be called bullying and harassment. It's funny, isn't it, how it only happens on Nextdoor?  These people don't moderate on other sites, they don't even have accounts for other social media sites, sites like X, Facebook or YouTube, where there are other, proper moderators.  Nextdoor moderators / reviewers cannot operate effectively in environment's that they cannot control. It's only on Nextdoor where this level of abuse happens, where the \"community\" guidelines are continually ignored by the reviewers. I have seen hate posts, I have seen anti-jew posts, all manner of racist posts being made by left wing supporters.  They are still there now, posting, to this day, while anyone who objects gets banned. Something has to be done at some point, because this site is being consistently abused by left wing supporters in an attempt to control who can say what on the site. Another cause for concern with Nextdoor, which is apparently a private social media platform, is the level of data that they need from you, just to let you join.  They ask for your exact geolocation, they ask for your full name and your mobile phone number, all before your even allowed to join. No other social media site on the internet asks for this level of detail about you personally.  Why do Nextdoor need this level of personal information? My advice to you, if you join, is to change your name in the profile as soon as you join.  And yes, you can get suspended for not using your actual birth name, which I find appalling, since it is NOT hard to track someone's home address down, once you use your own full name and geo-location.  You only have to look on a census register or what have you.  Your neighbours can potentially track you down to where you live.  That put's everyone who uses Nextdoor at risk of being targeted externally of the site.  That is, without a doubt, a massive security risk to you and your family, especially if you have a history of challenging people with certain political beliefs. I actually asked Nextdoor admin staff once, via email, if they take full responsibility, should I receive abuse at my home address because of my beliefs.  Nextdoor admin did not respond to my question. If it's a PRIVTAE social media platform, why do they need to invade every aspect of my person before they even consider letting me join?  Why are mobile phone numbers mandatory, as well as your street level address? I would not be at all surprised, if Nextdoor's membership requirement's did not contradict The Data Protection Act, since, as I said, it does put me at risk, the amount of personal information that I have to give up just to join."
  },
  {
    "author": "Ian Guld",
    "rating": 1,
    "date": "2025-05-09T14:19:46.000Z",
    "title": "BIASED",
    "text": "BIASED INTRUSIVE COMPANY  COLLECTING INFORMATION on PEOPLE RETALIATING AGAINST PEOPLE WHO SPEAK THEIR MIND"
  },
  {
    "author": "Kim Stevens",
    "rating": 1,
    "date": "2025-05-09T13:31:35.000Z",
    "title": "This is the least aptly named website…",
    "text": "This is the least aptly named website around.  A narcissist who has way too much free time probably created this site, now only sits around their laptop looking for people they can abuse from the anonymity of the cyber cafe.  They do nothing but complain about the population of the bobcat (spend some time loving your animals indoors instead of chaining them up 24/7 and maybe you wouldn't have to worry about bobcats) ask for handouts, post their crafts projects they want you to spend money on and snitch on each others personalities.  Powder puff, coward Moderators mingle with you to rile you up then slam down the ban-hammer as soon as you get your licks in.  Get a life.  P.S. If you have business you will not find anyone on this site who wants to pay you what you're worth."
  },
  {
    "author": "Ron Hammelman",
    "rating": 1,
    "date": "2025-05-08T22:29:17.000Z",
    "title": "Biased ND News",
    "text": "Well the ND moderators did it to me again, suspension for 1 month because I dared to speak what was on my mind responding to insulting or rude comments.  Reason this time was Non-Local Political issue.  No, those biased bastards don't want my voice heard.  Screw'em.  They don't even deserve a 1 rating."
  },
  {
    "author": "Marcus Matthiesen",
    "rating": 1,
    "date": "2025-05-05T13:17:26.000Z",
    "title": "Terrible app",
    "text": "Terrible app! Just bored mean people work for nextdoor! This app is for one Karen to talk to another Karen. The most negative and worthless app around!!! I hate you nextdoor! I wish you would move to China! Nextdoor blows! All the people that work there Blow too!!!"
  },
  {
    "author": "Truth Only",
    "rating": 1,
    "date": "2025-05-03T18:14:20.000Z",
    "title": "This app is full of nothing but gossip",
    "text": "This app is full of nothing but gossip. I’m out!"
  },
  {
    "author": "Evan Stroum",
    "rating": 1,
    "date": "2025-05-03T09:44:31.000Z",
    "title": "Can I leave -1 stars",
    "text": "Can I leave -1 stars? My Mother passes away and I list a bunch of things for my Father and they suspend me because apparently I posted something twice. Their system provides me an image of why with nothing but blanks which tells me it is a Next Door system issue, nonetheless, they tell me I posted something twice. FB catches that for you, not pathetic nextdoor. They suspend me again, this time for a WHOLE YEAR. No one replies back any longer even though I provide proof and reason for their error in judgement and in the event they are correct, their system does not have a search to see if you have posted something already. My eyes get tired scrolling and I am trying to sell things for my widowed father! Nothing I have done has been egregious and any double post would be an honest mistake. I haven't spammed anyone, I haven't used any questionable language, I haven't misrepresented anything that I have sold. Nothing. Next Door is a horrible evil company with customer service that will ban not only you for being on the platform, but from ever emailing them again. 15 replies ignored after giving me canned replies and ignoring details I provide them. NEXT DOOR = EVIL"
  },
  {
    "author": "Patty J",
    "rating": 1,
    "date": "2025-05-01T06:31:21.000Z",
    "title": "Very biased Far left platform.",
    "text": "A review team member outed someone on the site that reported someone. A lead constantly posts national politics. Nothing happens to them. They should be held to higher standards. Nextdoor really doesn’t care apparently."
  },
  {
    "author": "Maria Sahonic",
    "rating": 1,
    "date": "2025-04-30T22:09:57.000Z",
    "title": "This app has become a place where…",
    "text": "This app has become a place where administrators are abusing their so called position to weed out neighbors that they don't like. It was a good community app for information until it got out of hand."
  },
  {
    "author": "Daisy Duck",
    "rating": 1,
    "date": "2025-04-30T21:58:41.000Z",
    "title": "They  are the biggest panhandling  and…",
    "text": "They  are the biggest panhandling  and cyber bullying  web site they should be forced off the internet tick  tock  and x are better then nextdoor.com"
  },
  {
    "author": "J Fuller",
    "rating": 1,
    "date": "2025-04-30T14:02:30.000Z",
    "title": "Next Door is bias and discriminatory",
    "text": "Next Door is bias and discriminatory.  Take screen shots of EVERYTHING if you stay on this site to prove what they do.  It would not surprise me if they come against a big at law suit soon. They have allow some to post certain things but then suspend others for the SAME thing and say \"oh it's against the guidelines\".  Well why isn't it against the guidelines for EVERYONE?!?!? They are school yard bullies.  Group together gang.  Time to do something."
  },
  {
    "author": "Bea",
    "rating": 1,
    "date": "2025-04-29T19:59:22.000Z",
    "title": "DO NOT JOIN THIS DECEPTIVE, UNETHICAL SITE IF YOU VALUE YOUR PRIVACY",
    "text": "I joined Nextdoor in October of 2024.  Initially, I liked it because I enjoy helping people. A few days ago, I was \"indefinitely suspended\" because someone reported I may not using my real name.  I use my social media name which is Bea Devi.  My name is Bea and I teach about the Goddess and Devi means Goddess in Sanskrit. I was viciously cyberbullied online so I have not used my last name for years because of it. I was told my account would be reinstated if I uploaded my government ID.  I responded that there was no way I would upload my personal information to a social media site.  No other social media site asks for this sensitive information.  Do not use this site.  They are not up front with their methods of getting your personal information.  If I had read the reviews here before I joined, I never would have joined.   They get you to join by NOT requiring your ID and then suspend you for no good reason and then demand your ID to allow you back on.  I told them it would be one thing if I was doing something questionable but there is no way I am giving a social media site my personal information.  I highly recommend people DO NOT join this invasive platform. PS - I deleted (not deactivated) I deleted my account.  I also wanted to delete a business page and had trouble doing so.  I returned to try again and my personal account was reinstated, photo and all with the \"indefinitely suspended\" posted on the page.  This site is not to be trusted.  It deserves 0 stars on Trust Pilot.  Please do not join this site if you care about your privacy and security online. to support@nextdoor Thank you Kelly, You might want to show this to whoever is in charge of policies on Next Door. It would be one thing if I was running a scam or doing something questionable or unethical.  However,  I rehomed a rabbit, donated groceries, gave an elderly person a ride, shared one funny cat photo a day, offered free 3 minute readings which people loved, kept an eye out for anything I could do for my community yet, I am being asked for personal information that is not required to join.  It makes no sense. Yesterday, I shared what happened on my Facebook page and I took a screenshot of my post as well as the comments from my Facebook friends. Have a good day, Bea"
  },
  {
    "author": "Debra Largent",
    "rating": 1,
    "date": "2025-04-29T14:04:47.000Z",
    "title": "Deactivated my Account!!!",
    "text": "Nextdoor used to be a site whereas \"neighbors helped neighbors\" however over the past year there are so many negative/hurtful comments made. If you don't agree with what someone says, so be it. Voice your opinion as you have that right, but never should you cut someone down for their beliefs!!"
  },
  {
    "author": "Todd Riches",
    "rating": 1,
    "date": "2025-04-29T05:02:17.000Z",
    "title": "Does not foster community engagement and information sharing",
    "text": "Nextdoor was originally intended to be a social media platform that fosters community engagement and facilitates easy information sharing among neighbors. Unfortunately, it has strayed significantly from that mission. In my experience, it has become: A platform where users are often criticized or berated for commenting on posts outside of their immediate neighborhood. A space where individuals frequently request handouts rather than seeking solutions or offering mutual support. A service that compromises user privacy — despite using a fictitious name, I began receiving unsolicited emails addressed to that name from companies I had no prior interactions with. An environment with ineffective moderation — during my time as a moderator, I observed widespread bias and a lack of accountability, with many moderators failing to act on clear violations of community guidelines. After deleting my account for a second time, I have decided not to return. In its current state, Nextdoor no longer offers the positive, community-driven experience it originally promised."
  },
  {
    "author": "Rachel Wonos",
    "rating": 1,
    "date": "2025-05-18T16:15:00.000Z",
    "title": "I’d give zero stars if possible",
    "text": "I’d give zero stars if possible! Disgusting site run by TDS liberals who don’t even hide their bias! Conservatives who express support for Pres Trump get suspended for no reason, while liberals who post obscenities, curse, attack others (all supposed violations of the site’s rules!) do not get suspended! The “Leads” in charge of monitoring the comments are liberals too so they report conservatives and get them suspended! This site is as about as even handed, fair and neutral as The View!"
  },
  {
    "author": "Diane Kelly",
    "rating": 1,
    "date": "2025-04-25T08:34:34.000Z",
    "title": "Avoid this website at all cost.",
    "text": "Avoid this website at all cost. Especially if you believe in traditional values and compassion. This website is run by a bunch of mentally deranged woke left liberal lunatics hellbent on silencing ANYONE who disagrees with them."
  }
]