[
  {
    "event_id": "311240438",
    "title": "NYC Tech Connect: Networking for Tech Startups, Investors, Professionals",
    "description": "🔔 **Please Note:** RSVP on Meetup **does not guarantee entry**.\nTo attend, you **must register through the official ticket link** here: [https://www.eventbrite.co.uk/e/1748348771239?aff=oddtdtcreator](https://www.eventbrite.co.uk/e/nyc-tech-connect-networking-for-tech-startups-investors-professionals-tickets-1748348771239?aff=oddtdtcreator)\n\nJoin us in the heart of New York City for an evening of **tech innovation, networking, and new opportunities**. This event brings together **startup founders, entrepreneurs, investors, and professionals** from across the tech ecosystem to connect, collaborate, and exchange ideas.\nWhether you’re looking to **meet potential co-founders, pitch your startup, explore partnerships, or simply expand your professional circle**, NYC Tech Connect is the place to be.\n\n**Event highlights:**\n\n* **Co-Founder Matching** – Meet others with the skills, mindset, and ambition to help shape your venture\n* **Strategic Partnerships** – Connect with marketers, product leads, tech experts, ops minds, and more\n* **1-Minute Elevator Pitch** – Every attendee gets a moment to share who they are and what they're looking for\n* **Peer Networking** – Engage with fellow founders and builders navigating similar challenges\n* **Idea Sharing & Collaboration** – Discover opportunities to team up, support each other, or simply swap insights\n\n**Who should attend?**\nIT and Technology Professionals Networking Event welcomes all IT and Technology professionals who are passionate about advancing their careers, expanding their networks, and staying at the forefront of the ever-evolving digital landscape. This event is ideal for:\n\n* **Startup Founders**: Looking to pitch ideas, find partners, or secure funding.\n* **Investors & VCs**: Seeking new, disruptive technologies and promising startups to invest in.\n* **Innovators & Tech Enthusiasts**: Exploring emerging trends and sharing breakthrough ideas.\n* **Software Developers & Engineers**: Building innovative solutions or seeking collaboration in new projects.\n* **Cybersecurity Specialists**: Interested in protecting tech innovations and networking with startups.\n* **Data Scientists & Analysts**: Exploring data-driven technologies and connecting with tech leaders.\n* **IT Managers & Team Leads**: Looking to scale their teams, streamline operations, or discover new tools.\n* **Cloud Computing Experts**: Engaging with startups utilizing cloud infrastructure for growth.\n* **AI & Machine Learning Professionals**: Exploring the latest AI trends and networking with innovators.\n* **Industry Professionals**: From tech, finance, or legal sectors offering expertise in scaling businesses.\n* **Business Developers**: Focused on partnerships, collaborations, or market expansion.\n* **Mentors & Advisors**: Offering guidance on business strategy, scaling, or product development.\n\n**Why attend:**\n**1-Minute Elevator Pitches:** Every attendee will have the chance to do a **short, 1-minute pitch** to the room — introduce yourself, share what you’re building or working on, and let others know what kind of co-founder, partner, or expertise you’re looking for.\n**Networking**: Experience an evening of dynamic networking in a relaxed and welcoming atmosphere. Meet IT professionals from diverse backgrounds, including software development, cybersecurity, data science, cloud computing, artificial intelligence, and more.\n**Career Advancement Opportunities**: Explore potential career opportunities by interacting with representatives from leading tech companies and startups. Discover the latest job openings and internships in the IT and Technology sectors.\n**Knowledge Sharing**: Share your experiences and knowledge with fellow professionals during informal knowledge-sharing sessions. Learn from each other's successes and challenges to grow both professionally and personally.\n**Career**: For job seekers, the event offers an exclusive opportunity to meet top tech companies actively recruiting talent, opening doors to exciting career prospects.\nThe event will be held in a sophisticated and vibrant venue, adorned with modern decor and equipped with state-of-the-art facilities to ensure your comfort and convenience throughout the day.\nDon't miss this exceptional opportunity to connect, learn, and grow within the vibrant community of Tech Startups, Entrepreneurs & Professionals . Register now for Tech Startups, Investors, Innovators & Professionals Networking Event: Empowering Connections in the Digital Age, and take the first step towards fostering meaningful connections that will propel your career to new heights.",
    "start_datetime": "2025-11-10T19:00:00-08:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/1/7/7/0/highres_530406000.jpeg",
    "event_url": "https://www.meetup.com/sanfrancisco-startup-pitch-and-networking/events/311240438/"
  },
  {
    "event_id": "310706962",
    "title": "NYC Professionals Happy Hour",
    "description": "City Social Happy Hour\nUnwind after a long week with an evening of great conversations, new connections, and a lively atmosphere at City Social Happy Hour. Whether you’re a young professional, entrepreneur, or just looking to meet like-minded people in NYC, this Friday mixer is the perfect way to ease into the weekend.\n\nWhat to Expect:\n• Vibrant Crowd: Meet professionals from diverse backgrounds—tech, finance, media, startups, and more.\n• Relaxed Vibes: No formal agendas—just great conversations, chill energy, and good drinks.\n• Scenic Venue: Enjoy the laid-back charm of Sugar Mouse NYC with riverfront views and cozy outdoor seating.\n• Buy Your Own Drink: A one-drink minimum per person upon entry helps support our host venue.\n\nWho Should Attend:\n• NYC professionals looking to socialize outside the office.\n• Entrepreneurs and creatives open to new ideas and collaborations.\n• Newcomers to the city wanting to build friendships.\n• Anyone seeking a fun and friendly way to network.\n\nAdditional Info:\n• When: 6 pm to 9 pm\n• Dress Code: Smart casual or after-work attire\n• Admission: Entry will be on a walk-in basis, and venue management reserves the right to limit attendance if walk-in capacity is reached.\n\nLegal Disclaimer\nCity Social Happy Hour is an informal, volunteer-organized social gathering intended solely for networking and community-building purposes. By attending this event, you acknowledge and agree to the following terms:\nThis is a public, non-commercial meetup. The organizers are not responsible for the actions, conduct, or statements of any attendee.\nAttendees participate at their own risk. The organizers disclaim any liability for personal injury, loss, damage, or any other incident that may occur during or as a result of attendance.\nAll participants are responsible for their own food, beverage purchases, and transportation.\nThe event may take place at a third-party venue. The organizers are not affiliated with or acting on behalf of the venue and assume no responsibility for its operations, services, or staff.\nCity Social Happy Hour reserves the right to refuse participation or remove individuals from the event at the organizers’ discretion to maintain a safe and respectful environment.\nBy attending, you consent to being photographed or recorded during the event for promotional and social media use unless you explicitly opt out in writing.\nYour RSVP and/or attendance signifies your acceptance of this disclaimer.",
    "start_datetime": "2025-10-21T18:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/4/4/1/6/highres_529277430.jpeg",
    "event_url": "https://www.meetup.com/citysocialhappyhour/events/310706962/"
  },
  {
    "event_id": "311085594",
    "title": "New York Tech & Beer® - Happy Hour @ Smithfield Hall",
    "description": "This after-work tech happy hour drinks at [Smithfield Hall](https://smithfieldnyc.com/about/) won't disappoint! We'll get together on **Thursday, October 16th** at this popular Chelsea bar to chat, drink, and connect with techies, entrepreneurs, and tech enthusiasts from NYC and beyond.\n\nSmithfield Hall is a classic sports bar. They have tons of beers on tap as well as a full bar, great snacks, and bar bites. Their convenient location makes it accessible for all of us!\n\n**[Buy Us a Coffee](https://buymeacoffee.com/nyctnb)** (/Beer) **if you enjoy our events and want to see more of them! :)**\n\nNew York Tech & Beer® is an NYC social tech drinks and networking community. We host happy hours at bars around the city and occasionally educational tech lectures. Join us to meet new friends, have fun, and maybe get a tip for a job! See you there.",
    "start_datetime": "2025-10-16T19:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/5/b/7/3/highres_530243411.jpeg",
    "event_url": "https://www.meetup.com/nyctnb/events/311085594/"
  },
  {
    "event_id": "311065433",
    "title": "Let's go to the Poster House!!!",
    "description": "Hey yo! Let's go ..........................to the Poster House! This place has posters! Lots of em! It's FREE on FRIDAY! And on this day there's some mask printing event for $10 thats optional if you wanna do it.And theres some band called Whisper Doll playing and the tickets seem to be free if you just click where it says events and you can get 2.They sound kinda like a sad 90s band if thats what youre into.Here's some info about the stuff I mentioned!\n\nhttps://posterhouse.org/exhibitions/\nhttps://posterhouse.org/events\n\nIll wait in the basement area for 15 or 20 minutes so the latecomers have a chance to make it so we can try to look at the posters together.If you come late just call me and I'll try to find you.I dont really check messages on this site during the event so just call or text.\n\nI dont really know if we are gonna eat after the event cause its hard to find a spot that everyone agrees on.Most likely we'll enjoy the museum and then go back to our lives of quiet desperation.\n\nLook for a weird socially awkward bald guy awkwardly standing there in the awkward basement.That's me.Come say Hi.\n\nNick\n631 - 507 - 6820",
    "start_datetime": "2025-10-17T17:45:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/1/1/8/2/highres_530224482.jpeg",
    "event_url": "https://www.meetup.com/socially-awkward-but-im-trying/events/311065433/"
  },
  {
    "event_id": "310375970",
    "title": "New York Trading, Finance & Banking - Professional Networking Affair (Read Info)",
    "description": "***[EVENTBRITE RSVP Mandatory To Attend](https://tinyurl.com/3cwv9t6m)***\nClick Here - https://tinyurl.com/3cwv9t6m\n\n**Join for the New York Finance, Trading & Banking Professional Networking Session.**\nMeet the diverse mix of finance professionals from different/various career levels.\n**LIKE US ON FB FOR FUTURE EVENTS**\n\n**([https://www.facebook.com/NYFINANCE/](https://www.facebook.com/NYFINANCE/))**\n\n***[EVENTBRITE RSVP Mandatory To Attend](https://tinyurl.com/3cwv9t6m)***\nClick Here - https://tinyurl.com/3cwv9t6m\n\nIts will be all about WALL STREET - MARKETS - DEALS\nWe will have a restricted area for our members only. Cash bar, pay for what you order.\n\n**Attendees include but not limited to:**\n• Portfolio Managers\n• M & A Analysts\n• Research Analysts (Buy / Sell Side)\n• MBA Candidates/Students\n• Hedge Fund Service Providers\n• Equity And Derivative Traders\n• Prime Brokerage Professionals\n• Fund Administration Professionals\n• Finance & Accounting Recruiters and HR Professionals.\n\n***[EVENTBRITE RSVP Mandatory To Attend](https://tinyurl.com/3cwv9t6m)***\nClick Here - https://tinyurl.com/3cwv9t6m\n\nAttire – We always recommend to wear business casuals but not mandatory.\n\n**How it would work: ·**\n**• Receive name tag upon arrival. Clearly mention your name and your area of work/interest. ·**\n**• The host will guide you to the main area. ·**\n**• Connect and network with other professionals in a relaxed yet focused environment.**\n\nThe event focus on creating long term professional relationship with experienced finance experts.\n\nMake sure to bring a lot of business cards. if you looking to move-up or move in carrying a copy of your resume is a good idea. Good chance to run into a HR Partner from a bank or hedge fund.\n\n***[EVENTBRITE RSVP Mandatory To Attend](https://tinyurl.com/3cwv9t6m)***\nClick Here - https://tinyurl.com/3cwv9t6m\n\nConnect With Us For Future Events\n**[LIKE US ON FB](https://www.facebook.com/groups/NYNYBankingFinanceNetworking)**\n**[JOIN FB GROUP](https://www.facebook.com/groups/NYNYBankingFinanceNetworking/)**\n**[LinkedIn](https://www.linkedin.com/groups/8444214/)**",
    "start_datetime": "2025-10-20T18:30:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/9/6/8/9/highres_529478537.jpeg",
    "event_url": "https://www.meetup.com/new-york-mergers-and-acquisitions-meetup-group/events/310375970/"
  },
  {
    "event_id": "311180257",
    "title": "New York Story Night Featuring Kanza Javed",
    "description": "**Special New York Story Night event on Oct 20th, featuring author Kanza Javed as our special guest!**\n\nKanza Javed is a Pakistani author with an MFA from West Virginia University, where she received the Rebecca Mason Perry Award. She is also the winner of the 2020 Reynolds Price Prize for Fiction, and her work has appeared in the _American Literary Review, Punch Magazine, Salamander,_ and the _Greensboro Review_, among other publications.\n\nHer newest book, _What Remains After a Fire_, (Norton) is a striking collection of short stories set in Pakistan and across the diaspora. Written with keen psychological insight and deep empathy, these stories reach across divides of class, gender, and religion to examine questions of identity, belonging, and loss. With vivid portrayals of fiercely resilient characters, Javed explores the costs of desire and the courage it takes to carve out space for oneself in circumstances that often resist change.\n\n**Kanza will take over the first hour of New York Story Night reading from her story _“Stray Things Do Not Carry a Soul,”_** which explores addiction, patriarchy, and the darker legacies of violence passed between generations. (Trigger warning: Animal cruelty.) **There will also be an open Q&A for any questions one might have on her writing and her journey as a writer.**\n\n——\n\nNew York Story Night is a literary community event based in Manhattan founded to provide creative writers, amateur and professional alike, a stage on which to share their stories and an audience with which to road test their works. Consider an open mic for stand-up tragedy, stand-up horror, stand-up drama if you will. A night of bedtime stories for adults.\n\n**For those who wish to share a story, please arrive before 7pm and sign-up for a reading slot.** (Find Randy or María at the front of the second floor event space.) For those who wish to be an audience, get a drink, find a favored spot, chit-chat with fellow story lovers if you like!\n\nAt 7pm, reading sign-ups close and we beginning our story night. Each writer gets 20 minutes to share their story. If the story is under the 20 mins, the remainder of the 20 minutes becomes a brief Q&A for feedback or questions with the audience. We have a 10 minute intermission at the end of every hour.\n\n**Rules for stories:**\n- Stories must be under 20 mins (around 3,000 words)\n- All stories must be written pieces\n- Stories can be fiction or non-fiction but must be narrative driven\n- No poetry, no essays\n\nWe encourage you to email us at newyorkstorynight@gmail.com if you have questions or concerns on if your story is a good fit for our event.\n\nIf you cannot attend this particular event but would like to be in tune with our next ones join our MeetUp group, check us out on Instagram @NewYorkStoryNight, or email us at newyorkstorynight@gmail.com to be added to our e-mailing list!\n\n**New York Story Night is a free event.**\n\n_*By attending, you acknowledge that you may appear in photos and videos used for social media or promotional purposes._",
    "start_datetime": "2025-10-20T19:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/3/d/b/7/highres_530355799.jpeg",
    "event_url": "https://www.meetup.com/new-york-story-night/events/311180257/"
  },
  {
    "event_id": "310993155",
    "title": "Unreal NYC | October Event - Sponsored by Epic Games (APPROVAL REQ'D) Age 21+",
    "description": "**IMPORTANT:**\nEpic Games is kindly sponsoring the event and hosting us at their NYC office, similar to our May event earlier this year!\n\nFor safety and security, if you would like to attend the event **[you must fill out a brief Google Form](https://forms.gle/Rtj8qGZR6r6pdaUy7)** and final approval for attendance will be sent on a rolling basis. If you do not receive a response, it is possible the event is full or other factors were at play. Attendance confirmed on meetup.com **DOES NOT** equate to approval from Epic. **DO NOT try to attend if you have not been approved -** Epic will not let you in. Similarly, note that despite the address listed as B&H Photo, the event is not at B&H Photo (meetup just requires us putting something there). The real address will be emailed after signing the NDA. **Please try to arrive before 7:00p**, as that is when the building is locked to the public.\n\nThat all being said, as organizers of this thriving community we will be making every effort to record and broadcast the live presentations.\n\n**ALSO IMPORTANT:**\nAlcohol will be served for this event so **only people 21 years of age and older will be allowed to attend.**\n\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\\-\n\nHello! Join us for our *sort-of* ;) monthly **Unreal NYC Meetup**, where we dive into all the latest features of Unreal Engine and network with other professionals in games, animation, film, broadcast, live events, and more.\n\n​Each meetup features technical sessions, live demos, and discussions with community experts.\n\n**Working on something cool in Unreal?** Mention it and bring it along! We'll encourage everyone to try each other's demos and provide feedback.\n\n**SPEAKERS**\n**Woody Davis**\n“*Recreating my life in Unreal Engine!”*\nCreative technologist Woody Davis breaks down his work using Real-time avatars, vtubers, and live stream experiences as well as how he uses Unreal in unconventional ways to create personal and inviting interactive experiences and content.\n[Woody website](https://www.woodydevs.com)\n\n**Matt Workman**\n“*Metahumans and AI*”\n[Narrative Motion](https://narrativemotion.com) \\| [LinkedIn](https://www.linkedin.com/in/mattworkman/) \\| [X](https://x.com/cinedatabase)\nMatt Workman shares his work with MetaHumans and discusses the new UE 5.6 workflows. He will also share some of his work and thoughts about using AI with Unreal Engine.\n\n**This event is Sponsored by Epic Games!**\n\n**[REMINDER AGAIN TO PLEASE FILL OUT THIS FORM](https://forms.gle/Rtj8qGZR6r6pdaUy7)**",
    "start_datetime": "2025-10-22T18:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/b/f/0/4/highres_530508900.jpeg",
    "event_url": "https://www.meetup.com/unrealengine/events/310993155/"
  },
  {
    "event_id": "310945804",
    "title": "NJ Code & Coffee - Newark Tech Week edition",
    "description": "Calling all New Jersey techies to the **NJ Code and Coffee** tech community meetup at the EqualSpace ES550 Tech & Innovation campus during Newark Tech Week!\n\nCode and Coffee is an inclusive, informal networking/co-working session for those in tech (and the tech-curious).\nThat includes operators, founders, and investors. Developers, data engineers, UX/UI designers, data scientists, product managers, software engineers, solution architects... **all are welcome!**\n\nPeople of all skill and experience levels can attend, we love it that way. Many people (optionally) bring projects to work on, and many other people (optionally) socialize the entire time. It's entirely up to you!\n\nCome grab a cup of coffee and meet new people, share stories, find collaborators, talk about everything tech, talk about everything NOT tech, take a break from job applications, get away from the computer screen, make connections, make conversation, **make friends!**\n\n**Agenda:**\n**2pm:** Doors open, networking starts\n**2:30pm:** Intro circle\n**3pm:** networking continues\n**5pm:** event ends\n\n**The Intro Circle**\n**Near the beginning of the event (about 2:30 pm), we will do a standup in a circle:**\nWe first talk about organizer announcements, updates, and logistics. Then we go around the circle where each person says:\n\n* your name and job title/ role in tech/ tech stack,\n* What you can help others with,\n* What you would like help with,\n* Job opportunities you're hiring for OR announce that you are looking for one. If none, that's cool.\n\nAfter the introduction circle, everything is self-organized.\n\n**Community Discord - come hang out before and after!:**\n[www.codeandcoffee.chat](www.codeandcoffee.chat)\n\n**The Venue**\nEqual Space is a premium share-space created with multicultural business owners in mind, =SPACE equips founders with resources, programming and a powerful network.\n\nHeadquartered in the City of Newark, their share-space provides resources for startups, coaching for tech companies, and a wealth of intellectuals to collaborate and build with. The next wave in enterprises is being born within their walls. Become a part of the story: [EqualSpace.co/](https://equalspace.co/)",
    "start_datetime": "2025-10-18T14:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "",
    "event_url": "https://www.meetup.com/nj-code-coffee/events/310945804/"
  },
  {
    "event_id": "304160161",
    "title": "NYC Movie Free Tour Vol.2 (Manhattan)",
    "description": "Only rain can stop us!\n\nAre you ready for the second gorgeous movie tour Neverwinterers?\nWe would like to continue our Neverwinter tradition and make another tour around the historical places of the Big apple.\nBring your camera and your friends as this time we will walk through movie shooting places in Manhattan.\nThis is NOT a loop walk.\n\nOctober 19 (Sunday)\nStarts at 4:30 PM\n\nMeeting: in front of InterContinental New York Times Square, an IHG Hotel (300 W 44th St, New York)\n[https://maps.app.goo.gl/W4UEWifeP1nAkAJ47](https://maps.app.goo.gl/W4UEWifeP1nAkAJ47)\n\nEndpoint: Upper East Side\n[https://maps.app.goo.gl/YMDQGWpht5ck8LCV9](https://maps.app.goo.gl/YMDQGWpht5ck8LCV9)\n\nOnly photostops. NO foodstops.\nTotal distance is about 4 miles.\nAbout 90 min walk\n\nOur FB group: [www.facebook.com/groups/411244719715342](http://www.facebook.com/groups/411244719715342)\nOur meetup group: [www.meetup.com/tri-state-free-parties/](http://www.meetup.com/tri-state-free-parties/)\nWhatsapp group: https://chat.whatsapp.com/GVXEFcR4PMjH70KLNlbpRV\nTelegram: [https://t.me/neverwinterfree](https://t.me/neverwinterfree)\n\nPlease apply via:\nWechat: cozmo31\nIG: neverwinter_free_parties\nLINE: cozmo31\n[www.meetup.com/messages/?new_convo=true&member_id=286948809](http://www.meetup.com/messages/?new_convo=true&member_id=286948809)\n\nDisclaimer of liability:\nBy participating in this activity you agree that organizers are not to be held responsible for any damages, injuries, or losses that may occur before, during or after the event.",
    "start_datetime": "2025-10-19T16:30:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/7/9/6/8/highres_524251080.jpeg",
    "event_url": "https://www.meetup.com/neverwinter-free-hiking-and-cycling/events/304160161/"
  },
  {
    "event_id": "311086733",
    "title": "Media/Advertising Professionals Meet",
    "description": "Meet NYC professionals in PR, media/advertising agencies, Ad platforms, Ad measurement, data, analytics and all the tech that powers the world of marketing.\n\nPS:\n\n* Event is free to attend. No cover, no drink minimums. Each guest will cover their own tab at the bar.\n* Please sign up only if you plan on attending #noflakes.\n* Our organizers do this purely for networking. We don’t get any monetary benefits #bekind.\n* Appropriate profile photo is mandatory.",
    "start_datetime": "2025-10-21T18:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/9/8/d/8/highres_527019128.jpeg",
    "event_url": "https://www.meetup.com/ny-media-and-advertising-group/events/311086733/"
  },
  {
    "event_id": "311325286",
    "title": "Hacktober Fork-a-thon",
    "description": "Are you spooked at the thought of making your first contribution to open source software? Or are you a veteran Gopher that can't find the time after spending all day fighting the ticket backlog zombies? Come join us for our first fork-a-thon where we'll make valuable contributions to open source projects built with Go, network with fellow Gophers, and enjoy pizza and drinks.\n\nPizzas, drinks, and office space generously provided by Motion Recruitment.\n\n**Where**:\nMotion Recruitment Offices NYC - 11 E 44th St #400, New York, NY 10017\n\n**When**:\nOctober 16th, 2025 - 5:30pm - 8:30pm\n\n**Agenda:**\n5:30pm - 6:00pm - Doors Open, Networking\n6:00pm - 6:10pm - Opening Remarks\n6:10pm - 8:30pm - Fork-a-thon and more networking\n\n**Sponsors:**\nMotion Recruitment",
    "start_datetime": "2025-10-16T17:30:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/a/d/3/1/highres_530504337.jpeg",
    "event_url": "https://www.meetup.com/golanguagenewyork/events/311325286/"
  },
  {
    "event_id": "311507803",
    "title": "Sunday Social: Coffee & Tea & New Friends",
    "description": "Join us Sunday afternoon for a social where you can make new friends and conversations while sipping on your warm beverages. ☕️\n\nWhether it is you want to make new friends or build your socializing skills or make connections, this group is for you to join. Whether you’re new or visiting NYC, you’re welcome to come and join. 😊\n\nOptional:\nYou may bring your own board games or card games as activities to do with other members where you can bring the ice as well. 🎲\n\nInstructions:\nOn your arrival, please do approach me so you can receive a name-tag sticker you can put on and you will receive a short introduction on how our socials work.\n\nHow to join:\n\nWe have a dedicated Slack community where we share the location, photos, new events, and other information. 💬\n\nPlease join the community\\, and you'll meet people who'll be coming to this event\\. \\[https://join\\.slack\\.com/t/newyorksocials\\-flock/shared_invite/zt\\-38vc5f30l\\-l4e_tUU7xHrB0ZNkVA\\~oCw\\]\\(https://join\\.slack\\.com/t/newyorksocials\\-flock/shared_invite/zt\\-38vc5f30l\\-l4e_tUU7xHrB0ZNkVA\\~oCw\\)",
    "start_datetime": "2025-10-19T13:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/e/8/f/7/highres_530699639.jpeg",
    "event_url": "https://www.meetup.com/nyc-social-meet-up/events/311507803/"
  },
  {
    "event_id": "310731171",
    "title": "*In Person* Practice and improve your public speaking skills!",
    "description": "Having an in-person meeting at Gran Merci. The entrance is the southwest corner of 24th and 3rd.\n\nWe are one of few Toastmasters clubs in NYC offering in-person meetings and we encourage you to take advantage of this opportunity for in-person communication and networking.\n\nInterested in improving your public speaking skills?\n\nWant to meet new people and engage in interesting discussions?\n\nHoping to make new business and life connections?\n\nIf so we welcome you to attend the next Greenspeakers meeting. Greenspeakers is a Toastmasters club that was founded by Green Party members to provide a forum for engaged progressive activists and professionals to improve their public speaking skills. Guests of all political persuasions are welcome and we have no official connection to any political party.\n\nAll attendees will have a chance to practice public speaking and will learn helpful tricks to become a more confident public speaker and communicator.\n\nHope to see you there!",
    "start_datetime": "2025-10-28T18:45:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/a/2/b/8/highres_466961656.jpeg",
    "event_url": "https://www.meetup.com/greenspeakers/events/310731171/"
  },
  {
    "event_id": "311073512",
    "title": "New York dbt Meetup | The Lego Approach",
    "description": "**The Lego Approach to Data Transformation: Building Modular DBT Pipelines at Scale**\n\n😎It's here! Our next dbt meetup is coming up and will be hosted at the DoubleVerify office:\n\n* 28 Crosby St, floor 6\n* New York, NY 10013\n\nWe are looking forward to socializing and seeing all of the new and familiar faces!\n\n💡dbt Meetups are networking events open to all folks working with data! Talks predominantly focus on community members' experience with dbt, however, you'll catch presentations on broader topics such as analytics engineering, data stacks, data ops, modeling, testing, and team structures.\n\nToday, we'll explore the performance implications of abstraction at scale, share lessons on getting teams to embrace reusable components over custom implementations, and discuss practical strategies for identifying what to abstract. Learn how our modular approach reduced new data source onboarding from 3 weeks to 2 days while ensuring consistent metrics across all pipelines.\n\nIf you're struggling with metric consistency or drowning in duplicated transformation logic, you'll leave with concrete patterns to make your DBT projects more maintainable and scalable.\n\n🏠Venue Host: [DoubleVerify](https://doubleverify.com/)\n🍕Catering: TBD\n🤝Organizer: [Brooklyn Data](https://www.brooklyndata.co/) + DoubleVerify\n📣 Agenda and additional details below:\n\n* 6:30pm Intro remarks \\| Refreshments & Conversation\n* 7:00-7:25pm Aravind Ramesh + Mahima Arya Q&A (see topic below)\n* 7:30-7:40pm Closing remarks\n* 7:45-9:00pm Swag, Reception & Networking\n\n✨Speakers and Topic:\n\n* Aravind Ramesh, Sr. Dir Software Engineer and Mahima Arya, Sr. Manager, Software Engineer at DoubleVerify, will dive into The Lego Approach to Data Transformation: Building Modular DBT Pipelines at Scale\n\n**Our Host:** At DoubleVerify, we process billions of ad events from dozens of sources, constantly rebuilding the same complex transformations—fraud detection, viewability, and brand-safety metrics—for every new pipeline. This talk shows how we applied core programming principles (abstraction, modularity, DRY) to transform scattered SQL into reusable DBT packages. Like Lego blocks with standard connections, we built a three-layer architecture: raw data, standardized signals, and modular packages that work with any conforming input.\n\n**Our Tool:** dbt is the standard in data transformation, used by over 40,000 organizations worldwide. Through the application of software engineering best practices like modularity, version control, testing, and documentation, dbt’s analytics engineering workflow helps teams work more efficiently to produce data the entire organization can trust. Learn more: [https://www.getdbt.com/](https://www.getdbt.com/)\n\nOur venue has capacity limits, so please only RSVP if you intend to come and reach out to [amsal.alic@velir.com](amsal.alic@velir.com) if you need to cancel at the last minute. At any time, you may update your RSVP status on the Meetup to \"Not Going.\"\n\n➡️ Join [the dbt Slack community ](https://www.getdbt.com/community/)\n🤝For the best Meetup experience, make sure to join the #local-nyc channel in dbt Slack [https://slack.getdbt.com/]\n\n🎤 Interested in speaking at a future meetup? Submit your interest using [this form](https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Fforms.office.com%2Fr%2FhAb6NqeH4X&data=05%7C02%7Cjill.roberson%40velir.com%7Ca6edbc89d89d4b0ff49c08ddf54a282e%7C750f89c4532d43399fd9b605eca241c8%7C1%7C0%7C638936421054142251%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=11%2FFS6TG0YOyVPa4PECBE1OBgdcojE4KjoybGmRGYlk%3D&reserved=0 \"https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Fforms.office.com%2Fr%2FhAb6NqeH4X&data=05%7C02%7Cjill.roberson%40velir.com%7Ca6edbc89d89d4b0ff49c08ddf54a282e%7C750f89c4532d43399fd9b605eca241c8%7C1%7C0%7C638936421054142251%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&sdata=11%2FFS6TG0YOyVPa4PECBE1OBgdcojE4KjoybGmRGYlk%3D&reserved=0\"), and we'll be in touch!\n\nTo attend, please read the Required Participation Language for In-Person Events with dbt Labs: [https://www.getdbt.com/legal/health-and-safety-policy](https://www.getdbt.com/legal/health-and-safety-policy)\n\nAll participants are welcome. For questions regarding access and accommodation, please contact [amsal.alic@velir.com](amsal.alic@velir.com) in advance.",
    "start_datetime": "2025-10-28T18:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/a/4/a/e/highres_530502158.jpeg",
    "event_url": "https://www.meetup.com/nyc-dbt-meetup/events/311073512/"
  },
  {
    "event_id": "309926430",
    "title": "Boardgames at Overlook in Midtown East! New players welcome!",
    "description": "Hey! Join us at The Overlook from 7pm-10:30pm for some board games! We're on the second floor, just walk to the back and go up the stairs. The food and drinks are amazing and even better, the bar has specials on Wednesdays where they have $1 Bud Light from 7-9 and $3 green tea shots from 9-11!\n\nWe primarily play party games such as Codenames, Just One, Anomia, Exploding/Zombie Kittens, Telestrations, and One Night Werewolf. We find those are easy to play/learn and get people having fun and maybe making a few new friends along the way! We have quite a few games, but if there is a particular game(s) you would like to play, please feel free to bring them along. We love learning and playing new games!\n\nDISCLAIMER: There is a 2 item minimum. This can be two sodas, but it can not be two $1 beers. This is to support the bar and is a \"thank you\" to them for reserving and setting up the space for us to have a great time! There is also a $20 min on cards, but cards can be shared, and I'll be more than happy to split with anyone who may need.\n\nA $2 donation for game upkeep is optional, but always appreciated. Venmo QR code will be available if you prefer not to carry cash.\n\nCome alone or bring a friend, new players welcome! We look forward to seeing you all!",
    "start_datetime": "2025-10-22T19:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/9/4/8/1/highres_518438017.jpeg",
    "event_url": "https://www.meetup.com/boardgame-icebreakers/events/309926430/"
  },
  {
    "event_id": "311359250",
    "title": "Make friends over pub and grub!",
    "description": "Make some cool friends while we pub and grub at *Wicked Willy's -* Greenwich Village edition!\n\nEscape into a Caribbean oasis of pirates, palm trees, and endless fun!\nVenue info: *[https://wickedwillys.com/](https://wickedwillys.com/)*\n\n**Join us and make new friends!**\n\nEvent is free to attend: no cover, no drink minimum.\n\nPS: Please sign up only if you plan on attending. #noflakes\n\nAppropriate profile photo is mandatory.",
    "start_datetime": "2025-10-23T18:30:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/4/0/e/d/highres_528976621.jpeg",
    "event_url": "https://www.meetup.com/ny-pub-and-grub/events/311359250/"
  },
  {
    "event_id": "310438288",
    "title": "Outdoor Badminton in Central Park",
    "description": "Hello! 🙋‍♀️🙋‍♂️\n\nWelcome to our NYC Outdoor Badminton family 👋, where everyone is welcome 😊, whatever your age 🥳, fitness level 🏋️‍♂️, badminton skills 🏸, or planet of origin. 🌎 We are a fun-loving 🎉, accepting 👌, hilarious 🤣, respectful 🙏, and wholesome 💕 group of badminton lovers, and we would love for you to join us!\n\nYou don't need to bring anything but your wonderful self! 🤩 We provide the badminton equipment including nets, rackets, birdies/shuttlecocks, and even picnic blankets for you to sit on in and make new friends 😁. Of course, you're welcome to use your own equipment if you prefer. 🎒 It is optionally recommended to bring water for hydration 💦, energy food 🍫 to keep your motor running, and sunscreen for healthy skin under the sun 🌞.\n\nThere are lots of beginners and newcomers each weekend, so if you're one of these, don't worry.\n\nIf you can't find us, you can try giving one of us organizers a call or text📞\n\n😎Thomas: 917-696-0112\n😉Will: 917-670-0353\n🤗Kenny: 347-986-4247\n😊Sumie: 646-425-7597\n\nAll of this is free (find some other way to spend your 💵) but we do accept voluntary donations that help pay for shuttles, rackets and nets (Venmo: @NYCOutdoorBadminton). Thanks in advance for your generous donations 🙇‍♂️, and helping to make our community better! 👩🏻‍🤝‍🧑🏽\n\nFAQ\n\n* We are wholesome and newcomer/beginner friendly! 💝\n* We provide all the equipment including nets, rackets and birdies! 🏸\n* It's recommended to bring water and snacks! 🍉\n* You don't need to arrive exactly at the start time! ⏰\n* It's a great place to make new friends! 👨‍👩‍👧‍👦\n\nAlso, join our Discord server to be involved in our activities and conversations outside of badminton: https://discord.gg/KEfNm9z8xd\n\n🌦️ Weather Watch! 🌦️\nOur leadership team is keeping a close eye on the skies and will make any final call about postponing or canceling Badminton by 10 AM on game day.\n\n⛅ We know everyone’s excited (or anxious) about the weather — but when too many folks start sharing forecasts in the group chat, it can get confusing! While we’re working on the best plan for everyone, we kindly ask you to hold back on weather updates and let us do the worrying for you. 😉",
    "start_datetime": "2025-10-18T12:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/8/8/2/highres_496682178.jpeg",
    "event_url": "https://www.meetup.com/nyc-outdoor-badminton/events/310438288/"
  },
  {
    "event_id": "310682410",
    "title": "Fort Tryon Sketch & Book Event!",
    "description": "This will be a special kind of sketching event: a joint sketching and book signing in conjunction with the Fort Tryon Park Trust. We'll tour different spots in the park and I'll speak to the park's history for a few minutes, just like in my book Unknown New York. And then we'll draw at each spot. You can purchase a book if you like and get it signed, but that's totally optional. If you just come to sketch, that's fine. Fort Tryon is one of my favorite parks to draw in, with its scenic views across the Hudson.\n\n**Note the different time - 1:00! We'll meet at the main entrance to the park,** which is next to the 190th St. stop on the A train, on the small circle road called Margaret Corbin Plaza. **Please don't be late or you might get lost. :)**\n\nAny problems on the day of the event, I can be reached at 646-831-9816.\nLooking forward to sketching with you!\n\n***\n\nIMPORTANT: In case of rain, I will let people know early in the morning if it is canceled, and then reschedule for another day.\n\n***\n\nWhat makes our Meetups different from other art groups and classes? There's no instruction, but we like to share our work, and chat and be inspired. Share tips and learn from people in a casual environment where all levels of artists are welcome! Don't be shy to ask anyone anything!\n\n• We sketch for a bit, usually 45 minutes or so, and then get back together and share our drawings, and then sketch again, etc. There's usually time for 3 sketches.\n\n• Please bring your own supplies - anything you like to work with - pens, pencil, watercolor, pastel, small sketchbook or large paper, iPad, whatever suits you.\n\n• We hand out nametags so everyone can meet one another!\n\n• We take photos to share on the site later. Take a bunch!\n\n• Sorry, but please leave the dogs at home; they tend to step on the artwork. Thanks.\n\n• The Meetup is FREE and everyone at all skill levels is welcome!\n\n***\n\nPlease note that if you add a comment below it will spam everyone with an email, so please use your judgment.",
    "start_datetime": "2025-10-18T13:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/2/1/2/9/highres_529808489.jpeg",
    "event_url": "https://www.meetup.com/sketching/events/310682410/"
  },
  {
    "event_id": "311050483",
    "title": "Sketch Central Park's Fall Leaves!",
    "description": "Central Park is beautiful no matter what the season, but autumn is incredible. The trees should be changing color by now. Let's sketch them from two locations: Hernshead, an outcropping into the lake, and the Ramble, Central Park's forest.\n\n**We'll meet at the entrance to the park at West 77th Street and Central Park West. Don't be late or you WILL get lost!**\n\nAny problems on the day of the event, I can be reached at 646-831-9816.\n\nLooking forward to sketching with you!\n\n***\n\nIMPORTANT: In case of rain, I will let people know early in the morning if it is canceled, and then reschedule for another day.\n\n***\n\nWhat makes our Meetups different from other art groups and classes? There's no instruction, but we like to share our work, and chat and be inspired. Share tips and learn from people in a casual environment where all levels of artists are welcome! Don't be shy to ask anyone anything!\n\n• We sketch for a bit, usually 45 minutes or so, and then get back together and share our drawings, and then sketch again, etc. There's usually time for 3 sketches.\n\n• Please bring your own supplies - anything you like to work with - pens, pencil, watercolor, pastel, small sketchbook or large paper, iPad, whatever suits you.\n\n• We hand out nametags so everyone can meet one another!\n\n• We take photos to share on the site later. Take a bunch!\n\n• Sorry, but please leave the dogs at home; they tend to step on the artwork. Thanks.\n\n• The Meetup is FREE and everyone at all skill levels is welcome!\n\n***\n\nPlease note that if you add a comment below it will spam everyone with an email, so please use your judgment.",
    "start_datetime": "2025-11-08T11:00:00-05:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/c/0/e/6/highres_530209382.jpeg",
    "event_url": "https://www.meetup.com/sketching/events/311050483/"
  },
  {
    "event_id": "311092776",
    "title": "AI Agent World Tour in NYC",
    "description": "# **AI Agents in NYC**\n\nThe MLOps Community AI Agent World Tour is coming to New York City this October, and if you’re building or thinking about building AI agents, this is where you want to be.\n\nWhat to Expect:\n\n**​Two hands-on masterclasses conducted by experts.**\n\n* ​[Building Declarative AI Agents Supervised and Hierarchical with Auth](https://luma.com/agentauthentication). Register [here](https://luma.com/agentauthentication).\n* ​[Vibe-Code Agents You Never Found Time to Build](https://luma.com/vibecodeagents)[ ](https://luma.com/t7n3fujb)with Vellum. Register [here](https://luma.com/vibecodeagents).\n\n​Grab your tickets at the early bird discount for $200 only available for the next three weeks!\n\n**​[Founders Pitch Competition](https://luma.com/foundersroom)** \\- A dedicated plenary event for founders\\, startup professionals\\, and VCs to come together and spotlight the next generation of AI startups\\.\n\n***\n\n​**​30+ booths featuring teams that are actually building production grade AI Agents.**\n​Come chat with engineers directly, one-on-one. Ask questions and get the answers you really want.\n\n​Email [Minushi,](http://%20minushi@mlops.community/) if interested in a booth.\n\n**Relevant Talks**\nExpert keynote talks, lightning talks and a panel discussion by specialists.\n\n​​**Laser Focused Rooms**\n​Rooms dedicated to hot topics led by groups of experts.\n\nLuma page here: [https://luma.com/agentsummitNYC](https://luma.com/agentsummitNYC)",
    "start_datetime": "2025-10-16T16:30:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/7/9/b/d/highres_530251165.jpeg",
    "event_url": "https://www.meetup.com/mlops-nyc/events/311092776/"
  }
]