[
  {
    "event_id": "310438288",
    "title": "Outdoor Badminton in Central Park",
    "description": "Hello! 🙋‍♀️🙋‍♂️\n\nWelcome to our NYC Outdoor Badminton family 👋, where everyone is welcome 😊, whatever your age 🥳, fitness level 🏋️‍♂️, badminton skills 🏸, or planet of origin. 🌎 We are a fun-loving 🎉, accepting 👌, hilarious 🤣, respectful 🙏, and wholesome 💕 group of badminton lovers, and we would love for you to join us!\n\nYou don't need to bring anything but your wonderful self! 🤩 We provide the badminton equipment including nets, rackets, birdies/shuttlecocks, and even picnic blankets for you to sit on in and make new friends 😁. Of course, you're welcome to use your own equipment if you prefer. 🎒 It is optionally recommended to bring water for hydration 💦, energy food 🍫 to keep your motor running, and sunscreen for healthy skin under the sun 🌞.\n\nThere are lots of beginners and newcomers each weekend, so if you're one of these, don't worry.\n\nIf you can't find us, you can try giving one of us organizers a call or text📞\n\n😎Thomas: 917-696-0112\n😉Will: 917-670-0353\n🤗Kenny: 347-986-4247\n😊Sumie: 646-425-7597\n\nAll of this is free (find some other way to spend your 💵) but we do accept voluntary donations that help pay for shuttles, rackets and nets (Venmo: @NYCOutdoorBadminton). Thanks in advance for your generous donations 🙇‍♂️, and helping to make our community better! 👩🏻‍🤝‍🧑🏽\n\nFAQ\n\n* We are wholesome and newcomer/beginner friendly! 💝\n* We provide all the equipment including nets, rackets and birdies! 🏸\n* It's recommended to bring water and snacks! 🍉\n* You don't need to arrive exactly at the start time! ⏰\n* It's a great place to make new friends! 👨‍👩‍👧‍👦\n\nAlso, join our Discord server to be involved in our activities and conversations outside of badminton: https://discord.gg/KEfNm9z8xd\n\n🌦️ Weather Watch! 🌦️\nOur leadership team is keeping a close eye on the skies and will make any final call about postponing or canceling Badminton by 10 AM on game day.\n\n⛅ We know everyone’s excited (or anxious) about the weather — but when too many folks start sharing forecasts in the group chat, it can get confusing! While we’re working on the best plan for everyone, we kindly ask you to hold back on weather updates and let us do the worrying for you. 😉",
    "start_datetime": "2025-10-18T12:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/8/8/2/highres_496682178.jpeg",
    "event_url": "https://www.meetup.com/nyc-outdoor-badminton/events/310438288/"
  },
  {
    "event_id": "311504520",
    "title": "TOPSPIN - The NYC Ping Pong Meetup Group",
    "description": "Welcome to the revival of the Fat Cat Meetup group! We are now called TOPSPIN and our new home is SPIN. It’s just $15 to play for 3 hours! All levels are welcomed! From beginners to experts - you’ll be able to find good matches with us. There are drink and food specials so come hungry and thirsty! Paddles can be borrowed from SPIN at no additional cost. Please RSVP “yes” in order to attend. \\*If you secure a spot or are on the waitlist and learn later that that you can’t make it, please be sure to change your RSVP to “no.” \\*This must be done by 12pm on the day of the Monday event or 9am for the Saturday event. \\*If you change your rsvp to no after the 12pm or 9am deadlines, or if you don’t show up, you will be marked a “no show.” \\*If you have attended previously, you will be removed from the group after 2 no shows. \\*If you are a no show for your 1st meetup, you will be removed immediately. \\*If you have RSVP’d to bring a guest and the guest doesn’t show, their absence will count as a no show against you. \\*THOSE ON THE WAITLIST SHOULD NOT COME TO THE EVENT UNLESS THEY HAVE RECEIVED NOTIFICATION THAT THEY HAVE MADE IT TO THE YES LIST. THOSE ON THE WAITLIST NEED TO CHECK IN PERIODICALLY TO SEE IF THEY'VE SHIFTED TO THE YES LIST AS MEETUP DOES NOT NOTIFY YOU OF THIS SHIFT. look forward to seeing you all! -Kevin 🏓\n\nUPDATED TOPSPIN MEETUP MATCH/WARM-UP RULES:\n\n•After the 1st 30 minutes of the Meetup there are NO MORE MATCH WARMUPS. No exceptions. You must begin the match immediately when you approach the table. This will give everyone more match time in the end. Warmups within the 1st 30 min of the Meetup cannot exceed 2 minutes.\n•You can only be signed up on one table at a time. No Exceptions! If you notice that another player is signed up on multiple tables you have permission to cross them off but please, kindly remind them of the rule.\n•2 win maximum. After 2 match wins you must leave the table and sign up again.\n•Please don’t be offended if a fellow player reminds you of these rules. The rules are in place to maximize play for everyone.",
    "start_datetime": "2025-10-18T14:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/8/8/3/b/highres_502174875.jpeg",
    "event_url": "https://www.meetup.com/topspin-the-new-york-ping-pong-meetup-group/events/311504520/"
  },
  {
    "event_id": "308956805",
    "title": "Central Park beginner Runners",
    "description": "*note: please rsvp as “going” only if you are actually going to allow others to come as the max slot is set to 20! Thanks!\n\nRunning can be overwhelming and a bit daunting if you are just starting out. That’s why we’ve created the Central Park Beginner Runners Club, a relaxed, no pressure group for anyone looking to ease into running, enjoy the outdoors, and meet friendly faces along the way. Whether you’ve never run a mile or are just getting back into it, we’ll take it slow together with an easy 3 mile jog on Sunday mornings.\n\nIf you need to take a breather and walk, please feel free to let me know and we can slow down. All i ask is that you try your best! However, there is no pressure as this is a beginner friendly group!\n\nIf you're interested in running together, feel free to join us anytime! We'll gather every Sunday morning at the Gapstow bridge. You can expect the pace to be anywhere between 10-13min mile pace.\n\nOur usual route will start from the Gapstow bridge then we will run up north to the reservoir and do a lap around. That should be about 3 miles. Depending on how people feel, we may jog back to the original meetup spot or we can walk back. 🙃\n\nWe'll meet at 10:00 AM and aim to finish by 11:00 AM at the latest. Please bring the bare minimum as it may be difficult to find a place to store your stuff!\n\nWhether you're a beginner runner, looking to lose weight, or just want to run, everyone is welcome!",
    "start_datetime": "2025-10-19T10:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/3/4/c/8/highres_515293512.jpeg",
    "event_url": "https://www.meetup.com/central-park-beginner-runners/events/308956805/"
  },
  {
    "event_id": "311535293",
    "title": "TOPSPIN - The NYC Ping Pong Meetup Group",
    "description": "Welcome to the revival of the Fat Cat Meetup group! We are now called TOPSPIN and our new home is SPIN. It’s just $15 to play for 3 hours! All levels are welcomed! From beginners to experts - you’ll be able to find good matches with us. There are drink and food specials so come hungry and thirsty! Paddles can be borrowed from SPIN at no additional cost. Please RSVP “yes” in order to attend. \\*If you secure a spot or are on the waitlist and learn later that that you can’t make it, please be sure to change your RSVP to “no.” \\*This must be done by 12pm on the day of the Monday event or 9am for the Saturday event. \\*If you change your rsvp to no after the 12pm or 9am deadlines, or if you don’t show up, you will be marked a “no show.” \\*If you have attended previously, you will be removed from the group after 2 no shows. \\*If you are a no show for your 1st meetup, you will be removed immediately. \\*If you have RSVP’d to bring a guest and the guest doesn’t show, their absence will count as a no show against you. \\*THOSE ON THE WAITLIST SHOULD NOT COME TO THE EVENT UNLESS THEY HAVE RECEIVED NOTIFICATION THAT THEY HAVE MADE IT TO THE YES LIST. THOSE ON THE WAITLIST NEED TO CHECK IN PERIODICALLY TO SEE IF THEY'VE SHIFTED TO THE YES LIST AS MEETUP DOES NOT NOTIFY YOU OF THIS SHIFT. look forward to seeing you all! -Kevin 🏓\n\nUPDATED TOPSPIN MEETUP MATCH/WARM-UP RULES:\n\n•After the 1st 30 minutes of the Meetup there are NO MORE MATCH WARMUPS. No exceptions. You must begin the match immediately when you approach the table. This will give everyone more match time in the end. Warmups within the 1st 30 min of the Meetup cannot exceed 2 minutes.\n•You can only be signed up on one table at a time. No Exceptions! If you notice that another player is signed up on multiple tables you have permission to cross them off but please, kindly remind them of the rule.\n•2 win maximum. After 2 match wins you must leave the table and sign up again.\n•Please don’t be offended if a fellow player reminds you of these rules. The rules are in place to maximize play for everyone.",
    "start_datetime": "2025-10-20T18:30:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/8/8/3/b/highres_502174875.jpeg",
    "event_url": "https://www.meetup.com/topspin-the-new-york-ping-pong-meetup-group/events/311535293/"
  },
  {
    "event_id": "311135715",
    "title": "Let’s Play Pickleball! Overpeck Park",
    "description": "Join us as we play pickleball on a Sunday afternoon! This event will surely be a fun one, and it’s also good exercise!\n\nThis event is for beginners. Please bring your own pickleball paddle and balls .\n\nBring water if you want to stay hydrated and snacks in case you get hungry.\n\nPlease be aware that since I am not able to reserve a court(s) in advance, we might have to wait for a court to open up!\n\nWe will meet at the pickleball courts, which are across the street from the Overpeck Park Amphitheater.\n\nLiability Waiver:\nHiking, Pickleball, Walking and other outdoor activities have inherent risks. Your participation in our events could be dangerous and can result in severe injury, medical emergency, even death. You agree to participate in this event completely at your own risk and to take full responsibility for your own safety and well-being, including those of your guests.\n\nThere are restroom facilities available across the street from the pickleball courts.\n\nIf you are not coming, please change your rsvp accordingly. Thank you!",
    "start_datetime": "2025-10-19T14:30:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/c/6/b/8/highres_529970872.jpeg",
    "event_url": "https://www.meetup.com/north-jersey-bowling-soccer-volleyball/events/311135715/"
  },
  {
    "event_id": "311261369",
    "title": "Pickleball - Jersey city - make sure to RSVP",
    "description": "Make sure to RSVP in Cutelama - www.cutelama.co\n\nWe charge a nominal $5 charge so that people don’t fake rsvp and actually show up.",
    "start_datetime": "2025-10-17T18:30:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/7/1/2/2/highres_528748962.jpeg",
    "event_url": "https://www.meetup.com/bronx-sociale-meetup-group/events/311261369/"
  },
  {
    "event_id": "311381991",
    "title": "Casual Volleyball - North Jersey",
    "description": "We're a group of people who will start by hitting the ball around for the first 20-30 minutes and then will break up into 2-4 teams for two or three hours of play.\n\nIf we have more than 20 people show up, we'll break up into three or four teams of 6 (Some may have 7, 8 or 9. Additional players just rotate into play). Games will be to 10 points. Rally scoring. Winner stays on (unless a team has won four straight).\n\nWe'll be heading outdoors to the hard court in Leonia off Overpeck County Pk Driveway in the Overpeck County Park.\n\n\\*\\*\\* After playing, we'll be likely heading to Tropical Juice Bar, an idea of regular attendee Kate, for a drink and snack. It's located at 60 River St. in Hackensack. Feel free to join us or suggest another spot for a post-volleyball hangout. \\*\\*\\*\n\nThere's no fee to play volleyball and nothing else you need to do besides show up. Come anytime!! All are welcome!!! We're not in a league and are not here to analyze your form. We're more for people who haven't played in months, maybe years, and just want to occasionally play again and hang out.\n\nDirections: You can Google \"Volleyball Court in Leonia\" and it should come up. Or type 41 Willow Tree Road, Leonia, NJ 07605 into your GPS, but note that it's not on Willow Tree Road, just near it. Instead, turn onto Overpeck County Pk Driveway off Fort Lee Road (Degraw Avenue). It is past the tennis courts and near a basketball court and track. You can try Googling Leonia High School as well. That should help you find it.\n\nWe don't have the court reserved and if it happens to be taken, we may play with those already occupying it or we will try to relocate on the fly. It's certainly possible that we may have to cancel that day if we can't find a suitable spot. Please keep that in mind. And if it's looking like it'll rain or snow, I'll make a call on whether to cancel around an hour ahead of time.\n\nPlease bring a ball and net if you have them for possible use during the game. Feel free to bring a speaker for music, or snacks and drinks for consumption during play.\n\nIf you have trouble finding the court or group, you can call or text Andy Milone at 201-234-9609. There is plenty of parking and an open bathroom at the park.\n\nHope you'll join us for our 15th volleyball event. Questions or comments? You can message Andy on Meetup, or call/text him at 201-234-9609.\n\nCheck out bowling, soccer, volleyball, tennis or one of our other activities at: www.meetup.com/north-jersey-bowling-soccer-volleyball",
    "start_datetime": "2025-11-08T14:30:00-05:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/6/1/2/c/highres_525264876.jpeg",
    "event_url": "https://www.meetup.com/north-jersey-bowling-soccer-volleyball/events/311381991/"
  },
  {
    "event_id": "311039590",
    "title": "Halloween Bar Crawl - North Jersey",
    "description": "Come join the group for a Halloween Bar Crawl in Hoboken.\n\nWe'll be starting at Black Bear Hoboken Bar & Grill, 205 Washington St., and then traveling around from there. I'll provide my best guess for times and stops, and will have other info as we get closer to the date.\n\nOf course, join us at any time. We'll try to post updates as the night unfolds. It's totally optional to partake in any of the costume wearing or beverage consumption. Feel free to just come and have a good time hanging with familiar faces and meeting new ones.\n\nPlease be smart about travel. The train station is not far away and runs late. Parking can be a challenge, but there is a parking garage at 112 River St.\n\nThis idea comes to you courtesy of our Whatsapp group chat and was suggested by Ray and Raymond, two regular attendees of our events.\n\nQuestions? Suggestions? Concerns? You can reach out to Andy Milone at 201-234-9609 (call/text), or by message over Meetup or Whatsapp.",
    "start_datetime": "2025-10-31T18:30:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/7/4/7/6/highres_530189814.jpeg",
    "event_url": "https://www.meetup.com/north-jersey-bowling-soccer-volleyball/events/311039590/"
  },
  {
    "event_id": "311010354",
    "title": "2hrs Saturday Co Ed Pick up Soccer Games @ Chelsea Park",
    "description": "**PLEASE make payment to VENMO: [@Manahen-Sandoval,](https://account.venmo.com/u/Manahen-Sandoval) or CashApp: [$ManahenSandoval](https://cash.app) : Tel.(917 544-2423).**\n\n**NO CLEATS or PLASTIC STUD SHOES. ONLY INDOOR SHOES, ARTIFICIAL TURF SHOES OR SNEAKERS. Any questions regarding shoes, please reach out to organizers.**\n\n**GAME DESCRIPTION:**\n*Our games are open to people of all levels and ages, and for people who just love a nice game of soccer. Come break a sweat, while running up and down the field with the ball, in a very laid-back and non-judgmental environment.Please, arrive 10 minutes before the game.*\n\n**Game Format:**\n*3 simultaneous games of 7v7, with 12x6 goals. There will be 6 teams on the field and we will play 3 games, 30 minutes/game. After 30 minutes we will have a short break and teams will switch to play against different team. Please check our meetup message board on Friday night or before 9:00 am on Saturday to see what team you are on. This will save us a lot of time on the field.*\n\n**RULES OF THE GAME:**\n*1-First and most important rule of the game:Have fun and enjoy the time on the field!*\n*2-Rough play and offensive language will absolutely not be tolerated!*\n*In plain words, no slide tackling, no pushing and no telling off.*\n*3-No power shots allowed within 5 yards(safety first)*\n*4-If you don't sign up for the game, do not show up. You can’t sell or transfer your RSVP.*\n*5-If you are late for the game, you must wait until the game in progress is over to join your team.*\n*6-Those that don't comply with these rules, will kindly be asked to leave the field so others can enjoy the game.*\n*Any other questions regarding the rules of the game or anything else, should be directed to the organizer directly or to the assistant organizer/s! Please check our meetup Comment box on Friday night or before 9:00 am on Saturday to see what team you are on. This will save us time.*\n\n**Location:**\n**CHELSEA PARK.**\n*Between 27th and 28th street and 10th Avenue.*\n*Take the A,C or E subway line to 34th St;Penn Station and walk for about 8 minutes to 28th St and 10th Ave.*\n\n**What to bring with you:**\n*REMEMBER NO CLEATS. A pair of sneakers, indoor or turf shoes, shin guards (recommended) and lots of water.*\n\n**Fee:**\n*You will be asked to make payment when you RSVP. This is used to pay for: facility permits, meetup fees, goals, cones, soccer balls etc.*\n\n**Refunds & Weather Policy:**\n*Refunds will be issued if the RSVP is changed by Wednesday before 12.00PM or if the game is cancelled. The game can be cancelled if the weather conditions are severe like heavy rain, snow or thunder.*\n\n**After the game we'll go to Molly Wee for a pint or two:**\n*Molly Wee Restaurant*\n*402 8th Ave(30th & 8th Ave)*\n\n**PARTICIPATING IN MANHATTAN-INTERNATIONAL-COED-SOCCER ACTIVITIES AGREEMENT:**\n*I certify that I have no known medical or other conditions that could interfere with my participation in Manhattan-International-COED-Soccer activities. I also understand and accept that the practice of soccer, both indoor and outdoor, involves certain risks of physical injury. Therefore, I, individually, hereby release and discharge, Manhattan-International-COED-Soccer Organizer and Assistant Organizers from any and all claims, actions, damages, losses, liabilities, costs and expenses of any kind whatsoever, including but not limited to any claims of negligence, arising out of, resulting from, by reason of, or in connection with my participation in any of Manhattan-International-COED-Soccer programs or activities. Manhattan-International-COED-Soccer Organizer and its Assistant Organizers reserve the right to take and utilize photographs, video, or any type of recording of participating person while engaged in our or associated activities. I consent to Manhattan-International-COED-Soccer use the photograph, video, or recording of me, for advertising, promotional, or related purposes, and waive all rights to compensation and other rights which may arise as a result.I AGREE to Wear a MASK and respect SOCIAL DISTANCING with 6Ft apart while in water breaks. I will also provide my phone number for CONTACT TRACING*",
    "start_datetime": "2025-10-18T16:45:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": false,
    "ticket_min_price": "12.0",
    "image_url": "https://secure.meetupstatic.com/photos/event/9/f/4/0/highres_529600768.jpeg",
    "event_url": "https://www.meetup.com/nyc-soccer-pickup/events/311010354/"
  },
  {
    "event_id": "311010234",
    "title": "2hrs Sunday Co Ed Pick up Soccer Games @ Chelsea Park",
    "description": "## **PLEASE make payment to VENMO: [@Manahen-Sandoval,](https://account.venmo.com/u/Manahen-Sandoval) or CashApp: [$ManahenSandoval](https://cash.app) : Tel.(917 544-2423).**\n\n**NO CLEATS or PLASTIC STUD SHOES. ONLY INDOOR SHOES, ARTIFICIAL TURF SHOES OR SNEAKERS. Any questions regarding shoes, please reach out to organizers.**\n\n**GAME DESCRIPTION:**\n*Our games are open to people of all levels and ages, and for people who just love a nice game of soccer. Come break a sweat, while running up and down the field with the ball, in a very laid-back and non-judgmental environment.Please, arrive 10 minutes before the game.*\n\n**Game Format:**\n*3 simultaneous games of 7v7, with 12x6 goals. There will be 6 teams on the field and we will play 3 games, 30 minutes/game. After 30 minutes we will have a short break and teams will switch to play against different team. Please check our meetup message board on Friday night or before 9:00 am on Saturday to see what team you are on. This will save us a lot of time on the field.*\n\n**RULES OF THE GAME:**\n*1-First and most important rule of the game:Have fun and enjoy the time on the field!*\n*2-Rough play and offensive language will absolutely not be tolerated!*\n*In plain words, no slide tackling, no pushing and no telling off.*\n*3-No power shots allowed within 5 yards(safety first)*\n*4-If you don't sign up for the game, do not show up. You can’t sell or transfer your RSVP.*\n*5-If you are late for the game, you must wait until the game in progress is over to join your team.*\n*6-Those that don't comply with these rules, will kindly be asked to leave the field so others can enjoy the game.*\n*Any other questions regarding the rules of the game or anything else, should be directed to the organizer directly or to the assistant organizer/s! Please check our meetup Comment box on Friday night or before 9:00 am on Saturday to see what team you are on. This will save us time.*\n\n**Location:**\n**CHELSEA PARK.**\n*Between 27th and 28th street and 10th Avenue.*\n*Take the A,C or E subway line to 34th St;Penn Station and walk for about 8 minutes to 28th St and 10th Ave.*\n\n**What to bring with you:**\n*No exception: REMEMBER NO CLEATS. A pair of sneakers, indoor or turf shoes, shin guards (recommended) and lots of water.*\n\n**Fee:**\n*You will be asked to make payment when you RSVP. This is used to pay for: facility permits, meetup fees, goals, cones, soccer balls etc.*\n\n**Refunds & Weather Policy:**\n*Refunds will be issued if the RSVP is changed by Wednesday before 12.00PM or if the game is cancelled. The game can be cancelled if the weather conditions are severe like heavy rain, snow or thunder.*\n\n**After the game we'll go to Molly Wee for a pint or two:**\n*Molly Wee Restaurant*\n*402 8th Ave(30th & 8th Ave)*\n\n**PARTICIPATING IN MANHATTAN-INTERNATIONAL-COED-SOCCER ACTIVITIES AGREEMENT:**\n*I certify that I have no known medical or other conditions that could interfere with my participation in Manhattan-International-COED-Soccer activities. I also understand and accept that the practice of soccer, both indoor and outdoor, involves certain risks of physical injury. Therefore, I, individually, hereby release and discharge, Manhattan-International-COED-Soccer Organizer and Assistant Organizers from any and all claims, actions, damages, losses, liabilities, costs and expenses of any kind whatsoever, including but not limited to any claims of negligence, arising out of, resulting from, by reason of, or in connection with my participation in any of Manhattan-International-COED-Soccer programs or activities. Manhattan-International-COED-Soccer Organizer and its Assistant Organizers reserve the right to take and utilize photographs, video, or any type of recording of participating person while engaged in our or associated activities. I consent to Manhattan-International-COED-Soccer use the photograph, video, or recording of me, for advertising, promotional, or related purposes, and waive all rights to compensation and other rights which may arise as a result.I AGREE to Wear a MASK and respect SOCIAL DISTANCING with 6Ft apart while in water breaks. I will also provide my phone number for CONTACT TRACING.*",
    "start_datetime": "2025-10-19T16:45:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": false,
    "ticket_min_price": "12.0",
    "image_url": "https://secure.meetupstatic.com/photos/event/9/c/e/4/highres_529600164.jpeg",
    "event_url": "https://www.meetup.com/manhattan-international-coed-soccer/events/311010234/"
  },
  {
    "event_id": "311535179",
    "title": "RESCHEDULED for 10/20: Yes you CAN meditate! Free Class",
    "description": "This meeting is for everyone who wants to learn how to meditate, especially those who think they can't meditate because they can't stop their mind from thinking--a common misconception. If you're willing to be open and aware, you can meditate, regardless of how much or how little you're thinking.\nI will emphasize a simple awareness method, but I'll also describe the other two common techniques, mantra and breath watching, in case you feel more comfortable with those.\nWe will start with a short 15 minute meditation, then progress to 20 minutes. After each session we will discuss our experiences and any questions that may arise.\nCOST: Free.\nMY QUALIFICATIONS: I have been meditating daily for about fifty years. I attended a weekly Sufi meditation group for 24 years and a Buddhist one for 3 years, àlthough my approach will be primarily secular. And I wrote an article for the Berkley Wellness Letter about myths that discourage people from meditating.",
    "start_datetime": "2025-10-20T18:30:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/b/e/8/c/highres_464568780.jpeg",
    "event_url": "https://www.meetup.com/nyc-walks-nature-beauty-peace/events/311535179/"
  },
  {
    "event_id": "310741599",
    "title": "⚽️✨🌙@Chelsea Waterside 🥅Master League (Advanced football Session- INVITE ONLY)",
    "description": "**\\*\\*\\*New members MUST send us a short intro about your football experience before RSVPing. Email: HRFCNY@gmail.com**\n\n**Master League Hosted by Hudson River FC**\nHRFC will carefully form 4 teams each session, considering players’ fitness levels, skills, and on-field chemistry.\nOur main goal is to help refine and fine-tune players’ skills while maintaining top-level fitness. Along with our coaches, I will provide coaching and mentorship to our players as part of our elite-level NY football community.\n\n***Welcome to Hudson River FC, the highly creative and competitive soccer group! Our top priority is to focus on high-quality football session in downtown NYC. This is for advanced players who want to refine developed skills, improving first touch, encouraging one-touch one-two passing, elevating football IQ, enhance teamwork communication, establishing rhythm in gameplay, and creating scoring opportunities.***\n\n**Guidelines**:\nNo slide tackles allowed!\nMake your own calls.\nPlease arrive 15 minutes early!\nEmbrace creativity!\n\n**Payment Information:**\nAfter signing up, please proceed to secure your spot\nPayment methods:\nVenmo: @slamslam008 (Please indicate date & location)\nZelle: (Message me for Zelle info)\nPayPal: sunny2forest@gmail.com (friends & family)\n**Attire:**\nWe provide colored pinnies for our games, but please also bring a white and black tee.\n**Weather Policy:**\nGames take place rain or shine unless you receive a cancellation notification from us.\n**Disclaimer:**\nOur pickup soccer session is not liable for any injuries that may occur while playing. By RSVPing to attend our games, you accept full responsibility for your personal belongings and waive any right to hold the group responsible",
    "start_datetime": "2025-10-19T15:30:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": false,
    "ticket_min_price": "18.0",
    "image_url": "https://secure.meetupstatic.com/photos/event/1/d/6/d/highres_529867533.jpeg",
    "event_url": "https://www.meetup.com/new-york-pick-up-soccer-group/events/310741599/"
  },
  {
    "event_id": "311484317",
    "title": "Gowanus Open Studios: Unexpected Beauty",
    "description": "Numerous artists will be opening their studios this weekend in Gowanus, Brooklyn, infamous for its polluted canal--a once-rundown, low-rent neighborhood that's on the upswing now that it has attracted a thriving community of artists. Judging from the online pictures, there's a ton of topnotch, authentic art here--smaller, less glitzy, and more personal than the blockbusters in Chelsea and Uptown. Time and energy permitting, we may walk at the end of the day in Prospect Park.\n\nDISTANCE: About 2-4 miles, depending on whether we visit Park Slope and Prospect Park\n\nENDING TIME: Around 5 PM. But you can leave earlier, of course.\n\nLUNCH: Bring your own. We'll eat at around 1:40, in a nearby park.\n\nCOST: $1, to help cover Meetup's $390 annual organizer fee.\n\nTRANSPORTATION: F or G train to Smith and 9th St.",
    "start_datetime": "2025-10-19T12:15:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/5/0/9/e/highres_530660638.jpeg",
    "event_url": "https://www.meetup.com/nyc-walks-nature-beauty-peace/events/311484317/"
  },
  {
    "event_id": "311051124",
    "title": "The Dating Event - under 35",
    "description": "Limited tickets - address will be sent once you have bought the tickets.\n\nJoin our dating event! 😊 Tired of swiping on dating apps that just don’t work? We’re hosting a fun, in-person dating event to help you connect with real people.\n\n There’s a $20 ticket fee to make sure we attract serious people only.\n\n Final location will shared later\n\n After the event, you can swipe left or right on the people you met or saw at the event. If there’s a match, you can keep the conversation going!",
    "start_datetime": "2025-10-18T19:00:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/b/1/f/0/highres_528765552.jpeg",
    "event_url": "https://www.meetup.com/bronx-sociale-meetup-group/events/311051124/"
  },
  {
    "event_id": "311407491",
    "title": "Empire Skate Clubs 2025 Sleepy Hollow Halloween Skate",
    "description": "**HIGHLIGHTS:**\nWe group up from 8:45 a.m. to 9:15 a.m.\nWE SKATE OFF AT 9:15 A.M. !!\nThis is an INTERMEDIATE to ADVANCED LEVEL SKATE EVENT of approximately 30 miles from the Lincoln Center area in Manhattan to Sleepy Hollow in Westchester County, NY (This event description will be followed by another with options to meet us along the route in upper Manhattan or the Bronx if you prefer fewer miles or a later start time.)\n\nMuch of the route will be on trails including the Hudson River Greenway and the South County Trail which we can now access from the newly-paved trail in Van Cortlandt Park in the Bronx.\nWe are hoping to have a sag wagon. For many years, RON and JAN have been kind enough to volunteer their cars and time to make the journey more comfortable for their skater friends. We will let you know if there will be a sag wagon for bags and costume parts etc. in a future post.\nThe Tarrytown Parade Committee has invited us back to roll in the parade as we did in 2017, 2019, 2022, 2023 and 2024. Both Tarrytown and Sleepy Hollow go all out with decorations and create a very festive atmosphere for their visitors and those who participate in and attend the parade.\n**THE SKATE:**\n\nJoin MOONMAN PETE as he leads a group of costumed skaters north from Manhattan to the Old Dutch Church and the Sleepy Hollow Cemetery in Sleepy Hollow, NY to chase down the Headless Horseman, the fictional character from Washington Irving's Classic story, \"The Legend of Sleepy Hollow\". The remains of author Washington Irving lie in the cemetery and, according to legend, so do the remains the Headless Hessian Horseman, who apparently rises up each evening and gallops through the village in search of the head that he lost in battle.\nIn recent years, the skate has started out on the trails of Riverside Park and the Hudson River Greenway and continued through Inwood in upper Manhattan until we cross over to the Bronx via the Broadway Bridge. After a few miles in the Bronx, we return to the trails as we enter Westchester County’s South County Trail and follow it all the way to Dobbs Ferry, NY. At that point, we skate west to the Hudson River and roll north through several river villages until we reach our destination – the Old Dutch Church and the Sleepy Hollow Cemetery.\nTraditionally, we gather for a meal after the skate, but you can choose to explore the villages instead. The Metro-North train from Tarrytown to Manhattan is nearby and provides an express trip to Grand Central of approximately 50 to 60 minutes.\nMore details about the event, including meet-up options, the route, and the post-skate gathering will follow shortly in the \"Discussion\" section of the event post.\nHALLOWEEN ON WHEELS is 3 weeks away….get busy with the costume creation, get yourself fit for the skate and the parade, and join the Empire Skate Club as it celebrates one of the year's best holidays on skates!",
    "start_datetime": "2025-10-25T08:45:00-04:00",
    "end_datetime": null,
    "venue_name": null,
    "venue_city": null,
    "categories": [
      "Sports & Fitness"
    ],
    "is_free": true,
    "ticket_min_price": "0",
    "image_url": "https://secure.meetupstatic.com/photos/event/3/2/e/e/highres_530593038.jpeg",
    "event_url": "https://www.meetup.com/nycrollerbladers/events/311407491/"
  }
]